{"name":"D Language Foundation","description":"Write fast, read fast, and run fast.","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/d-language-foundation","ideas_url":"https://dlang.github.io/GSoC/","logo":"https://summerofcode.withgoogle.com/media/org/d-language-foundation/u25qvh5ljfkkhkjj.png","technologies":["linux","make","d","windows","C\\\\C++"],"topics":["operating systems","programming languages","algorithms","data structures","optimizations"],"projects":[{"project_name":"DLang Google Summer of Code (GSoC) Overview","summary":"An introduction to the DLang GSoC repository and its structured resources for yearly participation.","difficulty":"N/A"},{"project_name":"Becoming a Contributor","summary":"Guidelines for new contributors to engage with the D community through forums and Discord, encouraging small contributions to projects.","difficulty":"Easy"},{"project_name":"Choosing a Project","summary":"Steps to select a project for GSoC, including reviewing ideas and finding a mentor, with advice to propose new project ideas if existing ones don't fit.","difficulty":"Medium"},{"project_name":"Application Process","summary":"Instructions for preparing and submitting a GSoC application, detailing required sections like resume and project description, along with important submission dates.","difficulty":"Medium"}],"jina_response":"Title: DLang Google Summer of Code\n\nURL Source: https://dlang.github.io/GSoC/\n\nMarkdown Content:\n[](https://dlang.github.io/GSoC/#description)Description\n--------------------------------------------------------\n\nYou can access the DLang GSoC repository at [https://github.com/dlang/gsoc](https://github.com/dlang/gsoc). This repository contains information about DLang’s yearly involvement in GSoC. Its content is structured as follows:\n\n```\n./\n|-- index.md                        # The page you are viewing now\n|-- gsoc-<year>/                    # Resources for the given year\n|   |-- project-ideas.md            # Description of the D ecosystem and the list of mentors\n|   |-- <project-idea-1>.md         # Description of one project idea\n|   |-- <project-idea-2>.md         # Description of another project idea\n[...]\n|   `-- project-progress/\n|       |-- <project-name-1>.md     # Periodic updates for one project\n|       |-- <project-name-2>.md     # Periodic updates for another project\n[...]\n```\n\n[](https://dlang.github.io/GSoC/#become-a-dlang-gsocc-contributor)Become a DLang GSocC Contributor\n--------------------------------------------------------------------------------------------------\n\n### [](https://dlang.github.io/GSoC/#first-steps)First Steps\n\nIf you are not currently active in the D community, we encourage you to stop by our online forum and our Community Discord server to say hello. There are plenty of helpful people around to welcome you into the community and provide advice and guidance.\n\n*   Forums - [https://forum.dlang.org/](https://forum.dlang.org/)\n*   Discord - [https://discord.gg/tw2c6mcKAp](https://discord.gg/tw2c6mcKAp)\n*   You can also contact Mike Parker at social@dlang.org for direct assistance at any stage of the process.\n\nStart with the [Contributor guide](https://wiki.dlang.org/Starting_as_a_Contributor). Then make some small contributions. Filter through the GitHub issues using the labels to find entry-level improvements you can bring to either:\n\n1.  [The DMD reference compiler](https://github.com/dlang/dmd/issues?q=is%3Aissue%20state%3Aopen%20label%3ASeverity%3Adocumentation%2CSeverity%3Aminor%2CSeverity%3ARefactoring%2CSeverity%3Atrivial%2C%22Severity%3ABug%20Fix%22%20)\n    \n2.  [The Phobos standard library](https://github.com/dlang/phobos/issues?q=is%3Aissue%20state%3Aopen%20label%3ASeverity%3Adocumentation%2CSeverity%3Aminor%2C%22Severity%3ABug%20Fix%22%2CReview%3ATrivial)\n    \n\nWe cannot stress this enough: ask the community for guidance whenever you feel stuck or lost.\n\n### [](https://dlang.github.io/GSoC/#choose-your-project)Choose Your Project\n\nBefore writing the application, you should have a solid idea of the project you’d like to commit to. Your project should require enough effort to keep you occupied throughout the event while also being beneficial to the D community. You can find a list of project ideas in [the dlang/project-ideas repository](https://github.com/dlang/project-ideas/) Be sure to read through the description on that page.\n\nIf none of the ideas in that repository are appealing to you, feel free to propose a different project. You might also solicit ideas [in the forums](https://forum.dlang.org/) or [on the Community Discord server](https://discord.gg/tw2c6mcKAp).\n\nWith a project selected, it’s time to find a mentor. Some of the project descriptions in the project ideas repository list potential mentors. If not, or if your project idea did not come from that repository, feel free to reach out in the forums, on the Discord server, or to Mike Parker (social@dlang.org) for help finding a mentor.\n\n### [](https://dlang.github.io/GSoC/#the-application)The Application\n\nOnce you’ve settled on a project, it’s time to write your application. It should contain the following information at the top:\n\n*   A descriptive title\n*   An email address at which we can contact you\n*   Your mentor’s name and email address\n\nThe remainder of the application should be divided into the following sections: resume, project description, and an optional Extras section.\n\n#### [](https://dlang.github.io/GSoC/#resume)Resume\n\nBriefly explain who you are and why you should be selected. Describe any experience you have with the D programming language and/or the language(s) you’re most comfortable working with. We do not expect applicants to have prior experience with the D programming language, but we want to have a good idea of what your background is. Tell us about your experience as a programmer: programming languages you’ve learned, projects you’ve worked on, and programming-related topics you’ve studied. We recommend including a link to your GitHub profile if you have any existing work there that you’d like us to see.\n\n#### [](https://dlang.github.io/GSoC/#project-description)Project Description\n\nIn 800 words or less, describe the project that you are willing to devote several weeks to. Why did you select it? What specific goals do you want to achieve? Can it be completed within the GSoC timeframe, or will it require additional work post-event? How will it benefit the D ecosystem and/or community?\n\nAt the end of this description, include a rough set of milestones for the project. You should work with your mentor on this.\n\nIf there is anything that might interfere with your work on this project, e.g., summer school or a job, please let us know here. Include any other information you think we should know.\n\n#### [](https://dlang.github.io/GSoC/#apply)Apply\n\nTo apply to GSoc, please submit your application on the [official GSoC website](https://summerofcode.withgoogle.com/). In 2025 submissions are active between March 24 and April 8.\n\n### [](https://dlang.github.io/GSoC/#conclusion)Conclusion\n\nAll of us in the D community want to see your project succeed. We’ll do everything we can to help you along the way, starting with your application. Please never hesitate to ask for assistance. Good luck!\n"}