{"name":"Drupal Association","description":"The best open source digital experience platform","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/drupal-association","ideas_url":"https://www.drupal.org/project/gsoc","logo":"https://summerofcode.withgoogle.com/media/org/drupal-association/kfbn4ws0uftixkho-360.png","technologies":["mysql","javascript","html","php","symfony"],"topics":["web","cloud","DXP","Massive community","Inclusive"],"projects":[{"project_name":"Google Summer of Code","summary":"An initiative for proposing projects and addressing administrative issues for Google Summer of Code within the Drupal community.","difficulty":"Intermediate"},{"project_name":"Community Building through GSoC","summary":"The project aims to leverage GSoC to unite and grow the open-source Drupal community by recruiting top talents to tackle key challenges facing Drupal.","difficulty":"Basic"},{"project_name":"Selection Criteria and Code of Conduct","summary":"Establishing a transparent selection process and adherence to a code of conduct for participants to ensure fair practices in project selection.","difficulty":"Intermediate"},{"project_name":"GSoC Mentor Roles and Responsibilities","summary":"Encourages experienced members to mentor students, guiding them through the project lifecycle while upholding Drupal community standards.","difficulty":"Basic"},{"project_name":"Strategic Initiatives Focus","summary":"Aiming to find and engage around 10 students to focus on critical challenges, ensuring progress in Drupal's strategic initiatives.","difficulty":"Advanced"}],"jina_response":"Title: Google Summer of Code\n\nURL Source: https://www.drupal.org/project/gsoc\n\nPublished Time: 2021-02-23T16:25:27+00:00\n\nMarkdown Content:\nThis project is for proposing projects, logging the administrative issues, mentor meetings, and credit for contributors helping to organize Google Summer of Code and related programs.\n\nCheck our issue queue and add projects if you can think of more! Or add your name as mentor to the existing ones.\n\nThe vision of the Drupal Association is to establish the community-built Drupal software as the leading platform for the Web and how? Well, by uniting a global open source community to build, secure, and promote Drupal. It is in clear that in order to achieve this ambitious goal, we constantly need to challenge ourselves and others and grow our community with fresh bright minds. Google Summer of Code has historically been a great source of finding these talents and are an amazing example of our more internal tagline -\\> Come for the code, stay for the community.\n\nWe would love to have +- 10 students, focussing on the main challenges that Drupal has today in order to stay a top of class Digital Experience Platform. We would consider it a success if we find students that want to tackle these challenges with us together. These strategic initiatives can be found at [https://www.drupal.org/about/core/strategic-initiatives](https://www.drupal.org/about/core/strategic-initiatives). It would be successful if we could make progress in these initiatives with motivated students that would stay after the program and maybe also see opportunities for them to find a way to keep tackling these problems in a professional setting (eg, their own business or in a company). This both helps the students, the economy and the Drupal project mission & vision\n\n**Resources**:\n\n*   [List of proposals (issue queue of this project)](https://www.drupal.org/project/issues/gsoc?text=&status=Open&priorities=All&categories=All&version=All&component=Organization)\n*   [Documentation](https://www.drupal.org/docs/develop/google-summer-of-code)\n*   [History of Google Summer of Code in Drupal](https://www.drupal.org/docs/develop/google-summer-of-code/history-of-google-summer-of-code)\n*   **Drupal's GSoC 2025 Project Idea Page @**[https://www.drupal.org/project/issues/gsoc?text=2025&status=All&prioriti...](https://www.drupal.org/project/issues/gsoc?text=2025&status=All&priorities=All&categories=All&version=All&component=All)\n*   **Drupal's GSoC 2024 Project Idea Page @**[https://www.drupal.org/project/issues/gsoc?text=2024&status=All&prioriti...](https://www.drupal.org/project/issues/gsoc?text=2024&status=All&priorities=All&categories=All&version=All&component=All)\n*   **Drupal's GSoC 2023 Project Idea Page @** [https://www.drupal.org/project/issues/gsoc?text=2023&status=All&prioriti...](https://www.drupal.org/project/issues/gsoc?text=2023&status=All&priorities=All&categories=All&version=All&component=All)\n*   **Drupal's GSoC 2022 Project Idea Page @** [https://groups.drupal.org/node/536647](https://groups.drupal.org/node/536647)\n*   **Drupal's GSoC 2021 Project Idea Page @** [https://groups.drupal.org/node/536212](https://groups.drupal.org/node/536212)\n*   Google's Summer of Code Official Website - [https://summerofcode.withgoogle.com](https://summerofcode.withgoogle.com/)\n*   GSoC Drupal Projects: [2019](https://groups.drupal.org/node/534703), [2018](https://groups.drupal.org/node/518074), [2017](https://groups.drupal.org/node/516884), [2016](https://groups.drupal.org/node/510665), [2015](http://www.google-melange.com/gsoc/org2/google/gsoc2015/drupal), [2014](http://www.google-melange.com/gsoc/org2/google/gsoc2014/drupal), [2013](http://www.google-melange.com/gsoc/org2/google/gsoc2013/drupal), [2012](http://www.google-melange.com/gsoc/org2/google/gsoc2012/drupal), [2011](http://www.google-melange.com/gsoc/org2/google/gsoc2011/drupal), [2010](http://www.google-melange.com/gsoc/org2/google/gsoc2010/drupal), [2009](http://www.google-melange.com/gsoc/org2/google/gsoc2009/drupal), [2008](https://developers.google.com/open-source/soc/2008/?csw=1#drupal), [2007](https://developers.google.com/open-source/soc/2007/?csw=1#drupal), [2006](https://developers.google.com/open-source/soc/2006/?csw=1#drupal), [2005](https://developers.google.com/open-source/soc/2005/?csw=1#drupal)\n*   [Schedule/Timeline](https://summerofcode.withgoogle.com/how-it-works/#timeline)\n*   [Drupal's Getting Started guide for GSoC students](https://www.drupal.org/node/2415225)\n*   [GSoC Student Application template for Drupal](https://groups.drupal.org/node/411293)\n*   [Sample Applications from last year](https://groups.drupal.org/node/459223)\n\nDrupal GSOC Standards and Requirements\n--------------------------------------\n\nDrupal has participated in Google Summer of Code from the very beginning, and each year we have a vibrant community of potential contributors - always with more good proposals than the Google team is able to fund for that cohort. Therefore, we have developed ways to help make difficult choices about which projects we nominate.\n\n### Drupal GSOC Code of Conduct\n\nOne important element is that we expect all GSOC contributors, mentors, admins, etc to adhere to the Drupal Code of Conduct for our community in general, and also a specific GSOC Drupal participant code of conduct. This code of conduct outlines some key principles:\n\n*   That we will adhere first and foremost to the requirements and standards laid out by GSOC.\n*   That the criteria for project selection will be transparent.\n*   That the _specific details_ of a proposal's ranking will be confidential.\n*   That all contributors understand there is no entitlement to be selected.\n*   That we will handle disagreement and conflict with grace, and escalate to the proper channels (the Drupal org admins) for resolution.\n*   That contributors or mentors who impersonate multiple users will be disqualified for the program.\n*   Etc - more details to be published in the full document.\n\n### Drupal GSOC Contributor Requirements\n\nIn addition to the standard requirements of the GSOC program, we do have some requirements specific to the Drupal community:\n\n*   Proposals must be either: entirely original work, or endorsed and approved of by the project maintainer the proposal intends to support.\n*   Proposals should not be repeats of previous GSOC projects.\n*   Proposals should not be plagiarized.\n*   Any use of AI in the writing of the proposal must be disclosed.\n*   Contributors will need to submit a 1 minute video along with their proposals, in part to prevent impersonation of multiple users, but also to help hear about the contributor's passion for the project in their own words.\n*   Contributors should make a significant effort to join the Drupal community (including Drupal.org and Drupal slack) before the end of the proposal period, and should begin building relationships with potential mentors prior to the proposal deadline.\n\n### Drupal GSOC Proposal Selection Criteria\n\nThe organization admins and mentors will undergo a standardized selection process. There is some room for admin and mentor discretion in this process, but the universal criteria are as follows:\n\n*   Y/N - Has the proposal already been made before?\n*   Y/N - Has a mentor agreed to support this contributor if the proposal is selected? (Admins do not \\*assign\\* mentors - unless they ask - a mentor must have proactively selected the projects they would support)\n*   1-5 - What was the Contributors level of engagement with mentors, other contributors, and community during the application period? (i.e: did they join drupal.org and drupal slack and get engaged, or only come in right at the deadline).\n*   1-5 - Prior history of contribution to open source or Drupal specifically\n*   1-5 - Educational/Community Building Opportunity - i.e: Does this contributor broaden our community reach to new geographies or demographics.\n*   1-5 - Subjective mentor ranking of the proposal and the contributor's qualifications\n*   1-5 - Subjective admin ranking of the proposals, with the big picture of the cohort in mind\n\nEach of these criteria is fed into a **weighted average** (the weighting is private to the mentors/admins) - and used to make the **final ranking**.\n"}