{"name":"Fedora Project","description":"Freedom, Friends, Features, and First.","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/fedora-project","ideas_url":"https://docs.fedoraproject.org/en-US/mentored-projects/gsoc/2025/ideas/","logo":"https://summerofcode.withgoogle.com/media/org/fedora-project/shb5orpvxtdcerqq-360.png","technologies":["python","bash","rpm","security","Container"],"topics":["platform","ai","operating system","LLM","NetworkManager"],"projects":[{"project_name":"AI-Powered Log Triage and Security Alert Aggregator for Fedora","summary":"This project aims to create a tool that automatically processes and prioritizes security logs from various sources on Fedora, improving visibility of critical alerts.","difficulty":"Easy"},{"project_name":"Create a Service to Get a New Project to Fedora More Easily","summary":"This project focuses on developing a user-friendly service to streamline the addition of new projects to Fedora Linux using a pull-request workflow, facilitating feedback for newcomers.","difficulty":"Easy"}],"jina_response":"Title: Ideas for Student Projects for 2025\n\nURL Source: https://docs.fedoraproject.org/en-US/mentored-projects/gsoc/2025/ideas/\n\nMarkdown Content:\nHow to edit this page\nIn this section\nFedora Mentored Projects\nMentored Projects\nGoogle Summer of Code\n2025\nInformation\nIdeas\nApplication Process\n2024\n2022\n2021\n2020\n2019\n2018\n2017\n2016\n2015\n2014\n2013\n2012\n2011\n2010\n2009\n2008\n2007\n2006\n2005\nGoogle Code In\nGoogle Season of Docs\nOutreachy\nHandbooks\nFedora Mentored Projects\nFedora Mentored Projects\nGoogle Summer of Code\n2025\nIdeas\nen-US\nContents\nSupporting Mentors\nIdea List\nAI-Powered Log Triage and Security Alert Aggregator for Fedora\nCreate a service to get a new project to Fedora more easily\nIdeas for Student Projects for 2025\n\tFedora is applying to be a GSoC mentoring organization.\n\nIf you are a student looking forward to participating in Google Summer of Code with Fedora, please feel free to browse this idea list. There may be additional ideas added during the application period.\n\nNow please go read the What Can I do Today section of the main page. This has the answers to your questions and tells you how to apply\n\nDo not hesitate to contact the mentors or contributors listed on this page for any questions or clarification. You can find helpful people on the IRC channel, or use the mailing list. can be used for getting help with programming problems.\n\nSupporting Mentors\n\nThe following contributors are available to provide general help and support for the GSoC program If a specific project mentor is busy, you can contact one of the people below for short-term help on your project or task. add yourselves and your wiki page).\n\nSumantro Mukherjee (General development, quality, general Linux, Fedora community, GSoC alumnus, questions about program, misc. advice)\n\nFernando F. Mancera (GSoC, general linux, Fedora community, Mentoring, Networking)\n\nIdea List\n\tIdeas are subject to change as additional mentors are onboarded.\n\nAI-Powered Log Triage and Security Alert Aggregator for Fedora\n\nCreate a service to get a new project to Fedora more easily\n\nAI-Powered Log Triage and Security Alert Aggregator for Fedora\n\nDifficulty : Easy\n\nType : 1 person full time 350hrs (12 weeks)\n\nTechnology : python, bash, scikit-learn, pytorch, tensorflow, security, AI, LLMs\n\nMentor : Huzaifa Sidhpurwala\n\nEmail : huzaifas@redhat.com\n\nDescription\n\nThis project aims to automatically parse, classify, and prioritize security-related logs on a Fedora system. The tool will aggregate logs from multiple sources (e.g., SELinux, systemd journal, audit logs) and apply basic machine learning (ML) or natural language processing (NLP) techniques to identify and prioritize potential security events. It will help administrators quickly spot critical alerts while reducing noise from routine messages.\n\nDeliverables\n\nAs a GSoC intern, you will be responsible for the following :\n\nSource Code Repository: A publicly accessible GitHub/GitLab project containing all scripts, models, and integration logic.\n\nPackaged RPM: A Fedora-compliant RPM package that users can install to deploy the log triage tool.\n\nDocumentation: Concise instructions covering installation, usage, configuration, and development/contribution guidelines.\n\nDemonstration/Prototype: A working setup (CLI or basic UI) showcasing how logs are collected, classified, and prioritized in real time.\n\nTesting & Evaluation Results: A set of tests (unit/integration) plus any benchmarking or evaluation reports on model performance and accuracy.\n\nCreate a service to get a new project to Fedora more easily\n\nDifficulty : Easy\n\nType : 1 person full time 350hrs (12 weeks)\n\nTechnology : Python, Git, git-forges knowledge and Linux\n\nMentor : František Lachman\n\nEmail : flachman@redhat.com\n\nDescription\n\nThis project aims to help people with less experience add a project (=package) to Fedora Linux by using pull-request workflow to be able to get feedback both from tools and more experienced packagers.\n\nDeliverables\n\nSource Code Repository: Either a contribution to existing tools (e.g. FedoraReview, Fedora review service and/or Packit) and/or another publicly accessible GitHub/GitLab project containing all the code and scripts.\n\nDocumentation: Concise instructions covering the service and its deployment, testing and development but also usage.\n\nDemonstration/Prototype: A working setup showcasing how this service works and integrating at least a single automatic feedback.\n\nTesting & Evaluation Results: A set of tests (unit/integration) of the new code.\n\nDeployment: The service is deployed and running or it is available to be run and deployed in the form of a container.\n\nWant to help? Learn how to contribute to Fedora Docs ›\n\nAll Fedora Documentation content available under CC BY-SA 4.0 or, when specifically noted, under another accepted free and open content license.\n\nPrivacy Statement\nLegal\nCode of Conduct\nSponsors\n\nLast build: 2025-03-01 05:50:11 UTC | Last content update: 2025-02-12\n\nFedora is sponsored by Red Hat.\nLearn more about the relationship between Red Hat and Fedora.\n"}