{"name":"GeomScale","description":"Scalable geometric and statistical software","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/geomscale","ideas_url":"https://github.com/GeomScale/gsoc25/wiki/table-of-proposed-coding-projects","logo":"https://summerofcode.withgoogle.com/media/org/geomscale/ongpste986nd7t6p-360.png","technologies":["python","c++","r","jupyter","github-actions"],"topics":["mathematics","data science","computational biology","computational geometry","statistics"],"projects":[{"project_name":"Project Size Options","summary":"Contributors must choose between small (~90 hours), medium (~175 hours), or large (~350 hours) projects for GSoC 2025.","difficulty":"Varies by project size"},{"project_name":"GeomScale Repositories","summary":"Projects are hosted across several repositories: volesti (C++), Rvolesti (R), dingo (Python), and PorQua (Python).","difficulty":"Medium"},{"project_name":"Types of Projects","summary":"Two project types are available: R&D (requires deep mathematical understanding) and Dev (focused on implementation).","difficulty":"R&D is typically more demanding than Dev."},{"project_name":"Proposal Process","summary":"Interested contributors should select projects, perform a test, and provide results before approaching mentors.","difficulty":"Basic project evaluation"},{"project_name":"Selection Criteria","summary":"Proposals will be ranked based on quality, contributor ability, and project impact; only a limited number of projects will be accepted by Google.","difficulty":"Competitive"},{"project_name":"Mentorship and Discussions","summary":"All proposals will be discussed within the GeomScale mentor community; mentors can add ideas to the project table.","difficulty":"Community involvement"},{"project_name":"Application Steps","summary":"Candidates should select projects, provide detailed descriptions and methodologies, and share personal data with mentors.","difficulty":"Moderate to high depending on project complexity"},{"project_name":"Application Information Required","summary":"Candidates must supply personal data, programming skills, project interests, and commitment level for full-time work during the program.","difficulty":"Medium"}],"jina_response":"Title: table of proposed coding projects\n\nURL Source: https://github.com/GeomScale/gsoc25/wiki/table-of-proposed-coding-projects\n\nMarkdown Content:\n* * *\n\n⚠️ **NOTE**\n\nThis year contributors will have to choose between a ~90 hours small-sized project, ~175 hours medium-sized project or ~350 hours large project. For more information please read the [official gsoc website](https://summerofcode.withgoogle.com/) as well as [GeomScale's introductory wiki for GSoC 2025](https://github.com/GeomScale/gsoc25/wiki).\n\n* * *\n\nGeomScale hosts a few projects in different github repositories. The most mature one is [volesti](https://github.com/GeomScale/volesti) written in C++. Then there are two repositories that act as interfaces of volesti (i) [Rvolesti](https://github.com/GeomScale/Rvolesti) in _R_ that also contains utilities for financial applications and (ii) and [dingo](https://github.com/GeomScale/dingo) written in _Python_ (uses C++ functions of volesti via Cython) and contains utilities for biological applications. Finally, there is [PorQua](https://github.com/GeomScale/PorQua) a Python package for index replication in finance.\n\nProposed projects are related to those repositories. There are **two** types of coding projects: research and development (marked as _R&D_ in the table below) and pure development (marked as _Dev_ in the table below). _R&D_ projects needs a deep understanding of the mathematical background in addition to the implementation details that are needed by the _Dev_ projects. Typically the former is more demanding than the later but this also depends on the background of the contributor.\n\n* * *\n\nMentors, please edit this wiki page, and add your ideas to the table below.\n\nContributors, please look for a project that interests you in the table below. Before emailing project mentors, please do at least one project **test** and post a link to your solution on the proposal's wiki page.\n\n| Proposal | Type | Languages | Size | Hours |\n| --- | --- | --- | --- | --- |\n| [Randomized SDP solver](https://github.com/GeomScale/gsoc25/wiki/Randomized-solver-for-Semidefinite-Programs) | R&D | C++/R | Large | 350 |\n| [(even) More efficient volume computation](https://github.com/GeomScale/gsoc25/wiki/(even-more-efficient)-Volume-computation) | R&D | C++ | Large | 350 |\n| [Non-convex sampling in dingo](https://github.com/GeomScale/gsoc25/wiki/non-convex-sampling) | R&D | C++ /Python | Large | 350 |\n| [Exclude Lpsolve from R and C++ interfaces of volesti](https://github.com/GeomScale/gsoc25/wiki/Exclude-Lpsolve) | Dev | C++/R | Medium | 175 |\n| [Improve the Cpp implementation of rounding method in volesti library](https://github.com/GeomScale/gsoc25/wiki/Improve-the-Cpp---implementation-of-rounding-method-in-volesti-library) | Dev | C++ | Medium | 175 |\n| [Develop a new rounding method for convex polytopes](https://github.com/GeomScale/gsoc25/wiki/Develop-a-new-rounding-method-for-convex-polytopes) | Dev | C++ | Medium | 175 |\n| [Counting linear extensions with volume computation and applications in AI](https://github.com/GeomScale/gsoc25/wiki/Counting-linear-extensions-with-volume-computation-and-applications-in-AI) | R&D | C++ | Large | 350 |\n| [Expose sampling and volume on spectrahedra to R interface of volesti](https://github.com/GeomScale/gsoc25/wiki/Spectrahedra-R-interface) | Dev | R/Rcpp | Medium | 175 |\n| [Expose autodiff to R interface of volesti](https://github.com/GeomScale/gsoc25/wiki/Autodiff-R-interface) | Dev | R/Rcpp | Medium | 175 |\n| [Enhancing Rvolesti: Integration of Advanced Rounding Routines](https://github.com/GeomScale/gsoc25/wiki/Enhancing-Rvolesti-%E2%80%93-Integration-of-Advanced-Rounding-Routines) | Dev | R/Rcpp | Small | 90 |\n| [Supporting Sparse Matrix Representation for H‐Polytopes in Rvolesti](https://github.com/GeomScale/gsoc25/wiki/Supporting-Sparse-Matrix-Representation-for-H%E2%80%90Polytopes-in-Rvolesti) | Dev | R/Rcpp | Small | 90 |\n| [Developing a Comprehensive Unit Test Framework for PorQua](https://github.com/GeomScale/gsoc25/wiki/Developing-a-Comprehensive-Unit-Test-Framework-for-PorQua) | Dev | Python | Small | 90 |\n| [General Sampling and Volume Computation in Dingo](https://github.com/GeomScale/gsoc25/wiki/General-Sampling-and-Volume-Computation-in-Dingo) | Dev | Python | Large | 350 |\n| [Interactive Web API for PorQua](https://github.com/GeomScale/gsoc25/wiki/Interactive-Web-API-for-PorQua) | Dev | Python | Medium | 175 |\n| [PorQua – A Framework for Constructing and Backtesting Investment Strategies](https://github.com/GeomScale/gsoc25/wiki/PorQua-%E2%80%93-A-Framework-for-Constructing-and-Backtesting-Investment-Strategies) | Dev | Python | Large | 350 |\n| [Shake and Bake ‐ Sampling from the boundary of convex polytopes](https://github.com/GeomScale/gsoc25/wiki/Shake-and-Bake-%E2%80%90-Sampling-from-the-boundary-of-convex-polytopes) | Dev | C++ | Large | 350 |\n\nAll contributor applications will be discussed by the **GeomScale** mentor community, and proposals will be ranked considering factors such as quality, contributor's ability to successfully finish the project, and impact for the **GeomScale** project. A finite number of slots will be granted to **GeomScale** by Google, thus, only the best proposals will get chosen. This implies that it is possible that some ideas will not become GSoC projects even if they are supported by a good contributor application.\n\nContributors, if you are interested in a coding project related to **GeomScale** that is not listed above, please try to find mentors by posting a description of your project idea on the [gitter](https://gitter.im/GeomScale/community?utm_source=share-link&utm_medium=link&utm_campaign=share-link). If you find mentors, feel free to add your project idea to this wiki and write an application.\n\nInformation Candidates Should Supply\n------------------------------------\n\n[](https://github.com/GeomScale/gsoc25/wiki/table-of-proposed-coding-projects#information-candidates-should-supply)\n\nThe application process has several steps. Before contacting anybody verifies that you are eligible. The next step is to contact the mentor of the project you are interested in. You have to convince them that you are the right person to get the job done. The next step is to work out more details and to contact the mentors or the GeomScale org by providing the following information by email or by [gitter](https://gitter.im/GeomScale/community?utm_source=share-link&utm_medium=link&utm_campaign=share-link).\n\n*   Project:\n    \n    *   Select a project in the list and provide your personal and detailed description. If you wish to work on another idea of your own, we are pretty open as long as this serves the goal of consolidating GeomScale as a whole.\n    *   Provide a proposal of a technical solution with your envisioned methodology. The more detailed the better.\n    *   Explain how the solution will be available to the user, in which form. Do not forget the documentation, unitary tests, and cross-platform aspects.\n    *   Provide a realistic schedule with objectives (one every two weeks for example) and deadlines. Focus on mid-term objectives as well as on the final evaluation.\n*   Personal data:\n    \n    *   First name, last name, affiliation, and geographical location.\n    *   A brief list of the main studies and programming courses attended, with ranking.\n    *   List of the most important software projects contributed and success.\n    *   Which are your best skills in terms of programming and scientific computing?\n    *   In general what is your taste in terms of programming? language, methodology, teamwork, etc.\n    *   Is there anything that prevents you from working full time on the project during the program period?\n    *   How do you see your involvement after the program ends? Do you see yourself pushing the project further, or do you see yourself contributing to other GeomScale projects?\n    *   Are you more interested in the theory/scientific aspect of GeomScale, or do you feel more like a hacker?\n"}