{"name":"gprMax","description":"Simulating electromagnetic wave propagation","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/gprmax","ideas_url":"https://github.com/gprMax/GSoC/blob/main/project-ideas-2025.md","logo":"https://summerofcode.withgoogle.com/media/org/gprmax/vm8kavyxz3csja8f-360.png","technologies":["python","cuda","openmp","mpi","opencl"],"topics":["science","engineering","geophysics","electromagnetics","ground penetrating radar"],"projects":[{"project_name":"AI Chatbot for support","summary":"Improve the existing AI chatbot to use open-source LLMs, allowing it to answer queries and automatically generate gprMax models from simple commands.","difficulty":"Medium"},{"project_name":"Apple Metal port","summary":"Develop a port of the FDTD solver engine using Apple Metal to enhance the performance of gprMax simulations on Apple hardware.","difficulty":"Medium"},{"project_name":"AMD ROCm HIP port","summary":"Create a port of the FDTD solver engine to the HIP API, aiming to improve performance for complex simulations on AMD GPUs.","difficulty":"Medium"},{"project_name":"Implementation of a Near to Far Field Transformation (NFFT)","summary":"Implement an NFFT process to output electromagnetic field information at a distance from modeled objects, enabling additional modeling capabilities.","difficulty":"Medium"}],"jina_response":"Title: GSoC/project-ideas-2025.md at main · gprMax/GSoC\n\nURL Source: https://github.com/gprMax/GSoC/blob/main/project-ideas-2025.md\n\nMarkdown Content:\ngprMax is hoping to participate in the [Google Summer of Code](https://summerofcode.withgoogle.com/) 2025 program, following successful GSoCs in 2019, 2021, 2023, and 2024.\n\nBelow is list of some potential project ideas (in no particular order). These ideas have been discussed with all mentors in our team:\n\n*   Dr Craig Warren\n*   Dr Antonis Giannopoulos\n*   Dr Iraklis Giannakis\n*   Miss Georgia Coote\n*   Miss Petroula Karacosta\n*   Mr Luke Macpherson\n*   Mr Zach Wilson\n\nIf a project is successfully selected you will be allocated a primary mentor and supported by the rest of the team. If you are interested in learning more about a particular project idea please contact us using [info@gprmax.com](mailto:info@gprmax.com) or on our [Zulip channel](https://gprmax.zulipchat.com/join/stpagw5qy775k7p2tcjkkk4q/).\n\n1\\. AI Chatbot for support\n--------------------------\n\n[](https://github.com/gprMax/GSoC/blob/main/project-ideas-2025.md#1-ai-chatbot-for-support)\n\nThis project will build upon the work done in the previous GSoC where an AI chatbot was developed capable of answering questions and assisting on building models with gprMax. For more information you can check the following [link](https://github.com/eddieleejw/gprmax_chatbot).\n\nThe developed chatbot is based on ChatGPT from OpenAI, therefore it is not free. The current project will aim at building light chatbots using open-source LLMs such as Lama and Deepsheek, in order to provide a free and computationally cheap chatbot for gprMax.\n\nMoreover, the next generation of gprMax AI chatbots will be capable of building models automatically based on some given instructions. We currently have a [set of gprMax commands](https://huggingface.co/datasets/IraGia/gprMax_Train) that we can use to fine-tune open-source LLMs.\n\nTo summarise, this project will aim at building AI chatbots based on open-source LLMs, and fine-tune them not only to answer questions related to gprMax, but also to automatically build full gprMax models based on simple and intuitive instrustions by the user.\n\n**Expected outcomes:** A functional AI chatbot based on open-source LLMs capable of automatically developing gprMax models using simple written commands.\n\n**Skills required:** Python, machine learning\n\n**Difficulty:** Medium\n\n**Length:** 350hrs\n\n2\\. Apple Metal port\n--------------------\n\n[](https://github.com/gprMax/GSoC/blob/main/project-ideas-2025.md#2-apple-metal-port)\n\nThe aim of the project is to develop an [Apple Metal](https://developer.apple.com/metal/) port. The performance (speed) of the solver is a critical feature as simulations become ever larger and more complex.\n\nThe solver is based on the [Finite-Difference Time-Domain (FDTD)](https://en.wikipedia.org/wiki/Finite-difference_time-domain_method) method, which has shown significant performance benefits when parallelised – particularly on GPU. The project will require building on the already existing initial Apple Metal port and developing and testing it to ensure all main features in gprMax execute correctly and efficiently.\n\n**Expected outcomes:** A working port of the FDTD solver engine for gprMax using Apple Metal.\n\n**Skills required:** Python, C\n\n**Hardware required:** You must have your own access to Apple hardware.\n\n**Difficulty:** Medium\n\n**Length:** 350hrs\n\n3\\. AMD ROCm HIP port\n---------------------\n\n[](https://github.com/gprMax/GSoC/blob/main/project-ideas-2025.md#3-amd-rocm-hip-port)\n\nThe aim of the project is to develop an [HIP](https://github.com/ROCm/HIP) port. The performance (speed) of the solver is a critical feature as simulations become ever larger and more complex.\n\nThe solver is based on the [Finite-Difference Time-Domain (FDTD)](https://en.wikipedia.org/wiki/Finite-difference_time-domain_method) method, which has shown significant performance benefits when parallelised – particularly on GPU. The project will require porting existing code from the PyCUDA-based solver we already have, to the HIP API. There are automated translation tools, such as [HIPIFY](https://github.com/ROCm/HIPIFY) that can be used to support the process.\n\n**Expected outcomes:** An initial working port of the FDTD solver engine for gprMax using HIP.\n\n**Skills required:** Python, C\n\n**Hardware required:** You must have your own access to an AMD GPU.\n\n**Difficulty:** Medium\n\n**Length:** 350hrs\n\n4\\. Implementation of a Near to Far Field Transformation (NFFT) calculation and output of relevant information\n--------------------------------------------------------------------------------------------------------------\n\n[](https://github.com/gprMax/GSoC/blob/main/project-ideas-2025.md#4-implementation-of-a-near-to-far-field-transformation-nfft-calculation-and-output-of-relevant-information)\n\nThe aim of this project is to implement a Near-to-far-field Transformation output process in gprMax based in well known theory and an existing algorithm.\n\nNFFT outputs are needed when information of the electromagnetic field response is needed far away from the object of interest modelled in detail by gprMax using the FDTD numerical mehtod.Initially we need to implement such a process, which is well documented in the literature and algorithmically available, for objects located in a simple homogenous background. This feature will allow us to easily perform an number of additional modelling tasks like radar cross section (RCS) calcualtions and complicated antenna patterns that are not possible at the moment.\n\n**Skills required:** Python\n\n**Difficulty:** Medium\n\n**Length:** 350hrs\n"}