{"name":"GRAME","description":"Domain specific language for audio","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/grame","ideas_url":"https://github.com/grame-cncm/faustideas","logo":"https://summerofcode.withgoogle.com/media/org/grame/joff5sziiuapvits-360.png","technologies":["c","javascript","c++","rust","typescript"],"topics":["audio","compiler","digital signal processing","function programming language"],"projects":[{"project_name":"GitHub - grame-cncm/faustideas","summary":"A central repository for managing and discussing proposals and ideas for Google's Summer of Code projects related to the Faust programming language.","difficulty":"N/A"},{"project_name":"Google Summer of Code possible projects","summary":"This section lists potential projects for the Google Summer of Code, with a framework for what students should accomplish at each stage of their proposal.","difficulty":"N/A"},{"project_name":"Discovering the Faust ecosystem","summary":"Guidelines for students to familiarize themselves with the Faust language, community resources, and prerequisites for applying to GSoC.","difficulty":"N/A"},{"project_name":"Information Candidates Should Supply","summary":"Details on what candidates need to provide in their applications, including personal data, past experiences, and project proposals.","difficulty":"N/A"},{"project_name":"Possible projects","summary":"A detailed list of project ideas, mentorship information, expected project sizes, descriptions, and required skills for participants in the GSoC.","difficulty":"Varies"},{"project_name":"Faust Language Server and Formatting Extension for VS Code","summary":"Development of a language server and code formatter for VS Code to support Faust programming, enhancing usability and code quality.","difficulty":"Medium"},{"project_name":"Extending the Faust DSP Testbench","summary":"Improvement and expansion of a DSP Testbench tool for better visualization and performance analysis of DSP projects using Faust.","difficulty":"Medium"},{"project_name":"Backend for MOJO","summary":"Creating a backend generator for the Mojo programming language to allow efficient integration with Faust DSP projects.","difficulty":"Medium"},{"project_name":"Supporting CLAP format","summary":"Developing tools to compile Faust DSP code into CLAP plugin format, enhancing Faust's usability in contemporary audio environments.","difficulty":"Medium"},{"project_name":"Integration in Wwise","summary":"Integrate Faust DSP capabilities into the Wwise audio engine, focusing on static compilation and real-time editing features.","difficulty":"Hard"},{"project_name":"Integration in BELA","summary":"Furthering the integration of Faust with the BELA platform to allow for dynamic compilation and deployment of DSP programs.","difficulty":"Medium"},{"project_name":"Faust programming by examples","summary":"Exploring an innovative approach to programming with Faust through DAW-style examples rather than traditional code, aiming to simplify learning.","difficulty":"Hard"},{"project_name":"Languages built on top of the signal API","summary":"Developing new programming languages or tools that leverage the Faust signal API for enhanced functionality in DSP applications.","difficulty":"Hard"},{"project_name":"Hot reloadable soundfiles","summary":"Introducing the capability of dynamically replacing soundfiles in Faust applications at runtime, enhancing flexibility in sound processing.","difficulty":"Hard"},{"project_name":"WebGPU audio architecture","summary":"Creating a backend for Faust to utilize WebGPU for audio processing, aiming for high performance on web platforms.","difficulty":"Hard"},{"project_name":"VST plugin embedding the dynamic compiler","summary":"Building a VST plugin that integrates Faust's dynamic compilation features for real-time audio processing and live coding.","difficulty":"Medium"},{"project_name":"Packaging system for Faust libraries","summary":"Creating a system to manage and distribute Faust libraries effectively, inspired by successful package managers in other programming languages.","difficulty":"Hard"},{"project_name":"Developing modular synthesis using widget modulation","summary":"Exploring modular synthesis through the use of widget modulation within Faust, encapsulating common synthesizing components.","difficulty":"Medium"}],"jina_response":"Title: GitHub - grame-cncm/faustideas: A central place for Faust GSoC proposals, todo list and new ideas\n\nURL Source: https://github.com/grame-cncm/faustideas\n\nMarkdown Content:\nGoogle Summer of Code possible projects\n---------------------------------------\n\n[](https://github.com/grame-cncm/faustideas#google-summer-of-code-possible-projects)\n\nThis page contains a list of possible GSoC projects, with a preliminary section explaining the prerequisites to follow before working on a real project.\n\nDiscovering the Faust ecosystem\n-------------------------------\n\n[](https://github.com/grame-cncm/faustideas#discovering-the-faust-ecosystem)\n\nThe application process for GSoC consists of the next steps:\n\n*   become acquainted with the [Faust language and ecosystem](https://faust.grame.fr/). In particular looking at the [Powered By Faust](https://faust.grame.fr/community/powered-by-faust/) page can help understanding the variety of projects that have been developed using Faust. Read also the [technical documentation](https://faustdoc.grame.fr/).\n*   join the [Faust discord server](https://discord.gg/RzuFg6B8zA) and #gsoc channel.\n*   read the [GSoC guide for students](https://developers.google.com/open-source/gsoc/resources/guide). Develop your understanding of the various stages of the program. Read this [blog post](https://sayak.dev/gsoc-faqs/).\n*   check the [GSoC contribution timeline](https://developers.google.com/open-source/gsoc/timeline).\n*   read our [Contributing guidelines](https://github.com/grame-cncm/faust/wiki/Contributing).\n*   get invite to chosen project in Faust github organization.\n*   submit the application/proposal including all requirements at the Google Summer of Code Site.\n\nInformation Candidates Should Supply\n------------------------------------\n\n[](https://github.com/grame-cncm/faustideas#information-candidates-should-supply)\n\nThe application process has several steps. First, verify that you meet the GSoC contributor [eligibility requirements](https://summerofcode.withgoogle.com/get-started), i.e. you are at least 18 years old, eligible to work in your country of residence, etc. As of 2023, GSoC eligibility has been expanded to include \"open source beginners\" in addition to students. The next step is to contact the mentor(s) of the project you are interested in; the best place to do so is in the `#gsoc` channel of the [Faust Discord server](https://discord.gg/vzh7CggBtj), where you can ask questions related to the project you're interested in working on, and submit draft proposals for feedback. Your goal is to convince prospective mentors that you are the right person to get the job done; you can do this by sharing your previous work, demonstrating relevant experience/intuition, asking pertinent questions, etc. Finally, submit a project proposal via your GSoC contributor dashboard. Your submission must include a PDF that should contain the following information:\n\n*   Project:\n    \n    *   A detailed description of the project that you wish to tackle. Either select a topic from the list [below](https://github.com/grame-cncm/faustideas#possible-projects), or, if you wish to work on an idea of your own, **we are pretty open as long as this serves the goal of consolidating Faust and its ecosystem as a whole**.\n    *   A proposal of a technical solution with your envisioned methodology. The more detailed the better.\n    *   A realistic schedule with objectives (one every two weeks for example) and deadlines. Focus on mid-term objectives as well as on the final evaluation.\n*   Personal data:\n    \n    *   First name, last name, affiliation and geographical location.\n    *   A brief list of the main studies and programming courses attended, with ranking.\n    *   List of the most important software projects contributed and success.\n    *   Which are your best skills in terms of programming ?\n    *   In general what is your taste in terms of programming? language, methodology, team work, etc.\n    *   Is there anything that prevents you from working full time on the project during the program period?\n    *   How do you see your involvement after the program ends? Do you see yourself pushing the project further, or do you see yourself contributing to other Faust and its ecosystem projects?\n    *   Are you more interested in the Faust language and its ecosystem, or do you feel more like a hacker?\n    *   What are your long-term wishes in terms of job?\n\nPossible projects:\n------------------\n\n[](https://github.com/grame-cncm/faustideas#possible-projects)\n\n*   [Integrated Faust Language Server and Formatting Extension for VS Code](https://github.com/grame-cncm/faustideas#integrated-faust-language-server-and-formatting-extension-for-vs-code)\n*   [Integration in the Heavy Compiler Collection](https://github.com/grame-cncm/faustideas#integration-in-the-heavy-compiler-collection)\n*   [Extending the Faust DSP Testbench](https://github.com/grame-cncm/faustideas#extending-the-faust-dsp-testbench)\n*   [Backend for MOJO](https://github.com/grame-cncm/faustideas#backend-for-mojo)\n*   [Support for CLAP format](https://github.com/grame-cncm/faustideas#support-for-clap-format)\n*   [Integration in Surge](https://github.com/grame-cncm/faustideas#integration-in-surge)\n*   [Integration in Bespoke](https://github.com/grame-cncm/faustideas#integration-in-bespoke)\n*   [Integration in Audiokinetic Wwise](https://github.com/grame-cncm/faustideas#integration-in-audiokinetic-wwise)\n*   [Integration in BELA](https://github.com/grame-cncm/faustideas#integration-in-bela)\n*   [Integration in openFramework](https://github.com/grame-cncm/faustideas#integration-in-openframework)\n*   [PluginGuiMagic architecture](https://github.com/grame-cncm/faustideas#pluginguimagic-architecture)\n*   [Faust programming by examples](https://github.com/grame-cncm/faustideas#faust-programming-by-examples)\n*   [Languages built on top of the signal API](https://github.com/grame-cncm/faustideas#languages-built-on-top-of-the-signal-api)\n*   [Developing modular synthesis using widget modulation](https://github.com/grame-cncm/faustideas#developing-modular-synthesis-using-widget-modulation)\n\nSome [more ideas](https://github.com/grame-cncm/faustideas#faust-ideas) could possibly be turned as GSoC projects.\n\n* * *\n\n### Integrated Faust Language Server and Formatting Extension for VS Code\n\n[](https://github.com/grame-cncm/faustideas#integrated-faust-language-server-and-formatting-extension-for-vs-code)\n\n**Mentor:** [Stéphane Letz](mailto:letz@grame.fr)\n\n**Expected size of project:** 175 hours\n\n**Description:** A [language server](https://en.wikipedia.org/wiki/Language_Server_Protocol), sometimes called an LSP, is a code analysis tool that allows programming environments to get information about projects. This lets them display information like code completions, inline errors, locations of function definitions, reference official documentation, and more. Many programming languages have their own language server (see [https://langserver.org/](https://langserver.org/) for a list), but Faust does not. If there was a Faust language server, it would make it easier to write Faust code using any IDE that supports LSP. This would make it easier for beginners to get started writing Faust using programming tools they're already familiar with, and it would make it easier for experts to navigate large codebases. The [tree-sitter-faust](https://github.com/khiner/tree-sitter-faust) project could be helpful in doing any parsing required for a language server.\n\nWe propose to create a Visual Studio Code extension that integrates the Faust Language Server with a dedicated Faust code formatter. Leveraging the `vscode-languageclient` package, the extension will launch the Faust Language Server to provide robust features (code completion, diagnostics, navigation) while also offering context-aware formatting tailored to Faust DSP syntax.\n\n*   **Integrate the Faust Language Server:**  \n    Use `vscode-languageclient` to launch and manage the server, ensuring features like auto-completion and error checking are available for `.dsp` files.\n    \n*   **Develop a Faust Code Formatter:**  \n    Implement a formatter that understands Faust’s constructs, providing commands and auto-format-on-save functionality to improve readability and enforce best practices.\n    \n\n**Expected outcomes:**\n\n*   A fully functional VS Code extension that combines the Faust Language Server with a dedicated code formatter.\n*   Enhanced developer productivity through improved code intelligence and formatting.\n*   Comprehensive documentation and user-friendly configuration options, making it easier for the Faust community to adopt best practices.\n\n**Skills required:** Faust programming, TypeScript and Web programming.\n\n**An easy, medium or hard difficulty rating of each project:** medium\n\n* * *\n\n### Extending the Faust DSP Testbench\n\n[](https://github.com/grame-cncm/faustideas#extending-the-faust-dsp-testbench)\n\n**Mentor:** [Stéphane Letz](mailto:letz@grame.fr)\n\n**Expected size of project:** 175 hours\n\n**Description:** The [Faust DSP Testbench](https://github.com/grame-cncm/Faust-DSP-Testbench), a fork of the DSP-Testbench project, is designed to help developers using the JUCE framework to analyse their Faust DSP. This project will focus on extending the Testbench’s functionality to make it a more comprehensive and user-friendly tool for developers and researchers working with Faust.\n\nThe proposed extensions aim to:\n\n*   Extend and improve the visualisation tools.\n*   Enable better visualization of DSP performance and behavior.\n\n**Expected outcomes:**\n\n*   A robust, user-friendly Faust DSP Testbench with automated testing, benchmarking, and visualization capabilities.\n*   Comprehensive documentation and tutorials for using the Testbench effectively.\n\n**Skills required:** Faust programming, DSP theory, C++, knowledge of the [JUCE framework](https://juce.com/).\n\n**An easy, medium or hard difficulty rating of each project:** medium\n\n* * *\n\n### Backend for MOJO\n\n[](https://github.com/grame-cncm/faustideas#backend-for-mojo)\n\n**Mentors:** [Stéphane Letz](mailto:letz@grame.fr) and [Yann Orlarey](mailto:orlarey@gmail.com)\n\n**Expected size of project:** 175 hours\n\n[Mojo](https://www.modular.com/max/mojo) is a new programming language that bridges the gap between research and production by combining the best of Python syntax with systems programming and metaprogramming. Mojo combines the usability of Python with the performance of C, unlocking unparalleled programmability of AI hardware and extensibility of AI models. With Mojo, you can write portable code that’s faster than C and seamlessly inter-op with the Python ecosystem. Having [autodifferentiation](https://en.wikipedia.org/wiki/Automatic_differentiation) inside the language is not yet ready but is regularly discussed on [Mojo Discord](https://docs.modular.com/mojo/community).\n\nThe primary objective of the project is to [develop a backend](https://github.com/grame-cncm/faust/tree/master-dev/compiler/generator/template) for this new language, add architecture files, and measure how the generated code behaves doing various benchmarks.\n\n**Expected outcomes:**\n\n*   a new backend to generate MOJO code\n*   development of MOJO architecture files to create benchmarks and measure the speed of the generated code\n\n**Skills required/preferred:** C++ and basic Python programming, Faust programming\n\n**An easy, medium or hard difficulty rating of each project:** medium\n\n* * *\n\n### Differentiable DSP in Faust \\[Taken in 2024\\]\n\n[](https://github.com/grame-cncm/faustideas#differentiable-dsp-in-faust-taken-in-2024)\n\n**Mentors:** [Thomas Rushton](mailto:thomas.rushton@inria.fr), [David Braun](mailto:db1224@princeton.edu), [Stéphane Letz](mailto:letz@grame.fr), and [Yann Orlarey](mailto:orlarey@gmail.com)\n\n**Expected size of project:** 175 hours\n\nDifferentiable programming is a technique whereby a program can be differentiated with respect to its inputs, permitting the computation of the sensitivity of the program's outputs to changes in its inputs.\n\nPartial derivatives of a program can be found analytically via [automatic differentiation](https://en.wikipedia.org/wiki/Automatic_differentiation) and, coupled with an appropriate loss function, used to perform gradient descent. Differentiable programming has consequently become a key tool in solving machine learning problems.\n\nDifferentiable digital signal processing ([DDSP](https://intro2ddsp.github.io/background/what-is-ddsp.html)) is the specific application of differentiable programming to audio tasks. DDSP has emerged as a key component in machine learning approaches to problems such as source separation, timbre transfer, parameter estimation, etc. DDSP is reliant on a programming language with a supporting framework for automatic differentiation. In Python, this is provided by libraries such as TensorFlow and JAX; other languages, [Swift](https://github.com/apple/swift/blob/main/docs/DifferentiableProgramming.md) for example, may feature native support.\n\nWe would like to explore the possibility of implementing automatic differentiation in Faust; the successful implementation of a Faust library for differentiable programming would permit the application of Faust to DDSP problems. Exploratory [work](https://github.com/hatchjaw/faust-ddsp) on such a library has begun; one aim is to turn this into a comprehensive package of support for differentiable Faust programs.\n\nRelated work, concerned with adding automatic differentiation capabilities to the Faust compiler, was conducted for a [previous edition](https://github.com/grame-cncm/faust/pull/939) of GSoC. Also consult David Braun's [DawDreamer](https://github.com/DBraun/DawDreamer) project, which uses Faust's [JAX](https://jax.readthedocs.io/en/latest/notebooks/quickstart.html) backend.\n\n**Expected outcomes:**\n\n*   creation of an automatic differentiation library describing derivatives for all of Faust's operators, helper functions for generalising the creation of differentiable Faust programs, a variety of time- and frequency-domain loss functions, etc.;\n*   development of a series of practical applications of the new library;\n*   a new autodiff (or machine learning) architecture file, to support the training of machine learning models and the generation of parameter weights;\n*   a means to use the generated weights for real-time inference.\n\n**Skills required/preferred:** Faust programming, machine learning\n\n**An easy, medium or hard difficulty rating of each project:** medium\n\n* * *\n\n### Support for CLAP format\n\n[](https://github.com/grame-cncm/faustideas#support-for-clap-format)\n\n**Mentor:** [Stéphane Letz](mailto:letz@grame.fr)\n\n**Expected size of project:** 175 hours\n\n[CLAP](https://github.com/free-audio/clap#learn-about-clap) is an Audio Plugin format (as pure C api), liberally licensed (MIT), entirely developers in the open (GitHub), with support from commercial developers ([u-he](https://u-he.com/), [Bitwig](https://www.bitwig.com/de/), more). CLAP has many design goals, but a primary one was to allow developers to build their base plugin layer using a properly open clean C standard, to replace the VST2 API which most folks base their plugin model on, and then project into other systems. An extensive discussion can be [accessed here](https://www.kvraudio.com/forum/viewtopic.php?t=574861).\n\nThe project is to develop:\n\n*   a `faust2clap` tool (see [faust2xx Tools](https://faustdoc.grame.fr/manual/tools/) and [Developing a faust2xx Script](https://faustdoc.grame.fr/manual/architectures/#developing-a-faust2xx-script)) to _statically_ compile Faust DSP code in a CLAP plugin.\n*   and a CLAP pluging embedding the [libfaust](https://faustdoc.grame.fr/manual/embedding/) based dynamic compilation chain, so that DSP programs can be _written and recompiled_ on the fly\n*   new [C++ architecture files](https://faustdoc.grame.fr/manual/architectures/) will have to be developed.\n\nLook at additional [CLAP projects](https://github.com/free-audio).\n\n**Expected outcomes:** The result will be a `faust2clap` script to compile a DSP program in a CLAP plugin, and a CLAP pluging embedding libfaust.\n\n**Skills required/preferred:** C++ programming, audio and Faust programming.\n\n**An easy, medium or hard difficulty rating of each project:** medium\n\n* * *\n\n### Integration in Surge\n\n[](https://github.com/grame-cncm/faustideas#integration-in-surge)\n\n**Mentor:** [Stéphane Letz](mailto:letz@grame.fr)\n\n**Expected size of project:** 175 hours\n\nThe Surge Synth Team is a group of musicians, developers, testers, documenters, and general volunteer open source enthusiasts who randomly assembled to work on the [Surge Synthesizer](https://surge-synth-team.org/). Use the [Discord channel](https://discord.gg/aFQDdMV) to connect to their community.\n\nThe project is to develop a `faust2surge` tool (see [faust2xx Tools](https://faustdoc.grame.fr/manual/tools/) and [Developing a faust2xx Script](https://faustdoc.grame.fr/manual/architectures/#developing-a-faust2xx-script)) to _statically_ compile Faust DSP code in a Surge plugin. This is currently [discussed here](https://github.com/surge-synthesizer/surge/issues/3669#issuecomment-967062337). You'll probably have to develop or adapt [C++ architecture files](https://faustdoc.grame.fr/manual/architectures/).\n\n**Expected outcomes:** The result will be a `faust2surge` script to compile a DSP program in a Surge plugin.\n\n**Skills required/preferred:** C++ programming, audio and Faust programming, knowledge of the [JUCE framework](https://juce.com/).\n\n**An easy, medium or hard difficulty rating of each project:** medium\n\n* * *\n\n### Integration in Bespoke\n\n[](https://github.com/grame-cncm/faustideas#integration-in-bespoke)\n\n**Mentor:** [Stéphane Letz](mailto:letz@grame.fr)\n\n**Expected size of project:** 175 hours\n\n**More detailed description of the project:** [Bespoke](https://www.bespokesynth.com/) is a modular DAW for Mac, Windows, and Linux. It contains a bunch of modules, which you can connect together to create sounds. Use the [Discord channel](https://discord.gg/YdTMkvvpZZ) to connect to their community. The integration could follow the two steps:\n\n*   develop a `faust2bespoke` tool (see [faust2xx Tools](https://faustdoc.grame.fr/manual/tools/) and [Developing a faust2xx Script](https://faustdoc.grame.fr/manual/architectures/#developing-a-faust2xx-script)) to _statically_ compile Faust DSP code in Bespoke modules\n    \n*   a complementary approach is to directly embed the Faust compiler ([using libfaust + LLVM JIT](https://faustdoc.grame.fr/manual/embedding/)), allowing DSP programs to be edited, dynamically compiled, and run in the platform\n    \n\nThis is currently [discussed here](https://github.com/BespokeSynth/BespokeSynth/issues/317). You'll probably have to develop or adapt [C++ architecture files](https://faustdoc.grame.fr/manual/architectures/). A recent [Faust integration in TouchDesigner](https://github.com/DBraun/TD-Faust/) can be studied as an example.\n\n**Expected outcomes:** The result will be:\n\n*   a`faust2bespoke` tool to compile Faust DSP code in Bespoke modules\n    \n*   a Bespoke plugin embedding the libfaust + LLVM library, and allowing DSP programs to be edited, dynamically compiled, and run in the platform\n    \n\n**Skills required/preferred:** C++ programming, graphical programming, audio and Faust programming.\n\n**An easy, medium or hard difficulty rating of each project:** medium to hard\n\nReferences:\n\n*   [Bespoke Anywhere](https://nime.pubpub.org/pub/8jaqbl7m/release/1?readingCollection=bd12ca41)\n\n* * *\n\n### Integration in Godot \\[Taken as an internship in 2025\\]\n\n[](https://github.com/grame-cncm/faustideas#integration-in-godot-taken-as-an-internship-in-2025)\n\n**Mentor:** [Stéphane Letz](mailto:letz@grame.fr)\n\n**Expected size of project:** 175 hours\n\n**More detailed description of the project:** [Godot Engine](https://godotengine.org/) is a feature-packed, cross-platform game engine to create 2D and 3D games from a unified interface. It provides a comprehensive set of common tools, so that users can focus on making games without having to reinvent the wheel. The integration could follow the two steps:\n\n*   develop a `faust2godot` tool (see [faust2xx Tools](https://faustdoc.grame.fr/manual/tools/) and [Developing a faust2xx Script](https://faustdoc.grame.fr/manual/architectures/#developing-a-faust2xx-script)) to _statically_ compile Faust DSP code in Godot modules\n    \n*   a complementatry approach is to directly embed the Faust compiler ([using libfaust + LLVM JIT](https://faustdoc.grame.fr/manual/embedding/)), allowing DSP programs to be edited, dynamically compiled, and run in the platform\n    \n\nYou'll probably have to develop or adapt [C++ architecture files](https://faustdoc.grame.fr/manual/architectures/). A recent [Faust integration in TouchDesigner](https://github.com/DBraun/TD-Faust/) can be studied as an example.\n\n**Expected outcomes:** The result will be:\n\n*   a`faust2godot` tool to compile Faust DSP code in Godot modules\n    \n*   a Godot plugin embedding the libfaust + LLVM library, and allowing DSP programs to be edited, dynamically compiled, and run in the platform\n    \n\n**Skills required/preferred:** C++ programming, audio and Faust programming.\n\n**An easy, medium or hard difficulty rating of each project:** medium to hard\n\n* * *\n\n### Integration in Cables.gl \\[Taken in 2024\\]\n\n[](https://github.com/grame-cncm/faustideas#integration-in-cablesgl-taken-in-2024)\n\n**Mentor:** [Stéphane Letz](mailto:letz@grame.fr)\n\n**Expected size of project:** 175 hours\n\n**More detailed description of the project:** [Cables.gl](https://cables.gl/) is a tool for creating beautiful interactive content. With an easy to navigate interface and real time visuals, it allows for rapid prototyping and fast adjustments. You are provided with a set of operators, such as mathematical functions, shapes, materials and post processing effects. Connect these to each other with virtual cables to create the experience you have in mind. Easily export your piece of work at any time. Embed it into your website or use it for any kind of creative installation. Use the [Discord channel](https://discord.com/invite/AGTarWv) to connect to their community.\n\nThe project would be to integrate the [Faust Web Audio Library](https://github.com/grame-cncm/faust2webaudio) to dynamically compile and run Faust DSP programs in Cables.gl.\n\n**Expected outcomes:** The result will be a Cable.gl plugin embedding the libfaust WASM library, and allowing DSP programs to be edited, dynamically compiled, and controlled with an adapted Graphical User Interface.\n\n**Skills required/preferred:** TypeScript/JavaScript programming, Web technologies, audio and Faust programming.\n\n**An easy, medium or hard difficulty rating of each project:** medium\n\n* * *\n\n### PluginGuiMagic architecture\n\n[](https://github.com/grame-cncm/faustideas#pluginguimagic-architecture)\n\n**Mentor:** [Stéphane Letz](mailto:letz@grame.fr) and [Daniel Walz](https://github.com/grame-cncm/faustideas/blob/master/daniel@foleysfinest.com)\n\n**Expected size of project:** 175 hours\n\n**More detailed description of the project:** [PluginGuiMagic](https://foleysfinest.com/developer/pluginguimagic/) is a WYSWYG runtime design system for [JUCE](https://juce.com/) plugins. The foleys\\_plugin\\_magic module allows to have a generated UI, that can be edited at runtime using advanced layout and styling options. It also adds visualisers to display signals, levels and spectral with no extra coding involved. The project is to develop new C++ [architecture files](https://faustdoc.grame.fr/manual/architectures/) to ease the use of PGM in the [faust2juce](https://github.com/grame-cncm/faust/tree/master-dev/architecture/juce) tool. Another [faust\\_juce\\_pgm\\_skeleton](https://github.com/unicornsasfuel/faust_juce_pgm_skeleton) project to look at.\n\n**Expected outcomes:** The result will be set of C++ architecture files and an improved `faust2juce` tool.\n\n**Skills required/preferred:** C++ programming, knowledge of the JUCE framework, knowledge of the foleys\\_plugin\\_magic module, audio and Faust programming.\n\n**An easy, medium or hard difficulty rating of each project:** medium\n\n* * *\n\n### VST plugin embedding the dynamic compiler \\[Taken in 2024\\]\n\n[](https://github.com/grame-cncm/faustideas#vst-plugin-embedding-the-dynamic-compiler-taken-in-2024)\n\n**Mentor:** [Stéphane Letz](mailto:letz@grame.fr)\n\n**Expected size of project:** 175 hours\n\n**More detailed description of the project:** A VST plugin using the [libfaust + LLVM JIT](https://faustdoc.grame.fr/manual/embedding/) to do DSP live coding in any VST aware host. FX and monophonic or polyphonic synthesizers can be written. The source code can be edited and recompiled on the fly. The GUI has to be automatically created. The [pMix](https://github.com/olilarkin/pMix2) and [Amati](https://github.com/glocq/Amati) projects can be used as starting points. An integration with the [PluginGuiMagic](https://foleysfinest.com/developer/pluginguimagic/) architecture could possibly be added.\n\n**Expected outcomes:** The result will be a VST plugin developed with the [JUCE framework](https://juce.com/) .\n\n**Skills required/preferred:** C++ programming, audio and Faust programming, knowledge of the JUCE framework.\n\n**An easy, medium or hard difficulty rating of each project:** medium\n\n* * *\n\n### Integration in Audiokinetic Wwise\n\n[](https://github.com/grame-cncm/faustideas#integration-in-audiokinetic-wwise)\n\n**Mentor:** [Stéphane Letz](mailto:letz@grame.fr)\n\n**Expected size of project:** 350 hours\n\n**More detailed description of the project:** [Audiokinetic](https://www.audiokinetic.com/en/) is the leading global provider of the most advanced and scalable cross platform interactive audio solutions. A trusted technology partner to the world’s largest developers, OEMs, and audio production companies, its flagship product Wwise is the gold standard interactive audio engine on the market. [Wwise](https://www.audiokinetic.com/en/products/wwise) features a complete suite of design and development tools, making it easy to prototype and bring to life your creative vision for audio, no matter the scale of your project. The integration could follow the two steps:\n\n*   develop a `faust2wwise` tool (see [faust2xx Tools](https://faustdoc.grame.fr/manual/tools/) and [Developing a faust2xx Script](https://faustdoc.grame.fr/manual/architectures/#developing-a-faust2xx-script)) to _statically_ compile Faust DSP code in Wwise modules\n    \n*   a complementatry approach is to directly embed the Faust compiler ([using libfaust + LLVM JIT](https://faustdoc.grame.fr/manual/embedding/)), allowing DSP programs to be edited, dynamically compiled, and run in the platform\n    \n\nLook at the [faust2wwise](https://github.com/grame-cncm/faust2wwise) preliminary work. You'll probably have to develop or adapt [C++ architecture files](https://faustdoc.grame.fr/manual/architectures/).\n\n**Expected outcomes:** The result will be:\n\n*   a new `faust2wwise` tool with the associated C++ architecture files to compile a DSP project in a ready to use Wwise plugin\n    \n*   a plugin embedding the libfaust + LLVM JIT dynamic compiler technology to allow Faust DSP live-coding\n    \n\n**Skills required/preferred:** C++ programming, audio and Faust programming, knowledge of the Audiokinetic Wwise architecture.\n\n**An easy, medium or hard difficulty rating of each project:** hard\n\n* * *\n\n### Integration in BELA\n\n[](https://github.com/grame-cncm/faustideas#integration-in-bela)\n\n**Mentor:** [Stéphane Letz](mailto:letz@grame.fr)\n\n**Expected size of project:** 175 hours\n\n**More detailed description of the project:** [BELA](https://bela.io/) is a maker platform for creating beautiful interaction. Designed for artists, musicians, researchers and makers, Bela brings the power of ultra-low latency interactive audio and sensors to your digital projects. A Faust/BELA integration has already been done in a `faust2bela` tool and some preliminary work on the [dynamic compilation chain](https://faustdoc.grame.fr/manual/embedding/) have [been done](https://github.com/giuliomoro/bela-faust-jit).\n\n**Expected outcomes:** The result will be:\n\n*   an improved `faust2bela` tool\n    \n*   a fully integrated Faust/BELA IDE that would allow to design and experiment Faust code in the Web plaform (using the dynamic WebAssembly based compilation chain), then compile it in C++ and deploy it on the BELA board. Monophonic DSP and MIDI controllable polyphonic instruments should be supported.\n    \n*   a finished dynamic compilation chain integration.\n    \n\n* * *\n\n### Integration in openFramework\n\n[](https://github.com/grame-cncm/faustideas#integration-in-openframework)\n\n**Mentor:** [Stéphane Letz](mailto:letz@grame.fr)\n\n**Expected size of project:** 175 hours\n\n**More detailed description of the project:** [openFrameworks](https://openframeworks.cc/about/) is an open source C++ toolkit designed to assist the creative process by providing a simple and intuitive framework for experimentation. It allows to access a lot of additional extensions and libraries in the form of [addons](https://ofxaddons.com/). The project is to explore how Faust can be integated in the framework as an [ofxFaust](https://forum.openframeworks.cc/t/developing-a-faust-addon) addon, either statically (using the C++ generated code from a DSP program), or possibly embedding the [libfaust](https://faustdoc.grame.fr/manual/embedding/) compiler. Adapted architecture files will have to be developed.\n\n**Expected outcomes:** The result will be a new **ofxFaust** and openFrameworks demo examples explaining how to use it.\n\n* * *\n\n### Integration in the Heavy Compiler Collection\n\n[](https://github.com/grame-cncm/faustideas#integration-in-the-heavy-compiler-collection)\n\n**Mentor:** [Alexander Chalikiopoulos](mailto:alexander@puikheid.nl)\n\n**Expected size of project:** 175 hours\n\n**More detailed description of the project:** [HVCC](https://github.com/Wasted-Audio/hvcc/) is a python-based dataflow audio programming language compiler that generates C/C++ code and a variety of specific framework wrappers. It's main focus is in parsing [Pure Data](https://puredata.info/) DSP patch files, statically interprets them, and converts them to C/C++. The project is to explore how Faust can be integrated into the compiler toolchain. Likely starting from [pd-faustgen](https://github.com/CICM/pd-faustgen) external and then internally calling [faustdoctor](https://github.com/SpotlightKid/faustdoctor) to wrap the resulting C into separate header and implementation files. A crude proof of concept integration between faust generated code and a heavy DSP graph was done to explore the feasibility of this integration.\n\n**Expected outcomes:** The result will be:\n\n*   extending hvcc compiler steps `pd2hv`, `hv2ir` and `ir2c`\n*   jinja2 templates that create Heavy compatible C header and implementation files, based on Faust code\n*   successfully create DSP prototypes using PD and Faust that can be compiled to C/C++ projects based on Heavy\n\n**Skills required/preferred:** Python, C, Pure Data, audio and Faust programming.\n\n**An easy, medium or hard difficulty rating of each project:** medium\n\n* * *\n\n### Packaging system for Faust libraries \\[Taken in 2024\\]\n\n[](https://github.com/grame-cncm/faustideas#packaging-system-for-faust-libraries-taken-in-2024)\n\n**Mentors:** [Yann Orlarey](mailto:orlarey@gmail.fr) and [Stéphane Letz](mailto:letz@grame.fr)\n\n**Expected size of project:** 350 hours\n\n**More detailed description of the project:** The idea is to develop a packaging system to facilitate the integration of Faust libraries in a DSP project. The inspiration comes from the [Julia](https://www.julialang.org/) language with the [JuliaHub](https://juliahub.com/) project and/or the [Rust](https://www.rust-lang.org/) language with the [Cargo](https://doc.rust-lang.org/cargo/) package manager.\n\n#### Requirements\n\n[](https://github.com/grame-cncm/faustideas#requirements)\n\n*   load packages containing Faust sources, either in .dsp or in .lib format\n*   be able to load sets of files (typically a library that is written as several .lib files)\n*   isolate packages in different environments, to avoid name conflicts\n*   notion of a centralized directory on GitHub, where contributions can be made in the form of Pull Requests. Publishing tool (with search by content) of this directory, general, like **fausthub** (inspired for example by Juliahub [https://juliahub.com/lp/](https://juliahub.com/lp/)).\n*   at each PR, test of the syntax of the code with GitHub actions\n*   cache management: typically 1) the package is loaded the 1st time and kept in a cache, 2) then the compiler uses the version in the cache. Work on the question of new version management.\n*   automatic generation of the documentation from the lib files (starting from the existing tools and possibly adapting them), automatic deployment\n*   preservation semantic: we want to be able to keep a project as a DSP file with all its needed libraries with specific version numbers\n\n#### Syntax proposal\n\n[](https://github.com/grame-cncm/faustideas#syntax-proposal)\n\n##### Simple version\n\n[](https://github.com/grame-cncm/faustideas#simple-version)\n\n`package(\"foo\")` ⇒ syntactic sugar for `library(\"https://faustpackages.grame.fr, \"path/to/actual/library.lib\")`\n\n##### Version with constraint on version number\n\n[](https://github.com/grame-cncm/faustideas#version-with-constraint-on-version-number)\n\n`package(\"foo\", \"3.4\")` ⇒ syntactic sugar for `library(\"https://faustpackages.grame.fr, \"path/to/actual/3.4/library.lib\")`\n\n`package(\"foo\").bar`\n\nor else:\n\n`foo = package(\"foo\")` and `foo.bar` in the DSP code\n\n#### Tools to describe packages\n\n[](https://github.com/grame-cncm/faustideas#tools-to-describe-packages)\n\n*   look at the package format of Rust or Julia: .toml file, src folders, tests\n    \n*   look at the TOML format ([https://toml.io/en/](https://toml.io/en/)), used by Rust and Julia\n    \n\n**Expected outcomes:**\n\n*   a working insfrastructure with a server hosting the published packages\n    \n*   an extended Faust compiler able to access the server\n    \n\n**Skills required/preferred:** C++ programming, server/client technology.\n\n**An easy, medium or hard difficulty rating of each project:** hard\n\n* * *\n\n### Faust programming by examples\n\n[](https://github.com/grame-cncm/faustideas#faust-programming-by-examples)\n\n**Mentors:** [Yann Orlarey](mailto:orlarey@gmail.fr) and [Stéphane Letz](mailto:letz@grame.fr)\n\n**Expected size of project:** 350 hours\n\n**More detailed description of the project:** The objective is to develop a new approach to Faust programming, not textual or graphical, but based on DAW-like examples. This programming principle is analogue to the one described in the article [Real time Composition in Elody](https://hal.archives-ouvertes.fr/hal-02158910/document). This approach is based on the idea of manipulating and editing virtual \"audio files\" which represent the real time audio inputs and outputs.\n\nTo take a simple monophonic example, let's call these two virtual audio files `INPUT` and `OUTPUT`. Let's note `t:file` the fact of placing in the DAW a file `file`at time `t` in seconds and `t:file*0.75` the fact of placing in the DAW a file at time `t` but also controlling its sound level. So the DAW construction `{0:INPUT, 1:OUTPUT*0.75}` corresponds to a realtime echo whose Faust translation is `process = + ~ (@(ma.SR):*(0.75));`.\n\n**Expected outcomes:** The project consists in exploring this model and see how standard DAW editing actions can be translated in Faust DSP programs. A prototype coded in TypeScript, JavaScript or any other scripting languages will be developed.\n\n**Skills required/preferred:** C++ programming, possibly TypeScript + JavaScript or other scripting languages.\n\n**An easy, medium or hard difficulty rating of each project:** hard\n\n* * *\n\n### Languages built on top of the signal API\n\n[](https://github.com/grame-cncm/faustideas#languages-built-on-top-of-the-signal-api)\n\n**Mentors:** [Yann Orlarey](mailto:orlarey@gmail.fr) and [Stéphane Letz](mailto:letz@grame.fr)\n\n**Expected size of project:** 350 hours\n\n**More detailed description of the project:** The [signal API](https://faustdoc.grame.fr/tutorials/signal-api/) opens an intermediate access inside the Faust compilation chain. Generating complex expressions by directly using it can quickly become really tricky and unpracticable. So a language created on top of the signal API is usually needed. This is exactly what the Block Diagram Algebra is all about, and the entire Faust language itself.\n\nBut some other approaches can possibly be tested. The [Elementary audio language](https://www.elementary.audio/) for instance is built over a [similar signal](https://docs.elementary.audio/guides/making_sound) language and uses JavaScript as the upper layer language to help create complex signal graphs programmatically.\n\n**Expected outcomes:** The project consits in exploring various approaches to build a language on top of the signal API. It could be a textual one (like JavaScript, Haskell or scripting languages...) or a purely graphical tool.\n\n**Skills required/preferred:** C++ programming, possibly TypeScript + JavaScript, Haskell or other functional languages.\n\n**An easy, medium or hard difficulty rating of each project:** hard\n\n* * *\n\n### Developing modular synthesis using widget modulation\n\n[](https://github.com/grame-cncm/faustideas#developing-modular-synthesis-using-widget-modulation)\n\n**Mentors:** [Yann Orlarey](mailto:orlarey@gmail.fr) and [Stéphane Letz](mailto:letz@grame.fr)\n\n[Widget modulation](https://faustdoc.grame.fr/manual/syntax/#widget-modulation) acts on the widgets of an existing Faust expression, but without requiring any manual modifications of the expression's code. This operation is done directly by the compiler, according to a list of target widgets and associated modulators. Target widgets are specified by their label, as used in the graphical user interface. Modulators are Faust expressions that describe how to transform the signal produced by widgets.\n\nThe project would be to develop a set of [modular synthesizers](https://en.wikipedia.org/wiki/Modular_synthesizer), typically by choosing and adapting existing functions in the [Faust Libraries](https://faustlibraries.grame.fr/), each of them with a pretty GUI, to be combined in a patch like model. The widget modulation syntax will be used to prepare the widgets to be modulable. The implementation will be done using web technologies, and in particular [FaustWasm](https://github.com/grame-cncm/faustwasm), a high-level API that wraps around Faust compiler. Here is a list of possible steps:\n\n*   choose and adapt existing functions in the Faust Libraries and add a pretty GUI with [User Interface Primitives](https://faustdoc.grame.fr/manual/syntax/#user-interface-primitives-and-configuration) to create modules including oscillators (which generate sound), filters (which modify sound by frequency), amplifiers (which control the volume), and modulators (like LFOs and envelopes, which affect other parameters over time)\n    \n*   create sequencing modules, vital for composition in modular synthesis. It allows users to create a series of notes (a sequence) that can be sent to an oscillator to produce rhythmic patterns or melodies\n    \n*   define a library of modulation circuits, using the [lowest/highest](https://github.com/grame-cncm/faustideas#TODO) primitives of the language, and define adapted signal mappings\n    \n*   create a global GUI to rack all used modules as in [VCV Rack](https://vcvrack.com/), using Web technologies, and develop the connection logic needed between all considered modules, compiled and connected as separated Faust [Web Audio](https://developer.mozilla.org/en-US/docs/Web/API/Web_Audio_API) nodes\n    \n\n**Expected size of project:** 350 hours\n\n**Expected outcomes:** The project aims in developing new libraries for modular synthesis and a prototype Web application.\n\n**Skills required/preferred:** Faust programming, Web programming\n\n**An easy, medium or hard difficulty rating of each project:** medium\n\n* * *\n\nPast GSoC editions\n------------------\n\n[](https://github.com/grame-cncm/faustideas#past-gsoc-editions)\n\n### 2024: FaustNet - DDSP, Faust in Cables.gl, Amati++, a VST/CLAP Plugin embedding the dynamic compiler and Faust Package Manager\n\n[](https://github.com/grame-cncm/faustideas#2024-faustnet---ddsp-faust-in-cablesgl-amati-a-vstclap-plugin-embedding-the-dynamic-compiler-and-faust-package-manager)\n\n*   **FaustNet - DDSP** aimed to continue the work done on adding automatic differentiation in Faust (started in a GSOC 2023 project), to leverage machine learning for audio processing tasks directly within the familiar Faust environment. It was worked on by [Advik Raj Basani](https://github.com/FloofCat) and contributed as a [Pull Request](https://github.com/hatchjaw/faust-ddsp/pull/1) on Thomas Rushton [faust-ddsp](https://github.com/hatchjaw/faust-ddsp) library.\n    \n*   **Faust in Cables.gl** aimed to develop a Cables.gl plugin that compiles Faust DSP code into a WASM AudioWorklet in real-time. It was worked on by [Fay Carsons](https://github.com/FayCarsons) and contributed as a separated [Faust Cables plugin](https://github.com/FayCarsons/Cables-Faust-Plugin) project.\n    \n*   **Amati++, a VST/CLAP Plugin embedding the dynamic compiler**, inspired by the pMix and Amati projects, this plugin has been built using the JUCE framework for the interface and libfaust with LLVM and interpreter backend API to compile Faust code. It was worked on by [Tyler Li](https://github.com/Orisu179) and is still a [work-in-progress](https://github.com/Orisu179/AmatiPP).\n    \n*   **Faust Package Manager** aimed to add a packaging system to facilitate the integration of Faust libraries in a DSP project. It was worked on by [Shehab Khaled Roshdy](https://github.com/shehab299) and a was contributed as a [Pull Request](https://github.com/grame-cncm/faust/pull/1049) that is still in test in a [master-dev-pacman](https://github.com/grame-cncm/faust/tree/master-dev-pacman) branch.\n    \n\n### 2023: Automatic Differentiation in the Faust Compiler and Better Faust on the Web\n\n[](https://github.com/grame-cncm/faustideas#2023-automatic-differentiation-in-the-faust-compiler-and-better-faust-on-the-web)\n\n*   **Automatic Differentiation in the Faust Compiler** aimed at adding Automatic differentiation directly in the compiler, so that gradient calculation can be carried out natively in Faust, with applications in Machine Learning algorithms. The project was worked by [Thomas Rushton](https://github.com/hatchjaw) and completed with this [Pull Request](https://github.com/grame-cncm/faust/pull/939), and finally integrated in the Faust [master-branch](https://github.com/grame-cncm/faust/commit/681a303b8ddc9ef2e67c2cc5d5df83f27323b865).\n    \n*   **Better Faust on the Web** aimed at enhancing Faust’s support for the web platform, and was worked on by [Ian Clester](https://ijc8.me/). Transitioning the Faust web tools to a rewritten TypeScript version has been completed and deployed in updated versions of the [Faust editor](https://fausteditor.grame.fr/) and [Faust playground](https://faustplayground.grame.fr/) and soon in the [Faust Web IDE](https://faustide.grame.fr/) with this [Pull Request](https://github.com/grame-cncm/faustide/pull/72). A Faust web component embedding the libfaust JS/WebAssembly compiler has been [developed](https://github.com/ijc8/faust-web-component) and will be used soon in the [Faust documentation](https://faustdoc.grame.fr/). The development is fully detailed in this [blog post](https://ijc8.me/2023/08/27/gsoc-faust/).\n    \n\n### 2022: Integration in HISE\n\n[](https://github.com/grame-cncm/faustideas#2022-integration-in-hise)\n\nFaust Integration in HISE aimed at integrating support for the Faust audio programming language into HISE, an extensive framework for the creation of sample-based virtual musical instruments. The project has been [completed](https://resonant-bytes.de/blog/gsoc-final-submission/) by [Roman Sommer](https://resonant-bytes.de/about/) with the help of [Christoph Hart](https://github.com/christophhart) as mentor, and announced [here](https://forum.hise.audio/topic/6505/faust-is-here).\n\nFaust ideas\n-----------\n\n[](https://github.com/grame-cncm/faustideas#faust-ideas)\n\nThis repository hosts the \"TODO/ideas list\" for the [Faust programming language](http://faust.grame.fr/).\n\nConventions\n-----------\n\n[](https://github.com/grame-cncm/faustideas#conventions)\n\n*   Items are placed at the bottom of the file and separated by `---`.\n*   Items can have a person associated to them by declaring `* Currently  addressed by: xxx`. If no-one is currently working on the item, replace `xxx` by `nil`.\n*   Items are ordered by priority and are also listed in the [List](https://github.com/grame-cncm/faustideas#list) section below.\n*   Items can be commented by adding subsections, pictures, etc.\n\nList\n----\n\n[](https://github.com/grame-cncm/faustideas#list)\n\n*   [Implement Jonathan Abel's Modal Reverb](https://github.com/grame-cncm/faustideas#implement*jonathan-abels*modal-reverb)\n*   [Improved UI Declarations](https://github.com/grame-cncm/faustideas#improved-ui-declarations)\n*   [Improved Linear Algebra Support](https://github.com/grame-cncm/faustideas#improved-linear-algebra-support)\n*   [Finish the DX7 Implementation](https://github.com/grame-cncm/faustideas#finish-the-dx7-implementation)\n*   [Trigonometric simplifications](https://github.com/grame-cncm/faustideas#trigonometric-simplifications)\n*   [WebAssembly specific optimisations](https://github.com/grame-cncm/faustideas#webassembly-specific-optimisations)\n*   [Improve faust2audiokit](https://github.com/grame-cncm/faustideas#improve-faust2audiokit)\n*   [Improve faust2vcvrack](https://github.com/grame-cncm/faustideas#improve-faust2vcvrack)\n*   [Testing tools on the Web](https://github.com/grame-cncm/faustideas#testing-tools-on-the-web)\n*   [Progressive Web applications for iOS and Android](https://github.com/grame-cncm/faustideas#progressive-web-applications-for-ios-and-android)\n*   [A tool to generate Faust web components as NPM packages](https://github.com/grame-cncm/faustideas#a-tool-to-generate-faust-web-components-as-npm-packages)\n*   [PFFT like wrapper for Faust DSP code](https://github.com/grame-cncm/faustideas#pfft-like-wrapper-for-faust-dsp-code)\n*   [Hot reloadable soundfiles](https://github.com/grame-cncm/faustideas#hot-reloadable-soundfiles)\n*   [WebGPU audio architecture](https://github.com/grame-cncm/faustideas#webgpu-audio-architecture)\n*   [Invertible functions](https://github.com/grame-cncm/faustideas#invertible-functions)\n*   [faust2nih tool](https://github.com/grame-cncm/faustideas#faust2nihplug-tool)\n\nImplement Jonathan Abel's Modal Reverb\n--------------------------------------\n\n[](https://github.com/grame-cncm/faustideas#implement-jonathan-abels-modal-reverb)\n\n*   Currently addressed by: Romain and Yann\n\nThis should be done as part of the Longyou grottoes project. The \"final goal\" would be to create an interactive website where users can process the sound of their microphone to apply the acoustics of this ancient space. Modal reverb would allow to interpolate between IRs and change some of the parameters of the space in real-time. It'd be nice if this could be reproducible so we need to think about a way to nicely generate these reverbs from an impulse response. This tool could be similar to `mesh2faust` or could come as part of a toolkit in matlab/octave/pyhton, etc.\n\nImproved UI Declarations\n------------------------\n\n[](https://github.com/grame-cncm/faustideas#improved-ui-declarations)\n\n*   Currently addressed by: Romain and Yann\n\nEssentially allow for specific UI elements to have metadatas associated to them outside of their declaration. As part of that, we want to implement a system to further customize UI elements.\n\n### Potential Implementation\n\n[](https://github.com/grame-cncm/faustideas#potential-implementation)\n\nSeveral approaches are being considered to further customize UI elements. The first one would consist of being able to declare a \"CSS\" allowing for the use of CSS code. Another approach (more generic and not limited to the web) would allow for the declaration of UI-specific metadata inspired by CSS.\n\n```\ndeclare UI \"\n  synth{\n    background-color: blue;\n  }\n  synth/freq{\n    tooltip: Frequency parameter of the synth;\n    width: 70%;\n  }\n  synth/gain{\n    style: knob;\n    tooltip: Gain parameter of the synth;\n    width: 70%;\n  }\n\";\n\nf = hslider(\"freq\",400,50,1000,0.1);\ng = hslider(\"gain\",0.5,0,1,0.01);\nprocess = hgroup(\"synth\",os.sawtooth(f)*g);\n\n```\n\nOf course, it would still be possible to declare metadatas within the UI declaration (this system would be fully backward compatible). Internally, we'd have to parse the metadata and create a corpus of supported CSS metadatas knowing that interfaces would be based on a specific kind of layout (e.g., grid layout). Once again, another option would be to allow to specify \"pure CSS\" giving access to all the CSS features without having to do some reformatting.\n\n* * *\n\nImproved Linear Algebra Support\n-------------------------------\n\n[](https://github.com/grame-cncm/faustideas#improved-linear-algebra-support)\n\n*   Currently addressed by: nil\n\nLinear algebra operations are currently poorly supported in Faust. Having a way to conveniently express matrices would improvement. As part of that, linear algebra/matrix operations (e.g., inversion, multiplication, determinant, etc.) primitives could be added to the language.\n\n### Potential Implementation\n\n[](https://github.com/grame-cncm/faustideas#potential-implementation-1)\n\nMatrices could be expressed using the Faust-multirate `vectorize` primitives by creating vectors of vectors.\n\nIt would be interesting to try to implement matrix operations from scratch in Faust. Although it might be hard and not so optimized, thus a more pragmatic solution would be to implement them as primitives. That would be a fair amount of work as this would imply that the corresponding code for each language supported by Faust would have to be supported.\n\n* * *\n\nFinish the DX7 Implementation\n-----------------------------\n\n[](https://github.com/grame-cncm/faustideas#finish-the-dx7-implementation)\n\n*   Currently addressed by: nil\n\nEssentially, finish `dx7.lib`. It might be worth looking at these elements to make this happen:\n\n*   [https://webaudiomodules.org/demos/wasm/dx7.html](https://webaudiomodules.org/demos/wasm/dx7.html)\n*   [https://github.com/everythingwillbetakenaway/DX7-Supercollider](https://github.com/everythingwillbetakenaway/DX7-Supercollider)\n\n* * *\n\nTrigonometric simplifications\n-----------------------------\n\n[](https://github.com/grame-cncm/faustideas#trigonometric-simplifications)\n\n*   Currently addressed by: nil (suggested by [Pierre Lecomte](https://github.com/grame-cncm/faust/issues/59))\n\nFor some applications, trigonometric functions (spherical harmonics) are used, and depending on the algorithm, the output formula could be very complicated. However, in a lot of cases, trigonometric identities could help to drastically simplify the expressions.\n\n* * *\n\nWebAssembly specific optimisations\n----------------------------------\n\n[](https://github.com/grame-cncm/faustideas#webassembly-specific-optimisations)\n\n*   Currently addressed by: Stéphane and Yann\n\nTo run as fast as possible and approch native code performances as much as possible, WebAssembly code requires some specific optimisations, like: memory access (index precomputation as much as possible...), delay lines handling, struct/stack variables access...etc. We have started an informal collaboration with Mozilla engineers (Benjamin Bouvier) to work on this subject.\n\n* * *\n\nImprove faust2audiokit\n----------------------\n\n[](https://github.com/grame-cncm/faustideas#improve-faust2audiokit)\n\n*   Currently addressed by: nil\n\nThe [faust2audiokit](https://github.com/grame-cncm/faust/tree/master-dev/architecture/audiokit) tool transforms a Faust DSP program into a fully working AudioKit node. The result can be a monophonic DSP or a MIDI controllable polyphonic one (when the DSP describes an instrument, following the freq, gain, gate parameter naming convention).\n\nThe project consists in improving and finishing the tool.\n\n* * *\n\nImprove faust2vcvrack\n---------------------\n\n[](https://github.com/grame-cncm/faustideas#improve-faust2vcvrack)\n\n*   Currently addressed by: nil\n\nThe [faust2vcvrack](https://github.com/grame-cncm/faust/tree/master-dev/architecture/vcvrack) The faust2vcvrack tool compiles a Faust DSP program in a folder containing the VCV Rack plugin C++ source code and a Makefile to compile it. By default the resulting C++ code is compiled and installed in the VCV Rack application:\n\nThe project consists in improving the tool, particulary the automatically created graphical user interface which is ugly for now.\n\n* * *\n\nTesting tools on the Web\n------------------------\n\n[](https://github.com/grame-cncm/faustideas#testing-tools-on-the-web)\n\n*   Currently addressed by: nil\n\nFaust distribution already contains some testing tools, like `faust2plot` or `faust2octave`.etc. It would be great to have them running in a Web page (or some extension of the same idea). For signal generators/processors, several output formats (oscilloscope, spectrogramme...), and for processors several calibrated input signals (dirac impulse, ramp, sinusoide..) would be available.\n\n* * *\n\nProgressive Web applications for iOS and Android\n------------------------------------------------\n\n[](https://github.com/grame-cncm/faustideas#progressive-web-applications-for-ios-and-android)\n\nFaust code can easily be distributed as self-contained Web pages containing the Faust DSP code as a statically compiled Web Audio node. The project is to improve the current model to deploy the pages as [Progressive Web applications](https://en.wikipedia.org/wiki/Progressive_web_app). The [faustwasm](https://github.com/grame-cncm/faustwasm) package will be improved to allow this new kind of deployment model. The use of [movement sensors](https://developer.mozilla.org/en-US/docs/Web/API/Sensor_APIs) will be added in the architecture to keep the same capability currently found in the native applications. Deployment on iOS and Android machines will be tested.\n\nDone, see [faustpwa](https://faustpwa.grame.fr/).\n\n* * *\n\nA tool to generate Faust web components as NPM packages\n-------------------------------------------------------\n\n[](https://github.com/grame-cncm/faustideas#a-tool-to-generate-faust-web-components-as-npm-packages)\n\nFaust code can easily be distributed as self-contained Web pages containing the Faust DSP code as a statically compiled Web Audio node. The project is to improve the current model to deploy the pages as ready-to-use NPM packages. The [faustwasm](https://github.com/grame-cncm/faustwasm) package will be improved to allow this new kind of deployment model. A `faust2webnpm` tool to compile a Faust DSP program will be developed, with [polyphonic](https://faustdoc.grame.fr/manual/midi/#configuring-and-activating-polyphony) and [polyphonic with global effect](https://faustdoc.grame.fr/manual/midi/#audio-effects-and-polyphonic-synthesizer) support.\n\n* * *\n\nPFFT like wrapper for Faust DSP code\n------------------------------------\n\n[](https://github.com/grame-cncm/faustideas#pfft-like-wrapper-for-faust-dsp-code)\n\nThe [Max/MSP pfft~](https://docs.cycling74.com/max8/refpages/pfft~) object is designed to simplify spectral audio processing using the Fast Fourier Transform (FFT). In addition to performing the FFT and the Inverse Fast Fourier Transform (IFFT), pfft~ (with the help of its companion fftin~ and fftout~ objects) manages the necessary signal windowing, overlapping and adding needed to create a real-time Short Term Fourier Transform (STFT) analysis/resynthesis system.\n\nThis model has been tested and implemented by [Shihong Ren](https://github.com/Fr0stbyteR) for Faust and can be tested on a [customized version of the Faust IDE](https://faustide.shren.site/). The FFT input part process the temporal signal, delivers a tripplet of signals (real, imaginary, and current bin index), uses regular Faust DSP code working on this tripplet of signals, and finally do the iFFT process to produce temporal signals.\n\nHere is a noise reduction algorithm using this model written by Shihong.\n\nIt is actually a simplified version of the commonly used spectral denoise (10.1109/TASSP.1979.1163209). When the user hits the button, the algorithm learns the current spectrum as a reference of the background noise. Then, subtract from every input spectrum, the power of this background noise spectrum (for each FFT bin).\n\nThe Faust FFT DSP has 3 inputs: real part/imaginary part/current bin (as in pfft~ in Max). Each input gets sequentially a complex number as information about each FFT bin. The first part of the code gets the current FFT setup and defines necessary functions for calculating FFT info:\n\n```\nimport(\"stdfaust.lib\");\n\nfftSize = hslider(\"fftSize\", 1024, 2, 16384, 1);       // global variable set by the processor itself\nfftHopSize = hslider(\"fftHopSize\", 1024, 2, 16384, 1); // global variable set by the processor itself\nbufferSize = fftSize / 2 + 1; // Bins from 0Hz to Nyquist freq\nfreqPerBin = ma.SR / fftSize;\nbinToFreq = *(freqPerBin);\nfreqToBin = /(freqPerBin);\n\ncartopol(x, y) = x * x + y * y : sqrt, atan2(y, x);  // cartesian to polar\npoltocar(r, theta) = r * cos(theta), r * sin(theta); // polar to cartesian\n```\n\nthen UI components:\n\n```\nfreezeBtn = checkbox(\"Capture\");\nreduceSld = hslider(\"Reduce\", 0, 0, 2, 0.01);\n```\n\nHere is a function to freeze the last spectrum, when the checkbox is on, instead of bypassing the input, it puts the last received full spectrum buffer into a feedback loop:\n\n```\nfreeze(rIn, iIn, bin) = out with { // 3 inputs for each audio channel: real, imaginary, current bin\n    freezeSignal(sig, frz) = orig + freezed with {\n        orig = sig * (1 - frz);\n        freezed = orig : @(bufferSize) : + ~ (*(frz) : @(bufferSize - 1)) * frz;\n    };\n    out = freezeSignal(rIn, freezeBtn), freezeSignal(iIn, freezeBtn);\n};\n```\n\nFinally the main processor, getting the current magnitude value and subtract the freezed spectrum's corresponding magnitude, then output the resulting spectrum for IFFT.\n\n```\nfftproc(rIn, iIn, bin) = out, out with { // 3 inputs for each audio channel: real, imaginary, current bin\n    pol = cartopol(rIn, iIn);\n    mag = pol : _, !;\n    phase = pol : !, _;\n    pol_freezed = freeze(rIn, iIn, bin) : cartopol;\n    mag_freezed = pol_freezed : _, !;\n    phase_freezed = pol_freezed : !, _;\n\n    out = poltocar(mag * (1 - freezeBtn) + (mag - mag_freezed * reduceSld) * freezeBtn : max(0), phase);\n};\nprocess = fftproc;\n```\n\nThe goal of the project is to use the same model for Faust code by writing a C++ wrapper that would add FFT and iFFT processing around the Faust DSP code. This can possibly be done by extending the [ffunction](https://faustdoc.grame.fr/manual/syntax/#foreign-function-declaration) primitive to a mode general version that would deliver a list of output values (instead of a single one), or if not possible, develop a dsp wrapper architecture file that would add the FFT/iFFT process around the Faust DSP code.\n\n* * *\n\nHot reloadable soundfiles\n-------------------------\n\n[](https://github.com/grame-cncm/faustideas#hot-reloadable-soundfiles)\n\nThe [soundfile](https://faustdoc.grame.fr/manual/syntax/#soundfile-primitive) primitive currently provides access to a predefined list of external sound resources. These soundfiles are loaded once during the application's initialization and cannot be modified dynamically during runtime.\n\nThe primary objective of the project is to enable hot reloadability for soundfiles, allowing users to change them on the fly while the DSP code is actively running. To achieve this, two key aspects need enhancement:\n\n*   **code generation improvement**: the code generation process should be refined to facilitate an _atomic switch to the new soundfile_ while the DSP code is in execution. This ensures a seamless transition between different sound resources without interrupting the ongoing processing.\n    \n*   **soundfile loader architecture enhancement**: the architecture of the soundfile loader, detailed in [SoundUI.h](https://github.com/grame-cncm/faust/blob/master-dev/architecture/faust/gui/SoundUI.h), needs to be upgraded. This upgrade should introduce the capability for users to interactively change the loaded soundfile, potentially through a graphical user interface (GUI) element.\n    \n\nFor instance, integrating a GUI item within the application can empower users to select and switch soundfiles effortlessly during runtime.\n\nAdditionally, a possible solution involves implementing a purely memory-based loader. This loader would _emulate soundfiles as audio buffers in memory_, allowing for dynamic changes to the loaded soundfiles without requiring a complete reload of resources. This approach enhances flexibility and responsiveness by enabling real-time alterations to the sound resource being processed.\n\nBy addressing these aspects, the project aims to elevate the functionality of the soundfile primitive, providing users with the ability to seamlessly modify soundfiles while the DSP application is actively running.\n\n* * *\n\nWebGPU audio architecture\n-------------------------\n\n[](https://github.com/grame-cncm/faustideas#webgpu-audio-architecture)\n\nThe [WebGPU audio](https://www.webgpuaudio.com/docs/intro) architecture represents an innovative model to use the WebGL language to compute and render audio on the Web platform: audio Synthesis uses rough streaming architecture to get chunks out of WebGPU and send control buffers to control a WebGPU compute shader.\n\nThe primary objective of the project is to develop a [WebGSL](https://www.w3.org/TR/WGSL/) backend for Faust, and an customized architecture file to render the computed audio using the [Web Audio API](https://www.w3.org/TR/webaudio/), as demonstrated in [the current demonstration](https://gist.github.com/JolifantoBambla/0a4e9c2a0a8bc475f081bc6f9d1aa1a8). To validate the efficacy of this model, benchmarks are planned. These will assess the performance of the WebGPU audio architecture, comparing it against the existing standards of [AudioWorklet and WebAssembly](https://faustdoc.grame.fr/manual/deploying/) solutions.\n\n* * *\n\nInvertible functions\n--------------------\n\n[](https://github.com/grame-cncm/faustideas#invertible-functions)\n\n*   Currently addressed by: nil\n\nThere could be a new primitive to automatically compute the inverse of a function. If the function can't be inverted at compile-time, then an error should be raised. Having access to the inverse would be useful when a user writes a custom scale function and wants to know its inverse. For example, the user might have an hslider whose visible range is \\[0-1\\], but the effective value is scaled:\n\nscale \\= pow(\\_,5)\\*32\\*1000; // take \\[0-1\\] (unitless) and remap into \\[0-32000\\] milliseconds\nscaleInverse \\= inverse(scale);\nh \\= hslider(\"attack\", scaleInverse(50), 0, 1, .01);\nprocess \\= h : scale;\n\nIn the code above, we achieve three things:\n\n*   The `attack` parameter is \"normalized\" between 0 and 1, which is useful for modular synthesis.\n*   We have a custom `scale` function that remaps from \\[0-1\\] to a meaningful milliseconds unit.\n*   We set 50 milliseconds as the default `attack`.\n\nNote that `scaleInverse` will effectively be `scaleInverse = _/(32*1000) : pow(_,1./5);` However, some functions are not invertible, or require assumptions. For example, the inverse of `pow(_,2)` is **plus or minus** `sqrt(_)`.\n\nOther use cases could involve automatically inverting custom scales that use `ba.midikey2hz`.\n\nIn a more advanced example, it might be possible to invert a function that takes multiple arguments, while only inverting over the last argument.\n\nExample:\n\nfunc(a, b, c, x) \\= a+2\\*b+3\\*c+x;\nfuncInverse \\= inverse(func);\n// funcInverse(a, b, c, y) now solves for x in y=func(a, b, c, x)\nprocess \\= \\_ : funcInverse(1, 1, 1) : \\_;\n\nThis would be useful for numerical integration methods (see [en.adsr\\_bias](https://github.com/grame-cncm/faustlibraries/blob/e06f27dd86e110b9f8dcd0b355ee4fb3173c045d/envelopes.lib#L223)).\n\n* * *\n\nfaust2nihplug tool\n------------------\n\n[](https://github.com/grame-cncm/faustideas#faust2nihplug-tool)\n\n[NIH-plug](https://github.com/robbert-vdh/nih-plug) is an API-agnostic audio plugin framework written in Rust. The primary objective of the project is to develop a `faust2nihplug` tool to convert a Faust DSP program in a ready-to-compile NIH-plug project. Those [lowpass-lr4-faust-nih-plug](https://codeberg.org/obsoleszenz/lowpass-lr4-faust-nih-plug) and [lamb-rs](https://github.com/magnetophon/lamb-rs) projects can be used as starting points. Monophonic DSP and MIDI controllable polyphonic instruments should be supported.\n"}