{"name":"International Catrobat Association","description":"Free visual coding apps for computational thinking","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/international-catrobat-association","ideas_url":"https://developer.catrobat.org/pages/development/google-summer-of-code/2025/","logo":"https://summerofcode.withgoogle.com/media/org/international-catrobat-association/dfkxzmsqlkyvwi2o-360.png","technologies":["javascript","swift","kotlin","php","flutter"],"topics":["education","visual programming","mobile programming","game engines","creativity tools"],"projects":[{"project_name":"Pocket Paint Flutter","summary":"Develop a Flutter-based version of the Pocket Paint app by porting features from the existing Android app.","difficulty":"Medium to advanced"},{"project_name":"AI Mentor for PocketCode Students","summary":"Integrate an AI mentor into PocketCode to provide real-time programming guidance and support for students.","difficulty":"Advanced"},{"project_name":"AI-Generated 3D Models from Marine Animals","summary":"Create AI-powered 3D models of marine species for use in educational AR applications.","difficulty":"Medium"},{"project_name":"AR-Based Interactive Marine Ecosystem Simulation","summary":"Develop an AR simulation to help users explore marine ecosystems and understand ecological interactions.","difficulty":"Advanced"},{"project_name":"AI-Driven Adaptive Learning Module for Marine Biology","summary":"Implement an AI-driven system to customize marine biology educational content based on user engagement.","difficulty":"Advanced"},{"project_name":"Mobile Application for Marine Biology AR Learning","summary":"Create a mobile AR application to enable interactive and accessible marine biology education.","difficulty":"Advanced"},{"project_name":"Open-Source AR Toolkit for STEM Education","summary":"Build an open-source AR framework for educators to enhance STEM learning with interactive content.","difficulty":"Medium"},{"project_name":"Awesome Demo Game Project on Marine Biology","summary":"Develop a demo game focused on marine biology to encourage awareness of marine conservation.","difficulty":"Beginner"},{"project_name":"Your own Project Ideas ...","summary":"Encourage participants to propose and develop their own project ideas that improve or extend existing features.","difficulty":"Advanced"}],"jina_response":"Title: 2025\n\nURL Source: https://developer.catrobat.org/pages/development/google-summer-of-code/2025/\n\nMarkdown Content:\n[](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#ideas-page-for-google-summer-of-code-2025)Ideas Page for Google Summer of Code 2025\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nWe are thrilled to share our carefully curated project ideas for this year’s Google Summer of Code.\n\n[](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#general-information)General Information\n-----------------------------------------------------------------------------------------------------------------------\n\nThese ideas are just some topics we came up with, where currently nobody is working on. However, Catrobat is a project with a wide range of possibilities and we’re aware of our blindspots: So let’s live the spirit of Open Source and come up with improvements (e.g., new features, extensions, …) that are related to the project and in which you’re interested in. We do have many senior contributors who would be happy to mentor such a project. Don’t be shy and check out the last point on the list: Your idea!\n\n[](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#general-knowledge-prerequisites-for-all-projects)General Knowledge Prerequisites for all Projects\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n*   Knowledge in the usage of Git and GitHub\n*   Basic knowledge in the concepts of software testing (e.g., test doubles) and test-driven development\n*   Basic knowledge in app development (for Android and iOS projects)\n*   Java, JUnit, Mockito, Robotium and Espresso for Android development\n*   Swift and Objective C for iOS development\n*   Also please check that you have the proper hardware for the development (e.g., an Android/iOS smartphone for testing some of the projects, Mac for iOS development etc)\n\n[](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#idea-overview)Idea Overview\n-----------------------------------------------------------------------------------------------------------\n\n1.  [Pocket Paint Flutter](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#pocket-paint-flutter)\n2.  [AI Mentor for PocketCode Students](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#ai-mentor-for-pocketcode-students)\n3.  [AI-Generated 3D Models from Marine Animals](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#ai-generated-3d-models-from-marine-animals)\n4.  [AR-Based Interactive Marine Ecosystem Simulation](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#ar-based-interactive-marine-ecosystem-simulation)\n5.  [AI-Driven Adaptive Learning Module for Marine Biology](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#ai-driven-adaptive-learning-module-for-marine-biology)\n6.  [Mobile Application for Marine Biology AR Learning](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#mobile-application-for-marine-biology-ar-learning)\n7.  [Open-Source AR Toolkit for STEM Education](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#open-source-ar-toolkit-for-stem-education)\n8.  [Awesome Demo Game Project on Marine Biology](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#awesome-demo-game-project-on-marine-biology)\n9.  [Your own Project Ideas …](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#your-own-project-ideas-)\n\n[](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#project-descriptions)Project Descriptions\n-------------------------------------------------------------------------------------------------------------------------\n\n### [](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#pocket-paint-flutter)Pocket Paint Flutter\n\n350 Hours\n\n> **Required Skills**: Flutter, Dart, Android-Development, Agile Development  \n> **Possible Mentors**: Abdulbaki Celebi, Mario Kaurin, Julia Herold, Thorsten Bandel  \n> **Expected Outcome**: Features from Kotlin/Java version of Paintroid ported to new Flutter-based version  \n> **Difficulty level**: Medium to advanced\n\nThe developer should have knowledge of Flutter. Develop and implement missing tools in Flutter that exist in our old Android app built with Android Native.\n\n* * *\n\n### [](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#ai-mentor-for-pocketcode-students)AI Mentor for PocketCode Students\n\n350 Hours\n\n> **Required Skills**: Kotlin, Python, Android AI and ML Tools, Android-Development, Agile Development, Test Driven Development, Clean Code  \n> **Possible Mentors**: Paul Spiesberger, Patrick Ratschiller  \n> **Expected Outcome**: An integrated proof of concept AI mentor within PocketCode  \n> **Difficulty level**: Advanced\n\nAI is now capable of sophisticated programming and can automate many coding tasks. More importantly, it excels at explaining code to students, making learning more engaging and accessible. Our goal is to integrate an AI-powered mentor into PocketCode that understands a student’s programming context and offers real-time guidance to enhance learning and coding skills.\n\nThe AI mentor could:\n\n*   Explain programming concepts, from variables and loops to software design patterns and testing strategies\n*   Suggest code from text prompts, help debug issues, and propose project ideas\n*   Assist in code architecture, naming conventions, and writing Catrobat language tests\n*   Explain and translate downloaded projects from other users\n\nYou won’t need to implement everything—just focus on a part that excites you most! The Catrobat team will provide the initial prompt and necessary API access or local LLMs for support.\n\n* * *\n\n### [](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#ai-generated-3d-models-from-marine-animals)AI-Generated 3D Models from Marine Animals\n\n350 Hours\n\n> **Preferred Skills**: Generative AI (Stable Diffusion, GANs, Autoencoders), 3D Modeling (Blender, Unreal Engine), Marine Biology Data Sources  \n> **Possible Mentors**: Krishan Mohan Patel, Himanshu Kumar  \n> **Expected Outcome**: Functionally coded 3D models  \n> **Difficulty level**: Medium\n\nThis year’s focus of Catrobat includes topics around marine biology as an application area, and we have several projects around the general topic. This project will focus on developing AI-powered 3D models of marine species using generative AI techniques. By training machine learning models on marine biology datasets, realistic and interactive 3D assets of octopus, fish, corals, and other underwater species will be created for use in AR applications for teaching marine biology in high schools, where teachers and pupils will be able to “program” the simulated marine animals for learning purposes integrated into biology curricula. These models will adapt dynamically based on environmental conditions like depth, temperature, and biodiversity levels.\n\n* * *\n\n### [](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#ar-based-interactive-marine-ecosystem-simulation)AR-Based Interactive Marine Ecosystem Simulation\n\n350 Hours\n\n> **Preferred Skills**: AR Development (Unity, ARKit, ARCore), Physics-Based Ecosystem Simulations, AI-Powered Content Adaptation  \n> **Possible Mentors**: Himanshu Kumar, Aryavardhan Sharma  \n> **Expected Outcome**: AR simulation code  \n> **Difficulty level**: Advanced\n\nThis year’s focus of Catrobat includes topics around marine biology as an application area, and we have several projects around the general topic. This project will develop an immersive AR simulation that allows users to explore marine ecosystems and understand ecological interactions. Students will be able to visualize food chains, coral reef dynamics, and the effects of pollution through real-time AR simulations. This project aims to provide an engaging, hands-on learning experience for STEM education.\n\n* * *\n\n### [](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#ai-driven-adaptive-learning-module-for-marine-biology)AI-Driven Adaptive Learning Module for Marine Biology\n\n350 Hours\n\n> **Preferred Skills**: AI for Adaptive Learning (Reinforcement Learning, NLP), Educational Gamification Techniques, Data Analytics for User Behavior Tracking  \n> **Possible Mentors**: Aryavardhan Sharma, Supreeth M Kumar  \n> **Expected Outcome**: AI-based machine learning module  \n> **Difficulty level**: Advanced\n\nThis year’s focus of Catrobat includes topics around marine biology as an application area, and we have several projects around the general topic. This project will implement an AI-driven adaptive learning system that customizes educational content based on student engagement and progress. The system will analyze user interactions, quizzes, and exploration patterns to personalize the learning path, ensuring a more effective and engaging experience. We will provide remote access to hardware on which the learning algorithms can be executed.\n\n* * *\n\n### [](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#mobile-application-for-marine-biology-ar-learning)Mobile Application for Marine Biology AR Learning\n\n350 Hours\n\n> **Preferred Skills**: Mobile AR Development (Flutter, React Native), UI/UX Design for Interactive Learning, Voice & Gesture Recognition  \n> **Possible Mentors**: Supreeth M Kumar, Paul Spiesberger  \n> **Expected Outcome**: Mobile AR app  \n> **Difficulty level**: Advanced\n\nThis year’s focus of Catrobat includes topics around marine biology as an application area, and we have several projects around the general topic. This project will focus on developing a mobile AR application that allows students to access interactive marine biology lessons anywhere. The app will support gesture-based interaction, voice commands, and real-time exploration of AI-generated underwater environments, making STEM education more accessible.\n\n* * *\n\n### [](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#open-source-ar-toolkit-for-stem-education)Open-Source AR Toolkit for STEM Education\n\n350 Hours\n\n> **Required Skills**: Open-Source Development (GitHub, API Integrations), Modular AR Content Framework, Cross-STEM Applications (Physics, Chemistry, Earth Science).  \n> **Possible Mentors**: Wolfgang Slany, Krishan Mohan Patel  \n> **Expected Outcome**: AR toolkit / STEM  \n> **Difficulty level**: Medium\n\nThis year’s focus of Catrobat includes topics around marine biology as an application area, and we have several projects around the general topic. This project will create a modular, open-source AR framework that educators and developers can use to extend AR-based learning into other STEM domains. The toolkit will include pre-built 3D models, AI-based interactive features, and an easy-to-use interface for educators to integrate AR content into their curriculum.\n\n* * *\n\n### [](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#awesome-demo-game-project-on-marine-biology)Awesome Demo Game Project on Marine Biology\n\n350 Hours\n\n> **Required Skills**: Coding Basics  \n> **Possible Mentors**: Selina Ernst, Wolfgang Slany  \n> **Expected Outcome**: Catrobat Demo Game on Marine Biology  \n> **Difficulty level**: Beginner\n\nSpend the whole GSoC time developing and designing a demo game. This year’s focus of Catrobat includes topics around marine biology as an application area, and we have several projects around the general topic. The present project aims at inspiring young people to become aware of topics related to the protection of marine habits by creating related video games of their own. If you have your own original idea about a game around this topic, please feel free to suggest it. Please note that the demo game will be published under Catrobat’s free open source license, and that the game will thus become part of the Catrobat FLOSS project’s source code. Thus, all artwork, sounds, character names etc must be compatible with our licenses, i.e., freely publishable under our licenses, the AGPL version 3 and CC BY-SA 4.0, or under a compatible, possibly even freer license such as CC0.\n\n* * *\n\n### [](https://developer.catrobat.org/pages/development/google-summer-of-code/2025/#your-own-project-ideas-)Your own Project Ideas …\n\n90, 175 or 350 Hours\n\n> **Required Skills**: Kotlin, Java, Android-Development, iOS-Development, Agile Development  \n> **Requirement**: self-organized work  \n> **Difficulty level**: advanced\n\nIn the last years we found that you have many great ideas and knowledge! We’re aware that there are many ways how to improve performance, reduce memory usage, make our services more stable and of course the code easier to maintain. We’re sure you do have ideas how to achieve this, although we may have never heard of this approach before -\\> that’s the great thing about Open Source! And well, that’s also the experience we made at last year’s GSoC - and we liked it!\n\nAlso new features or extensions for iOS and Android are welcome to be introduced to us. Help us to spread coding and Open Source!\n"}