{"name":"IOOS","description":"Our eyes on the ocean, coasts, and Great Lakes","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/ioos","ideas_url":"https://github.com/ioos/gsoc/blob/main/2025/ideas-list.md","logo":"https://summerofcode.withgoogle.com/media/org/ioos/oe7caipkhwnizoyr-360.png","technologies":["python","java","r","Zarr","NetCDF"],"topics":["open data","open science","data management","Oceanography","Marine Biodiversity"],"projects":[{"project_name":"Build web UI versions using pyodide/pyscript for IOOS tools","summary":"Create interfaces for ioos-qc and compliance-checker to enable user interaction with datasets and data checks.","difficulty":"350 hours"},{"project_name":"Prometheus server- graphs and monitoring for ERDDAP™","summary":"Develop a Prometheus Server to monitor ERDDAP™ instances with added metrics.","difficulty":"175 hours"},{"project_name":"Update ERDDAP™ page rendering to use a template framework","summary":"Migrate ERDDAP™ pages to a templating framework for improved rendering.","difficulty":"175 hours"},{"project_name":"IOOS Cloud Sandbox - model validation and verification tools","summary":"Add tools for validating and verifying models against a variety of data sources in the IOOS Cloud Sandbox.","difficulty":"175 hours"},{"project_name":"Code separation and build management for cloudflow","summary":"Refactor Cloudflow's code for better management and deployment using poetry or uv build.","difficulty":"90 hours"},{"project_name":"Increased logging for Cloudflow","summary":"Enhance AWS logging in Cloudflow to support multiple user operations more effectively.","difficulty":"90 hours"},{"project_name":"Combined DwCA/Croissant JSON-LD examples and tools","summary":"Develop tools to convert DwC metadata to JSON-LD and create a proof-of-concept AI model pipeline.","difficulty":"175 hours"},{"project_name":"NOAA trawl survey database","summary":"Establish an accessible database for marine survey data in the Northeast Pacific Ocean.","difficulty":"175 hours"},{"project_name":"Extend CrocoLake's available datasets","summary":"Adapt existing datasets to fit CrocoLake's format for broader availability.","difficulty":"175 hours"},{"project_name":"Autoval Improvement","summary":"Enhance the Autoval package for better validation in the STOFS framework.","difficulty":"175 hours"},{"project_name":"OCSMesh Parallelization","summary":"Increase efficiency of OCSMesh by parallelizing key processes like DEM and mesh generation.","difficulty":"350 hours"},{"project_name":"STOFS dashboard","summary":"Advance the STOFS event dashboard for users to compare model results with actual events.","difficulty":"175 hours"},{"project_name":"Probabilistic Surge Model Performance Assessment","summary":"Improve model evaluation capabilities for storm surge predictions in the OCS framework.","difficulty":"175 hours"},{"project_name":"Land Cover Integration for Parametric Hurricane Model (PaHM)","summary":"Incorporate land cover effects into hurricane models to enhance prediction accuracy.","difficulty":"350 hours"},{"project_name":"Expand the Google Test suite for the Fisheries Integrated Modeling System","summary":"Add tests for the FIMS codebase to enhance reliability and coverage of statistical models.","difficulty":"175 hours"},{"project_name":"Fix clang-tidy for the Fisheries Integrated Modeling System","summary":"Ensure FIMS code adheres to Google C++ standards using clang-tidy with GitHub actions.","difficulty":"90 hours"},{"project_name":"Complete the integration of the logging system in the Fisheries Integrated Modeling System","summary":"Insert necessary logging entries in FIMS code to improve monitoring and debugging.","difficulty":"90 hours"},{"project_name":"phytoclass for the masses","summary":"Improve the usability of the phytoclass R library for estimating phytoplankton abundance from pigment data.","difficulty":"90 hours"},{"project_name":"pyOBIS for stakeholders","summary":"Leverage the pyOBIS library to create Jupyter notebooks for natural resource management research.","difficulty":"90 hours"}],"jina_response":"Title: gsoc/2025/ideas-list.md at main · ioos/gsoc\n\nURL Source: https://github.com/ioos/gsoc/blob/main/2025/ideas-list.md\n\nMarkdown Content:\n| Build web UI versions using pyodide/pyscript for IOOS tools | [ioos/gsoc#64](https://github.com/ioos/gsoc/issues/64) | The idea for this project is to build interfaces for ioos-qc and compliance-checker. A user should be able to load datasets, select data and the checks they want to apply. | 350 hours |\n| Prometheus server- graphs and monitoring for ERDDAP™ | [ioos/gsoc#72](https://github.com/ioos/gsoc/issues/72) | We recently started adding Prometheus metrics to ERDDAP™. The main goal of this project is to build an example Prometheus Server which can monitor one or more ERDDAP™ instances. | 175 hours |\n| Update ERDDAP™ page rendering to use a template framework | [ioos/gsoc#73](https://github.com/ioos/gsoc/issues/73) | The project is to migrate existing ERDDAP™ pages to use a templating framework. | 175 hours |\n| IOOS Cloud Sandbox - model validation and verification tools | [ioos/gsoc#84](https://github.com/ioos/gsoc/issues/84) | Add model validation and verification tools to [https://github.com/ioos/Cloud-Sandbox](https://github.com/ioos/Cloud-Sandbox). Model validation and verification can include comparing model results to observations, previously validated data, other model data, etc. | 175 hours |\n| Code separation and build management for cloudflow | [ioos/gsoc#85](https://github.com/ioos/gsoc/issues/85) | Move Cloudflow's code to a poetry or uv build, with well-established and externalized dependency, and allow deployment to pypi. | 90 hours |\n| Increased logging for Cloudflow | [ioos/gsoc#86](https://github.com/ioos/gsoc/issues/86) | Having AWS logging increased within the codebase of cloudflow would greatly increase our capacity to support multiple users on the coastal sandbox. | 90 hours |\n| Combined DwCA/Croissant JSON-LD examples and tools | [ioos/gsoc#70](https://github.com/ioos/gsoc/issues/70) | The project would primarily consist of python tools to convert existing DwC metadata (in XML format) into JSON-LD format, example metadata for datasets that employ both standards, and a proof-of-concept pipeline that uses a combined DwC/Croissant-described dataset to train an AI model that predicts DwC categories from images | 175 hours |\n| NOAA trawl survey database | [ioos/gsoc#74](https://github.com/ioos/gsoc/issues/74) | The primary objective of this project is to create an accessible international database of transboundary marine survey data across the Northeast Pacific Ocean. | 175 hours |\n| Extend CrocoLake's available datasets | [ioos/gsoc#75](https://github.com/ioos/gsoc/issues/75) | This project consists in taking an existing dataset that is not yet included in CrocoLake and developing or adapting existing modules to convert it to CrocoLake's format. | 175 hours |\n| Autoval Improvement | [ioos/gsoc#76](https://github.com/ioos/gsoc/issues/76) | This project aims to enhance the capabilities of the Autoval package, which was developed for STOFS auto validation. STOFS stands for the Surge and Tide Operational Forecast System. | 175 hours |\n| OCSMesh Parallelization | [ioos/gsoc#77](https://github.com/ioos/gsoc/issues/77) | OCSMesh is a Python package that automates the generation of unstructured continuous (creek-to-ocean) meshes using the jigsaw-python library and triangles. The goal of this project is to increase OCSMesh’s efficiency by parallelizing the most time consuming steps, including DEM processing and jigsaw mesh generation. | 350 hours |\n| STOFS dashboard | [ioos/gsoc#78](https://github.com/ioos/gsoc/issues/78) | This project aims to advance and improve our STOFS event dashboard (github repo). This tool allows a user to select events (e.g., tropical cyclones, winter storms, major incidents in coastal areas) and compare STOFS model results with observations for those events. | 175 hours |\n| Probabilistic Surge Model Performance Assessment | [ioos/gsoc#79](https://github.com/ioos/gsoc/issues/79) | The storm surge modeling team at the Office of Coast Survey (OCS) have developed a framework called (ondemand-storm-workflow) to develop probabilistic hurricane storm surge models. The goal of this project is to improve the post-prossessing and model evaluation capabilities of the workflow. | 175 hours |\n| Land Cover Integration for Parametric Hurricane Model (PaHM) | [ioos/gsoc#80](https://github.com/ioos/gsoc/issues/80) | This project aims to enhance the Generalized Asymmetric Holland Model (GAHM) within the Parametric Hurricane Modeling System (PaHM) framework by incorporating land cover effects on wind speeds during tropical cyclones. | 350 hours |\n| Expand the Google Test suite for the Fisheries Integrated Modeling System | [ioos/gsoc#81](https://github.com/ioos/gsoc/issues/81) | The Fisheries Integrated Modeling System (FIMS) is a framework to create statistical models, written in C++ and R, to assess the status of marine resources. This project will add tests for uncovered code and suggest places where the tests, especially the Google tests, can be enhanced. | 175 hours |\n| Fix clang-tidy for the Fisheries Integrated Modeling System | [ioos/gsoc#82](https://github.com/ioos/gsoc/issues/82) | The project follows a modified Google style guide for the The Fisheries Integrated Modeling System (FIMS) C++ standards and relies on GitHub action using clang-tidy to ensure that code pushed to the GitHub repository conforms to these standards. | 90 hours |\n| Complete the integration of the logging system in the Fisheries Integrated Modeling System | [ioos/gsoc#83](https://github.com/ioos/gsoc/issues/83) | This project would take examples already in the source code for the The Fisheries Integrated Modeling System (FIMS) and use pattern matching to insert new logging entries into the code where it seems that they are needed. | 90 hours |\n| phytoclass for the masses | [ioos/gsoc#90](https://github.com/ioos/gsoc/issues/90) | This project will improve usability and accuracy of phytoclass R library for conversion of HPLC pigment data to phytoplankton abundance estimations. | 90 hours |\n| pyOBIS for stakeholders | [ioos/gsoc#91](https://github.com/ioos/gsoc/issues/91) | This project will make use of the pyOBIS python library to create a series of jupyter notebooks to address research questions of natural resource managers. | 90 hours |\n"}