{"name":"KDE Community","description":"Control your digital life","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/kde-community","ideas_url":"https://community.kde.org/GSoC/2025/Ideas","logo":"https://summerofcode.withgoogle.com/media/org/kde-community/1mbnnsqwd2ejcmy8-360.png","technologies":["c++","qt","qml","data structures"],"topics":["education","science","applications","desktop environment"],"projects":[{"project_name":"Python virtual environments in Cantor","summary":"Enhance Cantor to support Python virtual environments, allowing users to work within multiple isolated Python configurations.","difficulty":"Difficult"},{"project_name":"Port account management to QML","summary":"Transition Merkuro's account management dialogs from QtWidgets to QML, improving its usability on mobile devices.","difficulty":"Difficult"},{"project_name":"Rewrite Zip backend to use libzip","summary":"Replace the existing zip file handling in KArchive with libzip to improve reliability and functionality.","difficulty":"Difficult"},{"project_name":"Move translation files to git","summary":"Migrate KDE's translation files from SVN to GIT, preserving their history and adapting necessary scripts.","difficulty":"Medium"},{"project_name":"Make KWin aware of game controllers","summary":"Modify KWin to recognize game controller inputs to enhance gaming support in Plasma.","difficulty":"Difficult"},{"project_name":"Make Plasma Virtual Keyboard production-ready","summary":"Refine the virtual keyboard to ensure it is functional for various languages and ready for default inclusion in Plasma.","difficulty":"Difficult"},{"project_name":"Select & use more than one input method","summary":"Enable multiple input methods to work simultaneously in Plasma, improving accessibility and user experience.","difficulty":"Difficult"},{"project_name":"Improve input handling","summary":"Contribute to improving input handling in KDE by discussing and developing personalized project ideas.","difficulty":"Varies"},{"project_name":"Enhancing mobile network settings in Plasma","summary":"Revamp the mobile networking settings to match desktop capabilities, including VPN and enterprise Wi-Fi support.","difficulty":"Difficult"},{"project_name":"Create a GUI for ISO Image Writer using Kirigami","summary":"Develop a GUI for the existing ISO Image Writer tool using Kirigami for better user experience.","difficulty":"Difficult"},{"project_name":"Backup Prototype","summary":"Design a local backup solution prototype that ensures data is reliably backed up and retrievable.","difficulty":"Difficult"},{"project_name":"CVE/Security Tracker","summary":"Develop a system for tracking known vulnerabilities in software installations to enhance security.","difficulty":"Difficult"},{"project_name":"Recovery Infrastructure","summary":"Create a tool to help users recover data from a non-booting or crashed system.","difficulty":"Difficult"},{"project_name":"Replication Infrastructure","summary":"Develop a tool for data synchronization between systems to facilitate easy transitions when changing devices.","difficulty":"Difficult"},{"project_name":"Karton UI Development","summary":"Build a Kirigami graphical interface for the KDE virtual machine application, replacing traditional tools like virt-manager.","difficulty":"Difficult"},{"project_name":"Automatic Testing","summary":"Establish automated testing for KDE Linux components to detect regressions prior to feature releases.","difficulty":"Medium"},{"project_name":"KDE Linux Website","summary":"Create a website for KDE Linux using Hugo, providing essential information and resource links.","difficulty":"Easy"},{"project_name":"Add Bao La Kiswahili to Mankala","summary":"Integrate the game Bao La Kiswahili into Mankala and develop a computerized opponent using machine learning algorithms.","difficulty":"Medium"},{"project_name":"Improving Kdenlive timeline markers","summary":"Enhance Kdenlive by adding duration attributes to timeline markers for better feature integration.","difficulty":"Medium"},{"project_name":"Implement block editor for Marknote","summary":"Create a drag-and-drop block editor for Markdown elements to improve UI interaction and reusability across apps.","difficulty":"Medium"}],"jina_response":"Title: 2025/Ideas - KDE Community Wiki\n\nURL Source: https://community.kde.org/GSoC/2025/Ideas\n\nMarkdown Content:\n[![Image 1](https://community.kde.org/images.community/thumb/8/8b/Mascot_konqi-app-presentation.png/300px-Mascot_konqi-app-presentation.png)](https://community.kde.org/File:Mascot_konqi-app-presentation.png)\n\n[Konqi](https://community.kde.org/Konqi \"Konqi\") is giving a lesson!\n\nSee also: [GSoC Instructions](https://community.kde.org/GSoC \"GSoC\"), [Last year ideas](https://community.kde.org/GSoC/2024/Ideas \"GSoC/2024/Ideas\")\n\nGuidelines\n----------\n\n### Information for Students\n\nThese ideas were contributed by our developers and users. They are sometimes vague or incomplete. If you wish to submit a proposal based on these ideas, you are urged to contact the developers and find out more about the particular suggestion you're looking at.\n\nBecoming accepted as a Google Summer of Code student is quite competitive. Accepted students typically have thoroughly researched the technologies of their proposed project and have been in frequent contact with potential mentors. **Simply copying and pasting an idea here will not work. Neither generating a proposal with ChatGPT or equivalent!** On the other hand, creating a completely new idea without first consulting potential mentors rarely works.\n\nWhen writing your proposal or asking for help from the general KDE community don't assume people are familiar with the ideas here. KDE is really big!\n\nIf there is no specific contact given you can ask questions on the general KDE development list kde-devel@kde.org. See [the KDE mailing lists page](http://www.kde.org/mailinglists/) for information on available mailing lists and how to subscribe.\n\n![Image 2](https://community.kde.org/images.community/c/c1/Note-box-icon.png)\n\n**Note**\n\n**These are all proposals! We are open to new ideas you might have!!** Do you have an awesome idea you want to work on with KDE but that is not among the ideas below? That's cool. We love that! But please do us a favor: Get in touch with a mentor early on and make sure your project is realistic and within the scope of KDE.\n\n### Adding a Proposal\n\nWhen adding an idea to this section, please include the following data:\n\n*   if the application is not widely known, a description of what it does and where its code lives\n*   a **brief explanation** (2-5 sentences, do not just put a link to a bug)\n*   the expected size of the project (small-90 hours, medium-175 hours or large-350 hours)\n*   the expected results\n*   pre-requisites for working on your project (skills required/preferred)\n*   if applicable, links to more information or discussions\n*   mailing list or IRC channel for your application/library/module\n*   your name and email address for contact (if you're willing to be a mentor)\n*   if possible, an easy, medium or hard rating of the project\n\nIf you are not a developer but have a good idea for a proposal, get in contact with relevant developers first.\n\n![Image 3](https://community.kde.org/images.community/c/c1/Note-box-icon.png)\n\n**Note**\n\nFollow this template!\n\n### Project: Something that you're totally excited about\n\n**Brief explanation:** Do you have an awesome idea you want to work on with KDE but that is not among the ideas below? That's cool. We love that! But please do us a favor: Get in touch with a mentor early on and make sure your project is realistic and within the scope of KDE. That will spare you and us a lot of frustration.\n\n**Expected results:** Something you and KDE loves\n\n**Knowledge Prerequisite:** Probably C++ and Qt but depends on your project\n\n**Duration:** Mention one of ~90, ~175 or ~350 hours of effort necessary to finish the project. Use only one of these three project classes and don't come up with other numbers here.\n\n**Difficulty:** Easy, medium or difficult project\n\n**Mentor:** Try to see who in KDE is interested in what you want to work on and approach them. If you are unsure you can always ask in [#kde-soc:kde.org](https://matrix.to/#/#kde-soc:kde.org) on matrix.\n\n![Image 4](https://community.kde.org/images.community/c/c1/Note-box-icon.png)\n\n**Note**\n\nOnly projects as part of KDE can be mentored.\n\nCantor\n------\n\n### Project: Python virtual environments in Cantor\n\n**Brief explanation:** Cantor is a graphical frontend for different computer algebra systems and programming languages ([https://cantor.kde.org/](https://cantor.kde.org/)). For the Python backend, it lacks the support for Python virtual environments. The purpose of this project is to implement this missing functionality.\n\n**Expected results:** Cantor can work with multiple Python virtual environment similarly to how it's possible in other IDEs like Spider-IDE, PyCharm, etc.\n\n**Knowledge Prerequisite:** C++\n\n**Duration:** ~350 hours\n\n**Difficulty:** Difficult\n\n**Mentors:** Alexander Semke, Israel Galadima (#cantor:kde.org)\n\nMerkuro\n-------\n\n### Project: Port account management to QML\n\n**Brief explanation:** Currently Merkuro makes use of QtWidgets dialog for managing the type of resources (accounts), the goal is to port all (or at least a some) of the dialogs to QML\n\n**Expected results:** Making Merkuro a step closer to be fully usable on mobile\n\n**Knowledge Prerequisite:** QML and C++\n\n**Duration:** ~350 hours, but we can discuss to reduce the scopes\n\n**Difficulty:** Difficult\n\n**Mentors:** Carl Schwan and Aakarsh MJ. Please contact us on #merkuro:kde.org (Matrix) and not via DM\n\nKArchive\n--------\n\n### Project: Rewrite Zip backend to use libzip\n\n**Brief explanation:** Currently karchive uses home grown code to handle zip files. The code is not very good since it gets confused when it finds token markers in what it is actual compressed data. See [https://bugs.kde.org/show\\_bug.cgi?id=450597](https://bugs.kde.org/show_bug.cgi?id=450597)\n\n**Expected results:** KArchive uses libzip for handling zip files (and there's no regressions)\n\n**Knowledge Prerequisite:** C++\n\n**Duration:** ~350 hours\n\n**Difficulty:** Difficult\n\n**Mentor:** Albert Astals Cid <aacid@kde.org\\>\n\nInternationalization\n--------------------\n\n### Project: Move translation files to git\n\n**Brief explanation:** Translation files currently live in SVN, they are one of the last things in SVN, and the sysadmin team would welcome if we stop using it so they can shut down the server (also some folks have trouble using SVN since it's now starting to become old). The plan is to move files to GIT but we need to make sure the history is preserved and the associated scripts are adapted. See more at [https://invent.kde.org/teams/localization/issues/-/issues/1](https://invent.kde.org/teams/localization/issues/-/issues/1)\n\n**Expected results:** Most/All of what is described above is done.\n\n**Knowledge Prerequisite:** git/bash/python\n\n**Duration:** ~350 hours\n\n**Difficulty:** Medium\n\n**Mentor:** Albert Astals Cid/Luigi Toscano, talk to us at [https://matrix.to/#/#kde-i18n:kde.org](https://matrix.to/#/#kde-i18n:kde.org)\n\nPlasma\n------\n\n### Project: Make KWin aware of game controllers\n\n**Brief explanation:** Plasma could do a lot to improve support for game controllers: gamepads, fight sticks, flight sticks, and more. But before we can work on advanced features like button mapping or mouse emulation, Plasma's Wayland compositor KWin first needs to take control of controller input. The task is to modify KWin so it reads game controller input events and provides it back to games/applications unmodified. Once that's in place, the sky's the limit.\n\n**Expected results:** KWin has access to game controller input events, games still work, and Plasma does not suspend the system as long as you use the controller ([one of our oldest bugs](https://bugs.kde.org/show%20bug.cgi?id=328987))\n\n**Knowledge Prerequisite:** C++, a little Qt, patience to dive into KWin and Wayland protocols\n\n**Duration:** ~350 hours\n\n**Difficulty:** Difficult\n\n**Mentor:** Xaver Hugl. Introduce yourself on #kde-input:kde.org (Matrix) and tag user @zamundaaa\n\n### Project: Make Plasma Virtual Keyboard production-ready\n\n**Brief explanation:** Evolve the current proof of concept into a solution that can be shipped with Plasma by default. Currently it's based on the Qt Virtual Keyboard API [\\[1\\]](https://mail.kde.org/pipermail/plasma-devel/2024-June/123435.html) [\\[2\\]](https://mail.kde.org/pipermail/plasma-devel/2025-January/123611.html). It still needs lots of work and polish first though. That's where you come in!\n\n**Expected results:** A virtual keyboard that works well for different languages and can be shipped with Plasma. It should be usable on phones, tablets and the likes.\n\n**Knowledge Prerequisite:** C++, a little Qt, understanding of how Wayland works.\n\n**Duration:** ~350 hours\n\n**Difficulty:** Difficult\n\n**Mentor:** Aleix Pol. Introduce yourself on #kde-input:kde.org (Matrix) and tag user @apol:kde.org\n\n### Project: Select & use more than one input method\n\n**Brief explanation:** Different users require different ways to input text. Some will need an on-screen keyboard for their tablet, phone, or laptop touchscreen. Some use fcitx5 or IBus to enter complex characters with their keyboard. Some would like to dictate or generate text with the help of an AI model. Some would like all of the above depending on the situation. Plasma on Wayland currently lets you select one input method as \"Virtual Keyboard\" in System Settings, but ideally we want many input methods to co-exist peacefully.\n\n**Expected results:** On the less ambitious end, Plasma and KWin will let you switch between input methods / virtual keyboard on the fly. On the more ambitious end, multiple input methods can be active at the same time so you can e.g. use fcitx5 for physical keyboard input and Maliit or plasma-keyboard as on-screen keyboard.\n\n**Knowledge Prerequisite:** C++, a little Qt, understanding of how Wayland works\n\n**Duration:** ~350 hours\n\n**Difficulty:** Difficult\n\n**Mentor:** Eike Hein. Introduce yourself on #kde-input:kde.org (Matrix) and tag user @hein:kde.org\n\n### Project: Improve input handling in ways that you're totally excited about\n\n**Brief explanation:** Input handling is [one of the elected KDE Goals](https://phabricator.kde.org/T17433) and we're looking for all the help we can get. If you have an itch that needs scratching, and none of the other ideas on this page look quite right to you, we're still interested in your contributions. Drop by on our Matrix channel (see below) and let's discuss what your project could look like.\n\n**Expected results:** An input-related GSoC application drafted with community input but including many of your own ideas, opinions and planned milestones. Once selected, actually delivering on those plans.\n\n**Knowledge Prerequisite:** Depends on the project, but probably C++, Qt, and a basic understanding of Wayland\n\n**Duration:** 90, 175 or 350 hours, depending on what you sign up for\n\n**Difficulty:** also depends on the project\n\n**Mentor:** Jakob Petsovits (@jpetso:kde.org) and/or other interested KDE people in the #kde-input:kde.org (Matrix) chatroom. Say hi and let's chat!\n\nPlasma Mobile\n-------------\n\n**Brief explanation:** Currently, Plasma Mobile has its own Wi-Fi, cellular networking and hotspot settings modules. They are very basic, and lack some features compared to their desktop equivalents (ex. enterprise Wi-Fi security). The desktop has a very functional networking settings module, but it has a large codebase and complex UI that is not easy to adapt to mobile usage.\n\nThe aim of the project is to improve the mobile networking settings so that it is functionally equivalent to the desktop experience. This includes support for enterprise Wi-Fi networks, VPN configuration, and etc. The tasks involves exposing configuration values from C++ to QML and writing some UI code around it (working heavily with NetworkManager and ModemManager). Developing a shared base with the desktop implementation and consolidating code is also a key goal.\n\n**Expected results:** Mobile network KCMs can share more code with the desktop one and are more featureful\n\n**Knowledge Prerequisite:** QML and C++\n\n**Duration:** ~350 hours\n\n**Difficulty:** Difficult\n\n**Mentor:** Carl Schwan and rest of Plasma mobile team. [https://matrix.to/#/#plasmamobile:kde.org](https://matrix.to/#/#plasmamobile:kde.org)\n\nKDE Linux\n---------\n\n### Kirigami ISO Image Writer\n\n**Brief explanation:** Create a GUI in [Kirigami](https://develop.kde.org/frameworks/kirigami//) for [ISO Image Writer](https://apps.kde.org/fr/isoimagewriter/): [https://invent.kde.org/kde-linux/kde-linux/-/issues/132](https://invent.kde.org/kde-linux/kde-linux/-/issues/132)\n\n**Expected results:** ISO Image Writer GUI rewrite using Kirigami.\n\n**Knowledge Prerequisite:** QML and C++\n\n**Duration:** ~350 hours\n\n**Difficulty:** Difficult\n\n**Mentor:** Harald Sitter et al. [https://matrix.to/#/#kde-linux:kde.org](https://matrix.to/#/#kde-linux:kde.org)\n\n### Backup Prototype\n\n**Brief explanation:** Backuping its data is important to not lose them. Whether it's duplicating locally, on the same network or on an external server to be able to retrieve them in case of bad manipulation or incident. The tool should also be robust and trustable (when it says it copied, it really copied). The projects aims to create a prototype which satisfies these conditions: [https://invent.kde.org/kde-linux/kde-linux/-/issues/131](https://invent.kde.org/kde-linux/kde-linux/-/issues/131)\n\n**Expected results:** A prototype for a local backup solution that is robust\n\n**Knowledge Prerequisite:** QML and C++\n\n**Duration:** ~350 hours\n\n**Difficulty:** Difficult\n\n**Mentor:** Harald Sitter et al. [https://matrix.to/#/#kde-linux:kde.org](https://matrix.to/#/#kde-linux:kde.org)\n\n### CVE/Security Tracker\n\n**Brief explanation:** Security is one of the core values that matters to people. When we install software, we should know if the version has known vulnerabilities and if we can update it to a version that have it fixed. This project aims to create a solution that will allow to track them: [https://invent.kde.org/kde-linux/kde-linux/-/issues/134](https://invent.kde.org/kde-linux/kde-linux/-/issues/134)\n\n**Expected results:** A system that can track security advisories. Ideally a web based solution.\n\n**Knowledge Prerequisite:** Any programming language\n\n**Duration:** ~350 hours\n\n**Difficulty:** Difficult\n\n**Mentor:** Harald Sitter et al. [https://matrix.to/#/#kde-linux:kde.org](https://matrix.to/#/#kde-linux:kde.org)\n\n### Recovery Infrastructure\n\n**Brief explanation:** When your computer crash or do not start, you'd like to recover as much as you can. The aim of the task is to create a tool that would allow to recover this data: [https://invent.kde.org/kde-linux/kde-linux/-/issues/135](https://invent.kde.org/kde-linux/kde-linux/-/issues/135)\n\n**Expected results:** A prototype of a system/application to help users and OEMs recover a broken system, or at least its data.\n\n**Knowledge Prerequisite:** QML and C++, possibly others\n\n**Duration:** ~350 hours\n\n**Difficulty:** Difficult\n\n**Mentor:** Harald Sitter et al. [https://matrix.to/#/#kde-linux:kde.org](https://matrix.to/#/#kde-linux:kde.org)\n\n### Replication Infrastructure\n\n**Brief explanation:** When you change computer, you may want to keep some data: installed applications, configuration files, personal data... The aim of the project is to create a tool that will allow to synchronise data between two machines: [https://invent.kde.org/kde-linux/kde-linux/-/issues/136](https://invent.kde.org/kde-linux/kde-linux/-/issues/136)\n\n**Expected results:** A prototype of a system/application to help users replicate (or move) from one system to another.\n\n**Knowledge Prerequisite:** QML and C++\n\n**Duration:** ~350 hours\n\n**Difficulty:** Difficult\n\n**Mentor:** Harald Sitter et al. [https://matrix.to/#/#kde-linux:kde.org](https://matrix.to/#/#kde-linux:kde.org)\n\n### Karton\n\n**Brief explanation:** KDE has developed its own [virtual machine application](https://invent.kde.org/arraybolt/karton). The aim of the project is to create a Kirigami graphical interface to the tool: [https://invent.kde.org/kde-linux/kde-linux/-/issues/133](https://invent.kde.org/kde-linux/kde-linux/-/issues/133)\n\n**Expected results:** A polished Kirigami-based virtual machine application that can replace virt-manager and virtualbox for most users.\n\n**Knowledge Prerequisite:** QML and C++\n\n**Duration:** ~350 hours\n\n**Difficulty:** Difficult\n\n**Mentor:** Harald Sitter et al. [https://matrix.to/#/#kde-linux:kde.org](https://matrix.to/#/#kde-linux:kde.org)\n\n### Automatic Testing\n\n**Brief explanation:** The goal of this project is to develop automated tests which will allow to detect regressions before pushing new features/tools to the user: [https://invent.kde.org/kde-linux/kde-linux/-/issues/79](https://invent.kde.org/kde-linux/kde-linux/-/issues/79).\n\n**Expected results:** Fully automated tests to detect regressions in KDE Linux\n\n**Knowledge Prerequisite:** Bash, Python, Perl\n\n**Duration:** ~350 hours\n\n**Difficulty:** Medium\n\n**Mentor:** Harald Sitter et al. [https://matrix.to/#/#kde-linux:kde.org](https://matrix.to/#/#kde-linux:kde.org)\n\n### Website\n\n**Brief explanation:** KDE Linux needs to have a website. There are already some websites in KDE done with Hugo. The aim of the task is to create a website for KDE Linux, including multiple infos such as Downloads links, Community links... More details can be found at [https://invent.kde.org/kde-linux/kde-linux/-/issues/92](https://invent.kde.org/kde-linux/kde-linux/-/issues/92)\n\n**Expected results:** A swanky website for KDE Linux using Hugo\n\n**Knowledge Prerequisite:** Web development, ideally using Hugo\n\n**Duration:** ~90 hours\n\n**Difficulty:** Easy\n\n**Mentor:** Harald Sitter et al. [https://matrix.to/#/#kde-linux:kde.org](https://matrix.to/#/#kde-linux:kde.org)\n\nKDE Games\n---------\n\n### Mankala: Bao La Kiswahili\n\n**Brief explanation:** Add Bao La Kiswahili and create a computerized opponent with various levels of difficulty for it. Explore the use of machine learning algorithms in creating a computerized opponent. Code can be found at [https://invent.kde.org/joaotgouveia/mankala](https://invent.kde.org/joaotgouveia/mankala).\n\n**Expected results:** An additional game in Mankala\n\n**Knowledge Prerequisite:** C++, Qt, QML\n\n**Duration:** ~175 hours\n\n**Difficulty:** Medium\n\n**Mentor:** Benson Muite, João Gouveia contact through [https://matrix.to/#/#mancala:kde.org](https://matrix.to/#/#mancala:kde.org)\n\nMisc\n----\n\n### Project: Add more fuzzed libraries to oss-fuzz\n\n**Brief explanation:** oss-fuzz is a SAS for fuzzying code. We have a few libraries there (karchive, kimagefomats, kcodecs), but we should add more since we have quite some code that processes file formats.\n\n**Expected results:** As many projects/libraries as possible have been added to oss-fuzz\n\n**Knowledge Prerequisite:** docker/compiling\n\n**Duration:** ~350 hours\n\n**Difficulty:** Medium\n\n**Mentor:** Albert Astals Cid <aacid@kde.org\\>\n\nGCompris\n--------\n\n### Project: Enhancing GCompris Server with GUI Sub-Programs for Dataset Creation\n\n**Project Overview:** This project aims to enhance the GCompris server by integrating a set of GUI-based sub-programs specifically designed for teachers. These tools will facilitate the creation of new datasets for various educational applications.The applications targeted for dataset expansion include:\n\n   Grammar Analyses\n   Graduated Lines\n   Decimal Numbers\n   Share\n   Fractions Create\n\nBy implementing these sub-programs, educators will be able to customize learning materials more effectively to fit their pupils needs.\n\n**Resources Required:**\n\n   Developers with experience in Qt/QML, Gitlab.\n   Being able to compile GCompris on QT6 and use it.\n\n**Development resources:**\n\nThe server source code is available here : [https://invent.kde.org/education/gcompris/-/tree/work/server\\_qt6?ref\\_type=heads](https://invent.kde.org/education/gcompris/-/tree/work/server_qt6?ref_type=heads) The development guide is here: [https://invent.kde.org/education/gcompris/-/wikis/Developers-corner/Development-process](https://invent.kde.org/education/gcompris/-/wikis/Developers-corner/Development-process)\n\n**Duration:** ~175 hours\n\n**Difficulty:** Middle\n\n**Mentor:** Emmanuel Charruau, Johnny Jazeix (contact on Matrix KDE Webchat)\n\nKdenlive\n--------\n\n### Project: Improving Kdenlive timeline markers\n\n**Brief explanation:** Kdenlive already allows the user to add markers to the timeline and inside clips. The idea is to update the current code to add a duration attribute to the markers. With this change, markers will be able to represent a time range with a start and an end time, which will unlock some nice new features. See [this issue](https://invent.kde.org/multimedia/kdenlive/-/issues/614) for more technical details.\n\n**Expected results:** An nice display of the time range markers in the timeline and monitors. The marker's time range should also be connected to existing features and extend them, like render a marker's range, or improved searching.\n\n**Knowledge Prerequisite:** C++, Qt, will also involve some Qml\n\n**Duration:** ~175 hours\n\n**Difficulty:** Medium\n\n**Mentor:** Jean-Baptiste Mardelle ([https://matrix.to/#/@j-b-m:matrix.org](https://matrix.to/#/@j-b-m:matrix.org))\n\nMarknote\n--------\n\n### Project: Implement block editor\n\n**Brief explanation:** Implement a basic block editor where each elements from markdown is transformed into a block which can be drag-and-dropped.\n\nInspiration can be taken from [https://rubymamistvalove.com/block-editor](https://rubymamistvalove.com/block-editor)\n\n**Expected results:** A nice rich text editor which can then be also reused in other apps like Merkuro Mail.\n\n**Knowledge Prerequisite:** C++, Qt, will also involve some Qml\n\n**Duration:** ~350 hours\n\n**Difficulty:** Medium\n\n**Mentor:** Carl Schwan ([https://matrix.to/#/#marknote:kde.org](https://matrix.to/#/#marknote:kde.org))\n"}