{"name":"Keploy","description":"Unit, API test generation agent using AI & EBPF","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/keploy","ideas_url":"https://github.com/keploy/gsoc/tree/main/2025","logo":"https://summerofcode.withgoogle.com/media/org/keploy/txoec8qr8fyegtmv-360.png","technologies":["python","golang","node","ai","MERN"],"topics":["AI/ML","API Testing","Dev Tool","Functional Testing","AI Testing Agent"],"projects":[{"project_name":"AI-Powered Open-Source Code Review Agent","summary":"Develop an AI-driven, open-source code review agent that integrates with version control systems to provide automated feedback on coding practices.","difficulty":"Hard"},{"project_name":"OSS Code Indexer for Efficient Retrieval","summary":"Create a coding indexing system that enhances code search and retrieval efficiency, integrating open-source unit test generation with advanced indexing techniques.","difficulty":"Medium"},{"project_name":"TestSuite Idempotency Checker","summary":"Analyze test cases to ensure idempotency, identifying noisy parameters that could lead to unreliable testing outcomes.","difficulty":"Medium"},{"project_name":"Improve Keploy Open-Source Playground console","summary":"Enhance the Keploy Playground interface to improve usability, support more programming languages, and provide better onboarding for new users.","difficulty":"Medium"},{"project_name":"API contract matching - Adding Features and Platform support","summary":"Augment contract testing capabilities by enhancing schema management and introducing a provider-driven testing model.","difficulty":"Medium"},{"project_name":"App Dashboard with Metrics and Chart","summary":"Develop an interactive dashboard for visualizing metrics related to code merges and test activities, with a focus on extensibility and dynamic updates.","difficulty":"Medium"}],"jina_response":"Title: gsoc/2025 at main · keploy/gsoc\n\nURL Source: https://github.com/keploy/gsoc/tree/main/2025\n\nMarkdown Content:\nGoogle Summer of Code'25 Participant Guide\n------------------------------------------\n\n[](https://github.com/keploy/gsoc/tree/main/2025#google-summer-of-code25-participant-guide)\n\n**Communication**\n-----------------\n\n[](https://github.com/keploy/gsoc/tree/main/2025#communication)\n\nWelcome to the Keploy GSoC'25 projects page. We encourage candidates to come up with their own project idea. Join our [Slack Channel](https://keploy.slack.com/join/shared_invite/zt-2poflru6f-_VAuvQfCBT8fDWv1WwSbkw) and stay tuned for updates.\n\nUse our **[Template](https://docs.google.com/document/d/1yRWf5pXuUij-UwlXB9knDKqk9VYvV5GrNf865p77Y1U/edit?usp=sharing)** for the proposal. We recommend the use of google docs for the proposal.\n\n**General suggestions and warnings**\n------------------------------------\n\n[](https://github.com/keploy/gsoc/tree/main/2025#general-suggestions-and-warnings)\n\n* * *\n\n*   **Project ideas describe the goals we want to achieve but may miss details that have to be defined during the project**: we expect students to do their own research, propose solutions and be ready to deal with uncertainty and solve challenges that will come up during the project\n    \n*   **Code and prototypes are preferred over detailed documents and unreliable estimates**: rather than using your time to write a very long application document, we suggest to invest in writing a prototype (which means the code may be thrown out entirely) which will help you understand the challenges of the project you want to work on; your application should refer to the prototype or other Github contributions you made to Keploy that show you have the capability to succeed in the project idea you are applying for.\n    \n*   **Students who have either shown to have or have shown to be fast learners for the required hard and soft skills by contributing to Keploy have a lot more chances of being accepted**: in order to get started contributing refer to the :doc:`Keploy Contributing Guidelines <keploy/keploy/contributing.md>`\n    \n*   **Get trained in the projects you want to apply for**: once applicants have completed some basic training by :doc:`contributing to Keploy <keploy/keploy/contributing.md>` we highly suggest to start working on some aspects of the project they are interested in applying: all projects listed this year are improvements of existing modules so these modules already have a list of open issues which can be solved as part of your advanced training. It will also be possible to complete some of the tasks listed in the project idea right now before GSoC starts. We will list some easy tasks in the project idea for this purpose.\n    \n\n**Projects List**\n-----------------\n\n[](https://github.com/keploy/gsoc/tree/main/2025#projects-list)\n\n### 1\\. AI-Powered Open-Source Code Review Agent (Using any CI/CD workflow)\n\n[](https://github.com/keploy/gsoc/tree/main/2025#1-ai-powered-open-source-code-review-agent-using-any-cicd-workflow)\n\n**Mentors**: Hermione, Gourav, Yash, Shubham\n\nDevelop an AI-driven, open-source code review agent that integrates with version control platforms and CI/CD pipelines to provide automated feedback on coding style, security vulnerabilities, and best practices. Use any CI/CD runners and open-source static analysis tools to improve the developer experience in open-source projects.\n\n**Description**: The objective of this project is to enhance the Keploy Playground by introducing new functionalities, improving user experience, and expanding its capabilities. This includes:\n\n1.  **Expanding Language Support:** Adding robust support for multiple programming languages such as Java and Python.\n2.  **Integrating Test & Mock Support:** Providing comprehensive functionalities to generate tests and simulate mocks seamlessly.\n3.  **Improving User Onboarding:** Redesigning the user experience, especially the onboarding process, to ensure a smooth introduction to Keploy’s capabilities.\n\n**Tasks:**\n\n1.  Explore the architecture and workflows of various open-source code review systems to understand their impact and areas for improvement and build a matrix comparing them based on features such as accuracy, language support, ease of integration, and performance\n2.  Build a modular webhook-based system to allow easy integration with various platforms.\n3.  Integrate OWASP Dependency-Check or Google’s Open Source Insights (deps.dev API) to detect vulnerable dependencies.\n4.  Export review results in JSON, Markdown, or PDF formats for offline analysis.\n\n**Skills Required:**\n\n*   CI/CD workflows & automation\n*   REST APIs & Webhooks\n*   Golang\n*   JavaScript/TypeScript, Node.js\n*   Static Code Analysis Tools (ESLint, GolangCI-Lint)\n*   AI/ML for automated code review - Vertex AI (Optional but beneficial)\n\n**Refs**\n\n1.  [ESLint: Pluggable JavaScript Linter](https://pactflow.io/blog/what-is-contract-testing/)\n2.  [GolangCI-Lint](https://golangci-lint.run/)\n\n**Time Estimate** : 350 hours\n\n**Difficulty** : Hard\n\n### 2\\. OSS Code Indexer for Efficient Retrieval\n\n[](https://github.com/keploy/gsoc/tree/main/2025#2-oss-code-indexer-for-efficient-retrieval)\n\n**Mentors**: Shivam, Charan, Sarthak, Shubham Jain\n\n**Goals & Ideas** Develop an efficient code indexing system that enables fast and scalable code search and retrieval. The system will integrate open source unit test geneartion with a Retrieval-Augmented Generation (RAG) indexer, utilizing vector and graph databases to improve query efficiency and relevance. The goal is to create a robust and scalable solution that can handle large open-source codebases and enable better code discovery, navigation, and reuse.\n\n*   Integrate the existing RAG bot with a vector database.\n*   Explore dynamic indexing techniques to improve efficiency.\n*   Research methodologies for leveraging GRAGs to enhance retrieval.\n*   Test OSS UTG with OSS Repos.\n*   Integrate Gemini with UTG.\n\n**Skills Required**\n\n1.  Experience with RAG (Retrieval Augmented Generation) architectures.\n2.  Knowledge of vector databases (e.g., Pinecone, FAISS, Weaviate, etc.).\n3.  Understanding of graph databases and their integration with AI systems.\n4.  Familiarity with indexing strategies for efficient code retrieval.\n5.  Proficiency in Python/Golang for backend development.\n\n**Refs**\n\n1.  Research papers on RAG and GRAG models.\n2.  Documentation for vector and graph databases.\n\n**Tasks**\n\n1.  Integrate the existing RAG bot with a [Milvus](https://github.com/milvus-io/milvus).\n\n*   Modify the existing RAG bot to store code snippets as vector embeddings in Milvus.\n\n2.  Explore dynamic indexing techniques to improve efficiency.\n\n*   Research and compare different indexing techniques (HNSW, IVF, PQ, Flat Index) for faster retrieval.\n\n3.  Research methodologies for leveraging GRAGs to enhance retrieval.\n\n*   Implement a prototype that combines vector search with graph-based retrieval to improve accuracy.\n\n4.  Test Open-Source [UTG (Unit Test Generation)](https://keploy.io/docs/running-keploy/unit-test-generator/) with OSS Repositories.\n\n*   Run Keploy’s OSS Unit Test Generator (UTG) on real-world repositories and suggest optimizations for the UTG model based on results.\n\n5.  Use [Gemini AI](https://gemini.google.com/app) (Google’s LLM) to generate better test cases from indexed OSS codebases.\n\n**Time Estimate** : 350 hours\n\n**Difficulty** : Medium\n\n### 3\\. TestSuite Idempotency Checker\n\n[](https://github.com/keploy/gsoc/tree/main/2025#3-testsuite-idempotency-checker)\n\n**Mentors**: Animesh, Sarthak Shyngle, Neha Gupta\n\n**Description**: Ensuring idempotency in test suites is crucial for reliable and repeatable testing. This project focuses on analyzing test cases to identify operations that should be idempotent, it will help in detecting noisy parameters and inconsistencies which may lead to flaky tests.\n\n**Goals & Ideas**\n\n1.  Identify Noisy Parameters – Automatically detect parameters in test cases that cause unnecessary variations, leading to non-idempotent behavior.\n2.  Validate CRUD Operations – Ensure that CRUD requests in test cases conform to idempotency rules by verifying their consistency across multiple executions.\n3.  HTML-based Test Verification – Check test cases that interact with HTML responses to ensure stable outputs and prevent unintended failures.\n4.  Automated Idempotency Reporting – Develop a reporting mechanism that flags test cases violating idempotency, with insights into potential fixes.\n\n**Tasks**\n\n1.  Implement Idempotency Check for GET Requests in Postman\n2.  Denoise the un-expected Parameters (timestamp, headers, token's, change in body response) from Keploy Testcases\n3.  Create a basic report template using Allure or Extent Reports.\n4.  Handling noisy parameters of big payloads(10k or more lines) in the cli-diff viewer.\n\n**Skills Required**\n\n1.  Scripting Languages such as Python, Bash.\n2.  Golang\n3.  Logical Reasoning + DSA\n\n**Ref**\n\n1.  [idempotency and safety in REST APIs](https://www.linkedin.com/advice/0/how-do-you-test-monitor-idempotency)\n2.  [How Idempotent REST APIs Boost Reliability and Error Handling](https://keploy.io/docs/concepts/reference/glossary/idempotency/)\n3.  [Idempotent Message Validator](https://docs.mulesoft.com/mule-runtime/latest/idempotent-message-validator)\n\n**Time Estimate** : 350 hours\n\n**Difficulty** : Medium\n\n### 4\\. Improve Keploy Open-Source Playground console\n\n[](https://github.com/keploy/gsoc/tree/main/2025#4-improve-keploy-open-source-playground-console)\n\n**Mentors**: Aditya Sharma, Shivam Jha, Tvisha Raji, Manas, Neha Gupta\n\n**Description**\n\nThe goal of this project is to elevate the open-source Keploy Playground for the contributors to understand record-replay. Few of the features requests b community includes:\n\n1.  **Expanding Language Support:** Adding support for more languages such as Java, Python, Node.\n2.  **Integrating Test & Mock Support:** Adding support to fetch generated tests from the keploy server and simulated mocks which can be editable on the playground.\n3.  **Improving User Onboarding:** Currently the playground lags if the payload is big, or in case of AI/ML genrated tests, the idea is to improve performance of the react console so that other community members can experience it well.\n\n**Goals & Ideas**\n\n1.  **Currently Loading Structure Loading is Fragile:** Improve the user experience by fixing the performance issues and handling edge cases.\n2.  **Interactive Demo Environment:** Build a dynamic playground console where users can interact with live demos, generate tests, and see real-time results.\n3.  **Automated Test Generation from URL Input**: Allow users to provide a URL, then automatically scrape the frontend to generate a sitemap, identify API calls, and create tests based on the discovered endpoints using ATG\n4.  **Multi-Language Testing Support:** Implement a flexible backend architecture that supports testing across multiple languages, making Keploy a versatile tool for a diverse range of applications.\n\n**Skills Required**\n\n1.  Next.js, React, typescript\n2.  API call handling\n3.  Golang, Java, Python\n4.  \\[optional\\] AI/ML\n\n**Refs**\n\n1.  \\[source code\\] - [https://github.com/keploy/website/tree/main/app/(default)](https://github.com/keploy/website/tree/main/app/(default))\n2.  [Meshery Playground](https://play.meshery.io/)\n\n**Time Estimate** : 350 hours\n\n**Difficulty** : Medium\n\n### 5\\. API contract matching - Adding Features and Platform support\n\n[](https://github.com/keploy/gsoc/tree/main/2025#5-api-contract-matching---adding-features-and-platform-support)\n\n**Mentors**: Gourav Kumar, Charan Kamarapu, Ahmed Lotfy, Shubham Jain\n\n**Description**: The goal of this project is to enhance the functionality of contract testing by adding new features and improving existing capabilities. This includes better schema storage, consolidation, and validation, along with exploring a provider-driven approach as a future enhancement.\n\n**Goals & Ideas**\n\n1.  **Schema Storage Enhancement**: Implement local storage support for schemas, functioning as a mock public registry (e.g., S3).\n2.  **Unified Schema Management**: Merge individual test/mock schemas into a comprehensive single schema for each service, consolidating all APIs\n3.  **Advanced Schema Comparison**: Design and improve schema validation between interconnected services to ensure consistency.\n4.  **Provider-Driven Architecture**: Develop and integrate a provider-driven contract testing model into Keploy, allowing service providers to define and manage contracts efficiently.\n\n**Skills Required**\n\n1.  Golang\n2.  REST APIs\n\n**Refs**\n\n1.  [What is Contract Testing?](https://pactflow.io/blog/what-is-contract-testing/)\n2.  [Keploy Documentation](https://keploy.io/docs/)\n3.  [What is a REST API? - IBM](https://www.ibm.com/topics/rest-apis#:~:text=the%20next%20step-,What%20is%20a%20REST%20API%3F,representational%20state%20transfer%20architectural%20style.)\n4.  [A Tour of Go](https://go.dev/tour/)\n\n**Tasks**\n\n1.  [Implement Microservices Architecture with HTTP APIs & Validate Keploy Contract Testing](https://github.com/keploy/keploy/issues/2541)\n2.  [Identify and Resolve Issues in Keploy Contract Testing Implementation](https://github.com/keploy/keploy/issues/2543)\n\n**Time Estimate** : 350 hours\n\n**Difficulty** : medium\n\n### 6\\. App Dashboard with Metrics and Chart\n\n[](https://github.com/keploy/gsoc/tree/main/2025#6--app-dashboard-with-metrics-and-chart)\n\n**Mentors**: Manas Manohar, Tvisha Raji, Hermione Dadheech, Neha Gupta\n\n**Description**\n\n1.  The objective of this project is to create a console that provides interactive visualizations, metrics, and insights for code merges and test activities.\n2.  The console should support dynamic updates and be powered by a Go web server that processes and serves data.\n3.  It should be structured for easy extensibility, making it straightforward to add new metrics or charts in the future.\n\n**Goals & Ideas**\n\n1.  Dynamic Dashboard: Develop a frontend that aggregates and displays real-time test reports using visual elements such as graphs and charts\n2.  Template-Based PR Insights: Allow users to create and utilize templates for code analysis, offering customizable views for different teams and workflows.\n3.  Scalable & Modular Design: Ensure the system’s architecture is modular and can accommodate new metrics, charts, or data sources with minimal effort.\n\n**Tasks:**\n\n1.  Build a web app that tracks multiple repositories and user activities, offering a customizable feed of test outcomes and analytics.\n2.  Research techniques for building modular dashboards, data processing, and integration with various version control or repository hosting services.\n\n**Skills Required**\n\n1.  Next.js, Charting Libraries(e.g., Chart.js, Recharts, D3.js)\n2.  Golang\n3.  MongoDB\n\n**Refs**\n\n1.  Grafana – For inspiration on dashboard design and real-time data visualization.\n2.  Golang Documentation – For best practices in building scalable Go services.\n\n**Time Estimate** : 350 Hours\n\n**Difficulty** : Medium\n\n* * *\n\nTask List : Good First Issue for GSoC aspirants\n-----------------------------------------------\n\n[](https://github.com/keploy/gsoc/tree/main/2025#task-list--good-first-issue-for-gsoc-aspirants)\n\n| Projects | Good First Issue |\n| --- | --- |\n| update website themes | [keploy/keploy#2536](https://github.com/keploy/keploy/issues/2536)  \n[keploy/keploy#2535](https://github.com/keploy/keploy/issues/2535)  \n[keploy/keploy#2534](https://github.com/keploy/keploy/issues/2534) |\n| Improve keploy console | [keploy/keploy#2551](https://github.com/keploy/keploy/issues/2551)  \n[keploy/keploy#2552](https://github.com/keploy/keploy/issues/2552) |\n| Integrate RAG Bot with a Vector Database | [keploy/keploy#2533](https://github.com/keploy/keploy/issues/2533) |\n| PR Analysis with Linting & Static Analysis in testGPT | [keploy/keploy#2532](https://github.com/keploy/keploy/issues/2532) |\n| Checking of HTML-Based Test Validation | [keploy/keploy#2528](https://github.com/keploy/keploy/issues/2528) |\n| a GitHub App to Trigger GitHub Actions | [keploy/keploy#2531](https://github.com/keploy/keploy/issues/2531) |\n| Denoise Unexpected Parameters in Keploy Testcases | [keploy/keploy#2527](https://github.com/keploy/keploy/issues/2527) |\n| Implement Idempotency Check for GET Requests | [keploy/keploy#2526](https://github.com/keploy/keploy/issues/2526) |\n| SON Diff viewer re-alignment to top | [keploy/keploy#2524](https://github.com/keploy/keploy/issues/2524) |\n"}