{"name":"Kotlin Foundation","description":"Advance the Kotlin programming language","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/kotlin-foundation","ideas_url":"https://kotlinlang.org/docs/gsoc-2025.html","logo":"https://summerofcode.withgoogle.com/media/org/kotlin-foundation/2wyghqyy8nvvl4cq-360.png","technologies":["gradle","kotlin","jvm","Parsers & Compilers","Multiplatform"],"topics":["compilers","programming languages","software development","libraries","Programming & Build Tools"],"projects":[{"project_name":"Build Server Protocol: add Kotlin support","summary":"Expand Kotlin support across various build systems and integrate with JetBrains IDE and non-JetBrains IDEs for better Kotlin information retrieval.","difficulty":"Hard, 350 hrs"},{"project_name":"Support Android and iOS targets in Kotlin Multiplatform for an existing Google service","summary":"Create an open-source Kotlin Multiplatform library that integrates an existing Google service on Android and iOS with a focus on best practices.","difficulty":"Medium, 175 hrs"},{"project_name":"Add Kotlin Multiplatform support in Bazel","summary":"Improve Bazel's support for Kotlin Multiplatform, focusing on dependency resolution and compatibility with existing rules for cross-platform builds.","difficulty":"Hard, 350 hrs"},{"project_name":"Kotlin Language Server (LSP)","summary":"Develop a community-driven Kotlin Language Server to enhance code intelligence features across different IDEs and editors.","difficulty":"Hard, 350 hrs"},{"project_name":"Maven Central publishing plugin for Gradle with new APIs","summary":"Develop a Gradle plugin compatible with the new Maven Central APIs to facilitate library publication processes for developers.","difficulty":"Medium, 175 hrs"},{"project_name":"Improving Configuration Cache and lock contention in key Gradle plugins","summary":"Enhance Gradle's performance through improved lock management and configuration caching, especially in key Kotlin and Java plugins.","difficulty":"Easy to Hard, 90 hrs to 350 hrs"},{"project_name":"Gradle convention plugin for developing Jenkins plugins","summary":"Revise the Gradle JPI plugin for Jenkins to ensure compliance with best practices and enhance developer workflow for Jenkins plugin development.","difficulty":"Easy to Hard, 90 hrs to 350 hrs"},{"project_name":"Kotlin DSL and Declarative Gradle documentation samples test framework","summary":"Create a framework for testing Kotlin DSL samples in Gradle to ensure they function correctly across versions.","difficulty":"Easy to Medium, 90 hrs to 175 hrs"},{"project_name":"IntelliJ Platform Gradle Plugin – Gradle Reporting and Parallel Verifications","summary":"Introduce enhanced reporting and parallel verification capabilities in the IntelliJ Platform Gradle Plugin to optimize plugin development workflows.","difficulty":"Medium, 175 hrs"},{"project_name":"Add More Kotlin OpenRewrite Recipes","summary":"Develop new OpenRewrite recipes specifically for automating Kotlin code migrations and refactorings.","difficulty":"Medium, 175 hrs"},{"project_name":"Add BOM Support to Bazel `rules_jvm_external`","summary":"Integrate BOM support into Bazel's dependency management to simplify version control for external Java dependencies.","difficulty":"Hard, 350 hrs"},{"project_name":"Clean and actionable reporting for Gradle code quality plugins for Kotlin","summary":"Integrate the new Problems API with Kotlin code quality plugins to improve error reporting and enhance the developer experience.","difficulty":"Easy to Medium, 90 hrs to 175 hrs"}],"jina_response":"Title: Google Summer of Code with Kotlin 2025 | Kotlin\n\nURL Source: https://kotlinlang.org/docs/gsoc-2025.html\n\nMarkdown Content:\nThis article contains the [list of project ideas](https://kotlinlang.org/docs/gsoc-2025.html#project-ideas) for Google Summer of Code with Kotlin 2025, and [contributor guidelines](https://kotlinlang.org/docs/gsoc-2025.html#kotlin-contributor-guidelines-for-google-summer-of-code-gsoc)\n\nKotlin contributor guidelines for Google Summer of Code (GSoC)\n--------------------------------------------------------------\n\n### Getting started\n\n1.  Check out the [GSoC FAQ](https://developers.google.com/open-source/gsoc/faq) and the [program announcement](https://summerofcode.withgoogle.com/).\n    \n2.  Familiarize yourself with the Kotlin language:\n    \n    *   The official [Kotlin website](https://kotlinlang.org/) is a great place to start.\n        \n    *   Read the official [documentation](https://kotlinlang.org/docs/getting-started.html) to get a better understanding of the language.\n        \n    *   Take a look at the Kotlin courses on [JetBrains Academy](https://lp.jetbrains.com/academy/learn-kotlin/) or the Android team's [Training options](https://developer.android.com/courses/).\n        \n    *   Follow the [Kotlin X](https://twitter.com/kotlin) or [Kotlin Bluesky](https://bsky.app/profile/kotlinlang.org) accounts to stay up to date on the latest news and developments.\n        \n    *   Check out the [Kotlin YouTube channel](https://www.youtube.com/@Kotlin) for tutorials, tips, and the latest updates.\n        \n3.  Get to know the Kotlin open source community:\n    \n    *   Explore the general [Kotlin contribution guidelines](https://kotlinlang.org/docs/contribute.html).\n        \n    *   [Join the Kotlin Slack channel](https://surveys.jetbrains.com/s3/kotlin-slack-sign-up) to connect with other developers and get help with any questions you may have.\n        \n    *   [Join the #gsoc channel](https://slack-chats.kotlinlang.org/c/gsoc) to ask questions and get support from the GSoC team.\n        \n\n### How to apply\n\n1.  Check out the [project ideas](https://kotlinlang.org/docs/gsoc-2025.html#project-ideas) and select the one you would like to work on.\n    \n2.  If you are not familiar with Kotlin, [read the introductory info on the Kotlin website](https://kotlinlang.org/docs/getting-started.html).\n    \n3.  Refer to the [GSoC contributor guidelines](https://google.github.io/gsocguides/student/writing-a-proposal).\n    \n4.  Apply via the [GSoC website](https://summerofcode.withgoogle.com/).\n    \n    *   We suggest that you write a working code sample relevant to the proposed project. You can also show us any code sample that you are particularly proud of.\n        \n    *   Describe why you are interested in Kotlin and your experience with it.\n        \n    *   If you participate in open source projects, please reference your contribution history.\n        \n    *   If you have a GitHub, Twitter account, blog, or portfolio of technical or scientific publications, please reference them as well.\n        \n    *   Disclose any conflicts with the GSoC timeline due to other commitments, such as exams and vacations.\n        \n\nThank you! We look forward to reading your applications!\n\nProject ideas\n-------------\n\n### Build Server Protocol: add Kotlin support \\[Hard, 350 hrs\\]\n\nThe Kotlin team wants to expand official Kotlin support not only for Gradle and Maven build systems, but any other build system as well and support them natively in JetBrains IDE with minimal effort. On the other hand, we also want to provide basic Kotlin support in non-JetBrains IDE – one part of such support is to be able to get Kotlin specific information from any build system supporting Kotlin.\n\nThe solution to these requirements could be a [Build Server Protocol](https://build-server-protocol.github.io/) (BSP) that provides an abstraction layer between build system and IDE.\n\nThe goal of this project would be implementing a prototype which uses the BSP protocol to get all required for IDEA information from a user project to be able to work with Kotlin code in the project. To limit the scope of this prototype – user project will be using Gradle to build itself.\n\nSkills required (preferred)\n\n*   Kotlin\n    \n*   Understanding how to write Gradle plugins\n    \n*   Bonus: understanding how to write IntelliJ IDEA plugins\n    \n\nPossible mentors\n\nYahor Berdnikau, Bálint Hegyi, and Reinhold Degenfellner\n\nTasks for applicants\n\n*   Task #1. Why are you interested in this project?\n    \n*   Task #2. Practice assignment: create a Gradle plugin which exposes a specific task. This task should on the presence of Kotlin Gradle Plugin get all the Kotlin sources structure and output to the file. Having tests is a bonus\n    \n\n### Support Android and iOS targets in Kotlin Multiplatform for an existing Google service \\[Medium, 175 hrs\\]\n\nThis project aims to create an open-source Kotlin Multiplatform (KMP) library that supports an existing Google service on at least Android and iOS. This project will showcase best practices in creating KMP libraries for existing services, with a focus on appropriate production implementation (for example, proper API key management, allowing user-managed API keys, client throttling).\n\nExpected outcomes\n\n*   A new Kotlin Multiplatform library with support for an existing Google service\n    \n*   Sample code and documentation\n    \n\nSkills required (preferred)\n\n*   Kotlin\n    \n*   Kotlin Multiplatform\n    \n*   Mobile development (Android and iOS)\n    \n\nPossible mentor\n\nMatt Dyor, and the Google team\n\n### Add Kotlin Multiplatform support in Bazel \\[Hard, 350 hrs\\]\n\nBazel's support for Kotlin is evolving, but proper Kotlin Multiplatform (KMP) integration remains a challenge. This project aims to improve [Bazel's KMP support](https://github.com/bazelbuild/rules_kotlin/issues/567) by addressing dependency resolution issues, enhancing `rules_kotlin` and `rules_jvm_external` compatibility, and enabling cross-platform builds.\n\nKey improvements will focus on handling platform-specific dependencies (expect/actual mechanisms), improving Gradle metadata support, and ensuring a smoother developer experience for KMP in Bazel.\n\nExpected outcomes\n\n*   Enhanced dependency resolution for Kotlin Multiplatform in Bazel\n    \n*   Improved integration with `rules_kotlin` and `rules_jvm_external`\n    \n*   A working KMP build setup in Bazel for seamless multiplatform development\n    \n\nSkills required (preferred)\n\n*   Kotlin Multiplatform and Gradle\n    \n*   Bazel build system\n    \n*   Dependency resolution strategies\n    \n\nPossible mentor\n\nShauvik Roy Choudhary, and the Uber team\n\n### Kotlin Language Server (LSP) \\[Hard, 350 hrs\\]\n\nThe Language Server Protocol (LSP) is a widely adopted standard that enables code intelligence features such as autocompletion, go-to definition, and refactoring across different editors and IDEs. There is currently no official Kotlin LSP server. Uber has developed an internal Kotlin LSP, but a publicly maintained, community-driven implementation can support broader use cases, including code migration, AI-powered code assistance, and seamless integration into various development environments.\n\nThis project aims to develop a Kotlin LSP implementation, ensuring compatibility with key LSP features and broadening Kotlin's accessibility across development environments.\n\nExpected outcomes\n\nDevelop a Kotlin LSP implementation\n\nSkills required (preferred)\n\n*   Kotlin\n    \n*   Language Server Protocol (LSP)\n    \n*   Plugin or extension development for IDEs\n    \n\nPossible mentor\n\nShauvik Roy Choudhary, and the Uber team\n\n### Maven Central publishing plugin for Gradle with new APIs \\[Medium, 175 hrs\\]\n\n[Maven Central](https://central.sonatype.com/) is one of the most popular Maven repositories for publishing JVM-focused libraries and projects. It is actively used by Apache Maven or Gradle-based open-source projects, and based on Sonatype Nexus v2, pending migration to a newer version. There is ongoing migration of open source projects to a new Maven Central Instance, which has a very different API implementation and needs special support in the build tool plugins. Developing a Gradle plugin that is compatible with the new Maven Central publication APIs would help the library authors building with Gradle to have a smooth experience with the new process.\n\nCurrently, there are multiple implementations of Maven Central publishing plugins in Gradle, for example, the [Maven Publish Plugin](https://docs.gradle.org/current/userguide/publishing_maven.html) or the [New Maven Central Publishing](https://github.com/GradleUp/nmcp), which already tries to adopt the new APIs. A potential contributor, during the application or the community bonding phase, would need to review the implementations and suggest a plugin to be updated, or decide to build a new plugin or fork. The deliverables would include either a new version of an existing plugin for Maven Central publishing or a new plugin for Gradle. We anticipate the implementation to be in Kotlin or Java and to have proper test coverage and documentation. Additional deliverables may include Kotlin DSL extensions to simplify the use of the plugins and [Declarative Gradle](https://declarative.gradle.org/) extensions.\n\nExpected outcomes\n\n*   Updated Maven Central publishing plugin or a new plugin\n    \n\nSkills required (preferred)\n\n*   Kotlin\n    \n*   Gradle\n    \n*   Maven Repositories\n    \n\nPossible mentor\n\nOleg Nenashev, and the Gradle team\n\n### Improving Configuration Cache and lock contention in key Gradle plugins \\[Easy to Hard, 90 hrs to 350 hrs\\]\n\nGradle is working on [Isolated Projects](https://docs.gradle.org/current/userguide/isolated_projects.html) – a new feature that greatly extends the configuration cache to further improve performance, particularly the performance of Android Studio and IntelliJ IDEA sync. From the developer experience standpoint, it is one of the most expected features in Gradle.\n\nOne of the problems for Isolated projects is the lock contention in the Gradle core and plugins sometimes getting in the way of parallel execution. We would like to reduce the lock contention, especially in the key Gradle Build Tool plugins for Java, Kotlin, Android, and Kotlin Multiplatform ecosystems. Contributors are welcome to choose the deliverables, based on their interest and the desired project size.\n\nPotential deliverables include but not limited to:\n\n*   Embed the [Configuration Cache Report](https://github.com/gradle/configuration-cache-report) tool into the Gradle Profiler (or implement a GitHub Action for it)\n    \n*   Profile Gradle and a few popular Gradle plugins in various projects, with automation of the test suite on GHA\n    \n*   Determine potential areas and plugins where lock contention can be reduced, with or without Configuration Cache\n    \n*   While around, contribute to other areas of [Configuration Cache compatibility](https://github.com/gradle/gradle/issues/13490) in the target plugins\n    \n*   Implement some of the discovered improvements\n    \n\nExpected outcomes\n\nImplementing extensibility features in the Kotlin DSL for Gradle and improving support for common project integrations\n\nSkills required (preferred)\n\n*   Kotlin\n    \n*   Gradle\n    \n*   Java\n    \n*   Performance analysis\n    \n*   Profiling\n    \n\nPossible mentor\n\nOleg Nenashev, Laura Kassovic\n\n### Gradle convention plugin for developing Jenkins plugins \\[Easy to Hard, 90 hrs to 350 hrs\\]\n\nThere are more than 50 Jenkins plugins that are implemented with Gradle. There is a [Gradle JPI plugin](https://github.com/jenkinsci/gradle-jpi-plugin), but it is not fully compliant with Jenkins hosting requirements, and needs an update. In this project idea, the aim would be to recover the Gradle developer flow for Jenkins, reach feature parity with the Apache Maven flow ([Parent POM](https://github.com/jenkinsci/plugin-pom), [Plugin Compatibility Tester](https://github.com/jenkinsci/plugin-compat-tester), [Jenkins Bill of Materials](https://github.com/jenkinsci/bom), and others), and to improve the developer experience for those who develop Jenkins plugins with Gradle.\n\nContributors are welcome to choose the deliverables, based on their interest and the desired project size.\n\nPotential deliverables include but not limited to:\n\n*   Refreshing the Gradle JPI plugin and making it compliant with hosting best practices\n    \n*   Migrating the Gradle JPI plugin codebase from Groovy to Kotlin\n    \n*   Implementing a new convention plugin for Jenkins Plugins that would cover the main features of Jenkins plugin Parent POM, with Kotlin and Kotlin DSL. This would include not just building the plugin, but also testing and static analysis according to Jenkins' best practices\n    \n*   Adopting the refreshed plugin and/or the convention plugin in the most popular Gradle plugin, including the Gradle Plugin itself\n    \n*   Integrating Gradle Plugins into Plugin Compatibility Tester and Bill of Materials\n    \n*   Documenting the updated Gradle development flow for Jenkins plugins\n    \n\nExpected outcomes\n\nUpdated Gradle JPI Plugin AND/OR new convention plugin for Jenkins, published on Jenkins Update Center and Gradle Plugin Portal\n\nSkills required (preferred)\n\n*   Kotlin DSL\n    \n*   Kotlin\n    \n*   Gradle\n    \n*   Jenkins\n    \n*   Java\n    \n\nPossible mentor\n\nOleg Nenashev, Stefan Wolf\n\n### Kotlin DSL and Declarative Gradle documentation samples test framework \\[Easy to Medium, 90 hrs to 175 hrs\\]\n\nMany projects, including Gradle, have a lot of Kotlin DSL samples and code snippets (see the Gradle Docs for examples). Testing them against multiple versions poses certain challenges because the snippets often represent incomplete code for the sake of brevity. We would like to build a test framework that simplifies the verification of those samples within a unit test framework (Kotest or JUnit 5) on GitHub Actions or Teamcity. Later we would be interested in doing the same for [Declarative Gradle](https://declarative.gradle.org/) samples.\n\nExpected outcomes\n\nImplementing extensibility features in the Kotlin DSL for Gradle and improving support for common project integrations\n\nSkills required (preferred)\n\n*   Kotlin\n    \n*   Gradle\n    \n*   Java\n    \n*   Static analysis\n    \n\nPossible mentor\n\nOleg Nenashev, Laura Kassovic\n\n### IntelliJ Platform Gradle Plugin – Gradle Reporting and Parallel Verifications \\[Medium, 175 hrs\\]\n\nThe [IntelliJ Platform Gradle Plugin](https://github.com/JetBrains/intellij-platform-gradle-plugin), a plugin for the Gradle build system, simplifies configuring your environment for building, testing, verifying, and publishing plugins for IntelliJ-based IDEs. The plugin manages the build, test, and verification steps while keeping up with the constant changes introduced in the IntelliJ Platform. The IntelliJ Platform Gradle Plugin is used by JetBrains, third-party developers, and external companies to integrate their workflows with JetBrains tools.\n\nExpected outcomes\n\n*   Introduce Gradle Reporting to provide detailed, configurable verification task reports.\n    \n*   Utilize Gradle Worker API to enable parallel execution of the verifyPlugin task against multiple IntelliJ Platform versions, reducing the task execution time.\n    \n*   Explore additional Gradle enhancements to further improve plugin development workflows.\n    \n\nSkills required (preferred)\n\n*   Kotlin\n    \n*   Gradle\n    \n*   IntelliJ Platform\n    \n\nPossible mentor\n\nJakub Chrzanowski, JetBrains\n\n### Add More Kotlin OpenRewrite Recipes \\[Medium, 175 hrs\\]\n\nOpenRewrite is a powerful framework for automating code migrations and refactorings in a structured manner. While OpenRewrite has strong support for Java, the Kotlin ecosystem would benefit from a more comprehensive set of OpenRewrite recipes to help developers seamlessly migrate their codebases.\n\nExpected outcomes\n\n*   Development of new OpenRewrite recipes for Kotlin code migrations\n    \n\nSkills required (preferred)\n\n*   Kotlin\n    \n*   OpenRewrite framework\n    \n*   Java-to-Kotlin migration strategies\n    \n\nPossible mentor\n\nShauvik Roy Choudhary, and the Uber team\n\n### Add BOM Support to Bazel `rules_jvm_external` \\[Hard, 350 hrs\\]\n\nBazel's `rules_jvm_external` provides a structured way to declare external Java dependencies, but it currently lacks proper support for Bill of Materials (BOM) files. BOM files are widely used in Maven and Gradle to manage dependencies in a consistent manner without requiring developers to specify individual versions. This project aims to enhance `rules_jvm_external` by adding BOM support, allowing developers to use BOM-based dependency resolution within Bazel. The project may involve contributing to an existing open-source effort or implementing BOM support directly in `rules_jvm_external`, ensuring compatibility with widely used dependency management approaches.\n\nExpected outcomes\n\n*   Implementation of BOM support in Bazel `rules_jvm_external`\n    \n*   Improved dependency resolution and usability for Bazel users\n    \n*   Documentation and examples for using BOM support in Bazel\n    \n\nSkills required (preferred)\n\n*   Starlark (Bazel's scripting language)\n    \n*   Bazel build system\n    \n*   Dependency resolution strategies\n    \n\nPossible mentor\n\nShauvik Roy Choudhary, and the Uber team\n\n### Clean and actionable reporting for Gradle code quality plugins for Kotlin \\[Easy to Medium, 90 hrs to 175 hrs\\]\n\nGradle recently introduced a new [Problems API](https://docs.gradle.org/current/userguide/reporting_problems.html) that allows Gradle and third-party plugins to propagate issues and warnings in a unified way. This API provides clean and actionable error reporting and more insights into the console output, dedicated HTML reports, and connected observability tools. IDEs, such as IntelliJ IDEA or Android Studio, also have access to the details via Gradle's tool integration API, and can show warnings right in the code editorI. Several core features and plugins have already adopted the Problems API: Java compilation, dependency resolution errors, deprecation warnings, etc. We want the code quality plugins for Kotlin to adopt this API, too; it would greatly improve the developer experience for 100,000+ Kotlin developers using Gradle.\n\nIn this project, we invite contributors to choose a number of Kotlin code quality plugins, such as Ktlint, Detekt, Diktat, ArchUnit, or Checkstyle for Kotlin, and integrate them with Problems API. You can also work on integrating a similar analysis for Gradle builds defined with KotlinDSL.\n\nExpected outcomes\n\n*   Implement Problems API integration in the mentioned plugins\n    \n\nSkills required (preferred)\n\n*   Kotlin\n    \n*   Gradle\n    \n\nPossible mentors\n\nOleg Nenashev, Balint Hegyi, Reinhold Degenfellner\n"}