{"name":"Learning Equality","description":"Building equity in education to transform lives","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/learning-equality","ideas_url":"https://docs.google.com/document/d/e/2PACX-1vT49WKgbsAIUoJ0jJS8LTWWm7UTByM0Pw3qt0KgyU_BShB1oGtZBkrEWuannFsRMVvGd0QBytZt8blh/pub","logo":"https://summerofcode.withgoogle.com/media/org/learning-equality/iptmmzjiktknrg9p-360.png","technologies":["python","javascript","django","vue.js"],"topics":["education","distributed databases","offline","learning"],"projects":[{"project_name":"Create Robust Windows App","summary":"Develop a unified Windows application for Kolibri that operates independently of the Python installation on the host system, enhancing deployment and user experience.","difficulty":"Medium"},{"project_name":"Implement a prototype of a Rich Text Editor","summary":"Create a modern Rich Text Editor for Kolibri, enhancing content creation with new formatting options while ensuring compatibility with the existing editor.","difficulty":"Medium"},{"project_name":"Create a new user onboarding experience for Kolibri","summary":"Design and implement an onboarding experience within Kolibri to assist new users in navigating and understanding key features through pop-up tips.","difficulty":"Medium"},{"project_name":"HTML5 Article Renderer","summary":"Develop a renderer for HTML5 articles that overcomes the limitations of sandboxed applications, aiming for a responsive and accessible content presentation.","difficulty":"Medium"},{"project_name":"Easy sharing of community channels","summary":"Enhance the ease of sharing community-curated educational content in Kolibri, allowing users to create and discover public libraries more effectively.","difficulty":"Medium"}],"jina_response":"Title: Learning Equality: Google Summer of Code 2025 Ideas List\n\nURL Source: https://docs.google.com/document/d/e/2PACX-1vT49WKgbsAIUoJ0jJS8LTWWm7UTByM0Pw3qt0KgyU_BShB1oGtZBkrEWuannFsRMVvGd0QBytZt8blh/pub\n\nMarkdown Content:\n![Image 1: Google Summer of Code logo](https://lh7-rt.googleusercontent.com/docsz/AD_4nXeSsX2Mriw6I_hMEIeTOOHpY4x2bBD3ZEr78CS5WQlULu6ehhB_nUzv0ge60Tx4gCuEUr7kaQmsNUtgUP4my4xqIdeUj4FMZ_L9hxyT4OSPQQSUo-D9Zp8iflkgEex8Ww?key=eX-Je889U30Mr6ttf-332eNf)\n\n![Image 2: Learning Equality logo](https://lh7-rt.googleusercontent.com/docsz/AD_4nXf-Rr9t4E6egxYTxF3FuSu7Gk9z16c1LyOtSRQIjB43msjiEeZzGrLJFkCY04BTio3_J0CbrMlXI8kDMtgBAUlNhKR-i5Iir3v66WLLhP1WCIZNJd0txjZO76WN6fMeKr0?key=eX-Je889U30Mr6ttf-332eNf)\n\n[Learning Equality](https://www.google.com/url?q=https://learningequality.org/&sa=D&source=editors&ust=1740814485026556&usg=AOvVaw1rj2kPnmkRXXse9SUbvLG8) is an education technology nonprofit that develops and maintains [Kolibri](https://www.google.com/url?q=https://learningequality.org/kolibri/&sa=D&source=editors&ust=1740814485026760&usg=AOvVaw2ikTFGDNb8D8iFhIEKjx-c), an adaptable set of open solutions specially designed to support teaching and learning with technology but without the Internet for the half of the world that still lacks access to connectivity.\n\nKolibri is centered around an offline-first learning platform that runs on a variety of low-cost and legacy devices. It is complemented by a curricular tool, a library of open educational materials, and a toolkit of resources to support training and implementation. These tools are open and available in a variety of languages, to better support learners and educators globally.\n\nAs a community-driven nonprofit, Learning Equality works closely to co-design Kolibri with a core network of collaborators, including national NGOs, UN agencies, government, and corporate partners. We also adopt a needs-based approach, constantly gathering insights from our community to inform the development of our tools.\n\nThrough its do-it-yourself adoption model and strategic collaborations, Kolibri has reached learners and educators in more than 220 countries and territories since its launch in 2017.\n\nIf you are interested in knowing more about our GSoC project ideas, Kolibri or Learning Equality, send us an email to gsoc@learningequality.org, and join our #﻿gsoc-2025 Slack channel! We hope to see you soon!\n\nProject Ideas for GSoC 2025\n---------------------------\n\n[Create Robust Windows App](https://docs.google.com/document/d/e/2PACX-1vT49WKgbsAIUoJ0jJS8LTWWm7UTByM0Pw3qt0KgyU_BShB1oGtZBkrEWuannFsRMVvGd0QBytZt8blh/pub#h.hfz6c4bl8ifv)\n\n[Implement a prototype of a Rich Text Editor](https://docs.google.com/document/d/e/2PACX-1vT49WKgbsAIUoJ0jJS8LTWWm7UTByM0Pw3qt0KgyU_BShB1oGtZBkrEWuannFsRMVvGd0QBytZt8blh/pub#h.y0fvx4cvg7jv)\n\n[Create a new user onboarding experience for Kolibri](https://docs.google.com/document/d/e/2PACX-1vT49WKgbsAIUoJ0jJS8LTWWm7UTByM0Pw3qt0KgyU_BShB1oGtZBkrEWuannFsRMVvGd0QBytZt8blh/pub#h.x1f7pytd3oan)\n\n[HTML5 Article Renderer](https://docs.google.com/document/d/e/2PACX-1vT49WKgbsAIUoJ0jJS8LTWWm7UTByM0Pw3qt0KgyU_BShB1oGtZBkrEWuannFsRMVvGd0QBytZt8blh/pub#h.6nmc2npa81c8)\n\n[Implement a feature to publicly share curriculum-aligned content](https://docs.google.com/document/d/e/2PACX-1vT49WKgbsAIUoJ0jJS8LTWWm7UTByM0Pw3qt0KgyU_BShB1oGtZBkrEWuannFsRMVvGd0QBytZt8blh/pub#h.7kqwcc4crla4)\n\nCreate Robust Windows App\n-------------------------\n\n### Background\n\nThe current deployment of Kolibri involves platform-specific applications for Windows, macOS, and Linux (Gnome), each requiring a separate Python environment setup on the host system. This approach presents significant challenges in terms of maintainability, user experience, and cross-platform compatibility.\n\n### Needs\n\n*   Change our installer to use [https://pyinstaller.org/](https://www.google.com/url?q=https://pyinstaller.org/&sa=D&source=editors&ust=1740814485029048&usg=AOvVaw01XXcZ6Ju48WzZHWuG_r2D) so we can use the same app we have in MacOs  and make it independent of the status of Python in the system where Kolibri is installed.\n*   Adapt current Kolibri app, [https://github.com/learningequality/kolibri-app](https://www.google.com/url?q=https://github.com/learningequality/kolibri-app&sa=D&source=editors&ust=1740814485029300&usg=AOvVaw2tg6uoeDxwwe3gceQ51CXD) to be fully compatible with Windows, integrating native features such as taskbar icon functionality and system-specific menus.\n\n### Outcome\n\nThe primary goal of this project is to streamline the deployment and operation of Kolibri by developing a unified application framework that is independent of the host system's Python environment.\n\n### Mentors\n\nRichard Tibbles and Prathamesh Desai\n\n### Skills\n\n*   WxPython\n*   Windows taskbar API\n*   Windows installation, configuration and services\n\n### Duration\n\n175 hours in 12 weeks\n\n### Difficulty level\n\nMedium\n\nImplement a prototype of a Rich Text Editor\n-------------------------------------------\n\n### Background\n\nKolibri Studio currently uses a very old version of Toast UI’s text editor. It is desirable to have an up to date Rich Text editor for use in both the Kolibri Learning Platform and Kolibri Studio, to generate Rich Text content in a way that can be scoped for the specific use case, and also extended to allow insertion of specific toolbar elements under specific circumstances.\n\n### Needs\n\n*   Create a prototype Vue.js based text editor component using a well maintained and robust text editing library\n*   Have feature parity for the existing text editor in Kolibri Studio\n*   Add underline and list formatting options to the text editor\n\n### Outcome\n\nA prototype Rich Text Editor, implemented within Kolibri Studio, that allows inlining of a range of rich text elements. Taking an HTML document as a reactive input/output for the Vue component.\n\n### Mentors\n\nMarcella Maki and Jacob Pierce\n\n### Skills\n\n*   Javascript\n*   Vue.js\n*   HTML/CSS\n\n### Duration\n\n175 hours in 12 weeks\n\n### Difficulty level\n\nMedium\n\nCreate a new user onboarding experience for Kolibri\n---------------------------------------------------\n\n### Background\n\nAlthough Kolibri has user documentation, within Kolibri there is not yet an in-app onboarding experience. This project would be to create that onboarding experience that introduces users to Kolibri's user interface Key features within the Learn plugin will be highlighted through informative pop-up elements containing tips after the user has completed the device setup process. It's designed to enhance user understanding and engagement with Kolibri UI.\n\nWith inclusivity at the heart of Learning Equality’s mission, building accessible products is an essential part of our day-to-day work. Approaching this frontend work with accessibility at the center will be critical for success.\n\n### Needs\n\n*   Research and evaluate the pros and cons of using (or upgrading) libraries like popper.js or tippy.js versus creating a custom approach that we could maintain ourselves\n*   Create an accessible, flexible popover component that can be associated with a variety of interactive elements on the page, such as links, buttons, or menu items\n*   Integrate the component into an onboarding workflow for new users\n\n### Outcome\n\nImplement a guided introduction to Kolibri for new users that helps orient users to features and navigation, and understand the product's value through experience.\n\n### Mentors\n\nLiana Harris and Marcella Maki\n\n### Skills\n\n*   HTML, Javascript, Vue.js\n*   Inclusive design principles, familiarity with WCAG specification\n\n### Duration\n\n175 hours in 12 weeks\n\n### Difficulty level\n\nMedium\n\nHTML5 Article Renderer\n----------------------\n\n### Background\n\nCurrently Kolibri allows for sandboxed HTML5 applications that are able to implement arbitrary styling, Javascript, HTML etc, all presented inside a sandboxed iframe. However, this puts a large burden on the content creator to have knowledge of HTML and CSS if all they want is to produce rich text content. In order to allow this, we wish to be able to render HTML5 documents outside of an iframe, and with carefully crafted styling to create a responsive article experience.\n\nThis will be building on previous technical work that handles taking an HTML5 document and applying sanitization to it to remove disallowed HTML tags.\n\n### Needs\n\n*   To create consistent styling to [this Figma spec](https://www.google.com/url?q=https://www.figma.com/design/aJIh0jUr7NhYA7nbxkhK4h/HTML5-rendering-support&sa=D&source=editors&ust=1740814485034999&usg=AOvVaw0O8IjaFgzP-sqz0JUmOrD5)\n*   Ensure responsive behaviours\n*   Ensure accessibility conformance as close as possible to [WCAG](https://www.google.com/url?q=https://www.w3.org/WAI/standards-guidelines/wcag/&sa=D&source=editors&ust=1740814485035275&usg=AOvVaw33bWrYKnCZSTzjSUuYcehu) 2.1 level AA.\n\n### Outcome\n\nA Kolibri content renderer that can take an ‘article’ format that consists either of an HTML5 document with all assets inlined, or an HTML5 article zip file, and render to spec. Stretch goals would include integration of existing renderers to handle audio, video, and other multimedia content for better rendering experiences than simple HTML5 elements.\n\n### Mentors\n\nSamson Akol, Allan Otodi Opeto, and Radina Matic\n\n### Skills\n\n*   Javascript\n*   Vue.js\n*   HTML/CSS\n*   Mobile responsiveness testing\n*   Accessibility testing\n\n### Duration\n\n175 hours in 12 weeks\n\n### Difficulty level\n\nMedium\n\nEasy sharing of community channels\n----------------------------------\n\n### Background\n\nIn many places, Kolibri is used to support the teaching of  local, regional, or national curricula. Aligning of open educational resources (OERs) to curricular standards can be done through Kolibri Studio, but is time consuming and requires expertise. Many organizations using Kolibri in their projects have already done the work to create sets of aligned channels.\n\nWhile it is currently possible to share channels and collections of channels within the Kolibri ecosystem, it is not user friendly. This project would update and add to that experience to improve the ease of sharing community curated libraries of resources for use within their projects and also for easier sharing with others.\n\n### Needs\n\n*   Implement a new “Community Library” feature (name is provisional) within Kolibri Studio, using the existing “Collections” backend functionality.\n*   Allow a way to make these “Community Libraries” publicly discoverable on Kolibri Studio so that users can choose to make their Community Libraries publicly discoverable for use by others.\n*   Implement a license audit feature, so that prior to making a community library publicly discoverable, the owner can assert and correct licensing to ensure that it is accurate and appropriate to be publicly shared.\n*   Implement the new add community library workflow in Kolibri, which will permanently record the token for the library so any time new resources are imported from Studio, the community libraries that have been added are displayed.\n\n### Outcome\n\nAn updated feature implemented within both Kolibri Studio and Kolibri that allows users to more easily share collections with aligned channels.\n\n### Mentors\n\nAlex Velez and Richard Tibbles\n\n### Skills\n\n*   Javascript\n*   Vue.js\n*   HTML/CSS\n*   Python\n*   Fullstack development\n\n### Duration\n\n175 hours in 12 weeks\n\n### Difficulty level\n\nMedium\n"}