{"name":"Open Food Facts","description":"Better food choices for your health & the planet","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/open-food-facts","ideas_url":"https://wiki.openfoodfacts.org/GSOC/2025_ideas_list","logo":"https://summerofcode.withgoogle.com/media/org/open-food-facts/ypo4wfmbo5ueujuf-360.png","technologies":["python","javascript","machine learning","perl","flutter"],"topics":["open data","health","environment","mobile","food"],"projects":[{"project_name":"Folksonomy Engine","summary":"Develop a user-friendly folksonomy engine to handle diverse product data effectively, enhancing property suggestions and usability features.","difficulty":"Medium"},{"project_name":"Feature Extension for Open Food Facts","summary":"Create a system allowing community developers to introduce new attributes and knowledge panels to enrich Open Food Facts applications.","difficulty":"Medium"},{"project_name":"Moodle Integration Plugin","summary":"Develop a plugin that integrates Open Food Facts data into Moodle to enhance educational resources on food choices.","difficulty":"Medium"},{"project_name":"H5P Content Generator","summary":"Create a generator that produces H5P content types using Open Food Facts data for educational applications.","difficulty":"Medium"},{"project_name":"Open Food Facts Explorer","summary":"Revamp the Open Food Facts frontend using SvelteKit to improve usability and mobile compatibility.","difficulty":"Medium"},{"project_name":"Mini Games for Mobile App","summary":"Introduce engaging mini-games in the Open Food Facts mobile app to educate users about food products.","difficulty":"Medium"},{"project_name":"Porting Open Prices Features to Mobile App","summary":"Integrate Open Prices functionalities into the Open Food Facts mobile app, enabling price comparisons and contributions on-the-go.","difficulty":"Medium"}],"jina_response":"Title: GSOC/2025 ideas list - Open Food Facts wiki\n\nURL Source: https://wiki.openfoodfacts.org/GSOC/2025_ideas_list\n\nMarkdown Content:\nHere are ideas for GSOC There are just ideas, and are non limitative.\n\n**IMPORTANT**:\n\n*   for an introduction on how to candidate, **read [https://world.openfoodfacts.org/google-summer-of-code](https://world.openfoodfacts.org/google-summer-of-code)**\n*   take also the time to visit [our website](https://world.openfoodfacts.org/) to understand the project more in depth.\n\nOpen Food Facts proposals\n-------------------------\n\n### Folksonomy Engine: a one size fit all for any product data\n\n#### Description\n\nAt Open Food Facts we are on a mission to collect any factual data about food products, but also cosmetics, and any products. Modelling every possible products is a challenging task but also topics can be very different based on usage. For example some researchers are interested in knowing the correlation between sugar in cereals and the presence of a cartoon on the front package.\n\nFaithful to our crowded sourced approach to open data collection, we devised Folksonomy Engine, akin to the way Open Street Map works.\n\nThe basics are there, but we need to make it more easy and efficient to use in order to reach a large public. We must introduce better properties suggestion, reusable widgets and\n\n#### Expected outcomes\n\nThe project, should deliver new API features, like suggestion based on popularity and categories, a better handling of nested properties values, tools for exploring and merging values.\n\nIt should also deliver an improved reusable javascript based web interface for display and edition, with maybe some formalization of properties definition.\n\nThe roadmap can be changed while iterating over features, to better achieve the goal of usability by a large variety of contributors.\n\n#### Project information\n\n*   repository: [https://github.com/openfoodfacts/folksonomy\\_api](https://github.com/openfoodfacts/folksonomy_api) (and [https://github.com/openfoodfacts/folksonomy\\_frontend](https://github.com/openfoodfacts/folksonomy_frontend))\n*   Slack channels: #folksonomy\\_engine\n*   Potential mentors: Alex G. (slack: _Alex G._, alex -at- openfoodfacts.org, github: [alexgarel](https://github.com/alexgarel/)), Charles Nepote\n*   Project duration: 175 hours or 350 hours\n*   Skills required: Python, Javascript\n*   Difficulty rating: Medium\n\n### Add a way to easily extend the features of the Open Food Facts website, mobile app and reusing apps\n\n#### Description\n\nOpen Food Facts gathers raw product data and computes attributes (e.g. nutritional and environmental scores, allergens) that users can filter and rank products on, and knowledge panels to provide useful and actionable information (e.g. information about ingredients). We already have an internal API for sending attributes and knowledge panels to the Open Food Facts website and mobile app. We now want to make it much easier to our community to create new attributes and knowledge panels to create extensions for our website, app and all the apps that reuse Open Food Facts data.\n\n#### Expected outcomes\n\nThe task is to create a standalone system in Python to compute attribute and knowledge panels from the raw JSON product data (we already have a standalone sytem to compute panels for categories that can be reused as a model). The system should make it easy for community developers to create and test new attributes and knowledge panels. As a first use case, the system will provide attributes and panels to let users declare that they do not eat specific ingredients of their choosing.\n\n#### Project information\n\n*   repository: [https://github.com/openfoodfacts/facets-knowledge-panels](https://github.com/openfoodfacts/facets-knowledge-panels)\n*   Slack channels: #productopener\n*   Potential mentors: Stéphane Gigandet, Pierre Slamich, Alex Garel\n*   Project duration: ~350 hours\n*   Skills required: Python, JSON REST API\n*   Difficulty rating: Medium\n\n### Moodle Integration Plugin\n\n#### Description\n\nThis project aims to create a bridge between [Moodle](https://moodle.org/), a popular learning platform ([stats](https://stats.moodle.org/)), and Open Food Facts ([OFF](https://world.openfoodfacts.org/)), the open database of food products. The goal is to facilitate the creation of high-quality educational resources on healthy and sustainable food choices. It will make OFF data easily accessible to course creators. It could also lead teachers and students to contribute data into OFF through educational activities like [hunger games](https://hunger.openfoodfacts.org/), [scan parties](http://scan.party/), etc.\n\n#### Expected outcomes\n\nA [Moodle integration plugin](https://moodle.org/plugins/) for Open Food Facts. This plugin should allow the automatic import of OFF data into:\n\n*   Moodle [Blocks](https://docs.moodle.org/405/en/Blocks), to display food information in the side dock (column on the right)\n*   Moodle [Database activitiy](https://docs.moodle.org/405/en/Database_activity) and [Glossary activity](https://docs.moodle.org/405/en/Glossary_activity), to make food information accessible in the main course sections\n*   Moodle [Question bank](https://docs.moodle.org/405/en/Question_bank) and [Quizz activity](https://docs.moodle.org/405/en/Quiz_activity), for the creation of quizzes\n\nUltimately, the project also plans for an OFF [Moodle theme](https://moodle.org/plugins/browse.php?list=category&id=3) and a resource sharing hub like [MoodleNet](https://moodle.net/). We may swap one of these items into the project backlog, if a contributor prefers to.\n\n#### Project information\n\n*   Repo: to be created on May 8\n*   Slack channels: #education #education-fr\n*   Potential mentors: Louis Bastarache (slack: Louis Bastarache)\n*   Project duration: 350 hours\n*   Skills required: PHP, HTML, MySQL and a data source [here](https://wiki.openfoodfacts.org/Reusing_Open_Food_Facts_Data \"Reusing Open Food Facts Data\")\n*   Difficulty rating: Medium\n*   Moodle: [https://moodle.mieuxchoisir.org/](https://moodle.mieuxchoisir.org/)\n\n### H5P Content Generator\n\n#### Description\n\nThis project aims to create a bridge between [H5P](https://h5p.org/) and the Open Food Facts database. It's related to the Moodle project, but it's shorter and the skills are slighly different. It would make educational content available on Moodle, but also on CMS, wiki and web pages. Consider it as an ETL project: you have to extract data from the OFF DB, transform it, and load it in an HTML5 package. We will need a UI/API tu use it. It's an ongoing project, so it may be easier to complete something in less than 350 hours.\n\n#### Expected outcomes\n\nA standalone H5P generator that will create [H5P content types](https://h5p.org/content-types-and-applications) based on OFF data. We've begun to work on automatic content generation from the OFF database. The next step would be to improve our work and generate some H5P content types. Since we have a generation recipe for them, the content types that we target first are [Drag the words](https://h5p.org/drag-the-words), [Fill in the blanks](https://h5p.org/fill-in-the-blanks), [Mark the words](https://h5p.org/mark-the-words), [Quiz](https://h5p.org/question-set), [Single choise set](https://h5p.org/single-choice-set) and [Summary](https://h5p.org/summary).\n\n#### Project information\n\n*   Repo: to be created on May 8\n*   Slack channels: #education #education-fr\n*   Potential mentors: Louis Bastarache (slack: Louis Bastarache)\n*   Project duration: 175-350 hours\n*   Skills required: Java, Spring, Firebase and a data source [here](https://wiki.openfoodfacts.org/Reusing_Open_Food_Facts_Data \"Reusing Open Food Facts Data\")\n*   Difficulty rating: Medium\n\n### Open Food Facts Explorer - a new generation frontend\n\n#### Description\n\nThe Open Food Facts Explorer is a modern frontend for Open Food Facts, developed using SvelteKit. It offers functionalities such as basic editing, product page displays with Knowledge Panels support, search capabilities, and user authentication. Additionally, it incorporates the new folksonomy engine and a taxonomy explorer, enhancing data organization and accessibility.\n\n#### Expected outcomes\n\nThe main objective of the project is to refine and expand its features to align with the standard Open Food Facts website.\n\n*   Decoupling the backend from the frontend will improve the long-term maintainability of the codebase, while leveraging a modern JavaScript framework will facilitate the development of new features.\n*   It also has the potential to make the website far more easy to use on a mobile, which constitute more than 70% of visits\n*   SvelteKit's support for server-side rendering (SSR) and emphasis on accessibility enhance the responsiveness of the web application, broadening its potential reach.\n\nThe development roadmap remains flexible, allowing adjustments during iterations to improve usability and ensure feature completeness.\n\n#### Project information\n\n*   Repository: [https://github.com/openfoodfacts/openfoodfacts-explorer](https://github.com/openfoodfacts/openfoodfacts-explorer)\n*   Slack channels: #off-explorer\n*   Potential mentors: VaiTon\n*   Project duration: ~175 hours\n*   Skills required: TypeScript, Svelte and SvelteKit (really easy to learn), a basic understanding of HTTP APIs\n*   Difficulty rating: Medium (for its length)\n\n### Add Mini Games to the Open Food Facts Mobile App\n\n#### Description\n\n*   Open Food Facts empowers users with information about food products. This project aims to enhance user engagement and education by introducing fun, informative mini-games within the Open Food Facts mobile app. These games will leverage the existing Open Food Facts data. The games will focus on contributions, and increasing user understanding of food .\n*   Potential mini-games are:\n    *   Hunger Games (AI Prediction Validation): This game will present users with questions about products, one after the other, on a given topic (category, nutrition facts, ingredients…). Users will then be asked to validate the prediction, and will move to a similar prediction for another product.\n    *   How Much Sugar? (Sugar Cube Guessing): This game will display a product image and name. Users will guess the number of sugar cubes equivalent to the product's sugar content per serving (or per 100g). The actual number of sugar cubes will drop in a playful animation.\n    *   Caloprix (Nutri-Score Guessing): This game challenges users to guess the Nutri-Score (A, B, C, D, or E) of a product based on its image, name, and potentially a limited set of other data points (e.g., category). The game will reveal the correct Nutri-Score and provide a brief explanation of what factors contribute to that score. The game ends when the user gets it wrong. The goal is to get as many good answers as possible in a row.\n    *   The Price is Right (Price Guessing): This game challenges you to guess the price of an item of a product, and answers you by saying “More” or “Less”. The goal is to guess the right prices in as little guesses as possible.\n\n#### Expected Outcomes\n\n*   Working Mini-Games: Several mini-games integrated into the Open Food Facts mobile app (iOS and Android) and our website.\n*   User Interface: A clean, intuitive, and engaging user interface for each mini-game, consistent with the Open Food Facts app's design.\n*   Testing: Thorough testing of the mini-games on various devices and screen sizes.\n\n#### Project Information\n\n*   Main Repository: [https://github.com/openfoodfacts/smooth-app](https://github.com/openfoodfacts/smooth-app)\n*   Web version of Hunger Games for reference: [https://hunger.openfoodfacts.org](https://hunger.openfoodfacts.org/)\n*   Slack Channels: #mobile-app-dev, #dev\n*   Potential Mentors: Edouard M, Primael Q and Pierre S\n*   Project Duration: ~350 hours\n*   Skills Required:\n*   Mobile App Development with Flutter\n*   JSON REST API interaction\n*   Design integration\n*   An experience with web development would be a great plus\n*   Difficulty Rating: Medium\n\nPorting Open Prices Features to the Open Food Facts Mobile App\n--------------------------------------------------------------\n\n#### Description\n\nThis project aims to integrate the core features of Open Prices into the Open Food Facts mobile application. Open Prices allows users to contribute and view price information for products, creating a valuable resource for consumers. Currently, this functionality is primarily available on the Open Prices website. Bringing Open Prices to the mobile app will significantly increase accessibility and user engagement, leveraging the app's existing user base. This will empower users to easily compare prices while shopping, contribute new price data on-the-go. The project will focus on seamlessly integrating these features into the existing app structure, ensuring a consistent and user-friendly experience.\n\n#### Expected outcomes\n\n*   Beautify the current user Interface and review the current user Experience (UI/UX) for existing flows: Prioritize a user-friendly and intuitive interface for both viewing and contributing price data, adhering to mobile design best practices.\n*   Price Viewing: Implement the ability to browse and search for product prices within the Open Food Facts mobile app. This should include clear display of current and historical prices, potentially with visualizations (e.g., price trends).\n*   Bulk Price Contribution using Artificial Intelligence: Enable users to easily add new bulk price information for products directly through the app. This should include mechanisms for data validation and image uploads for price verification.\n*   Offline Functionality: Add offline price contribution (data synced when a connection is available) using the current background task system\n\n#### **Project Information**\n\n*   Repository: https://github.com/openfoodfacts/smooth-app\n*   Slack channels: #prices\n*   Potential mentors: Raphael O., Edouard M., Pierre (contacted via Slack/GitHub)\n*   Project duration: ~175 hours (can be adjusted based on specific feature scope)\n*   Skills required: Flutter, mobile app development experience, familiarity with RESTful APIs, basic understanding of data visualization.\n*   Difficulty rating: Medium (due to mobile development complexities and API integration)\n\nYour idea\n---------\n\nYou are a candidate and have a specific project idea, that's really welcome.\n\nBut to maximize your chances, please:\n\n*   Contribute to the project none the less in the bounding period\n*   Check with us that your idea is a good fit and align with our priorities\n\nProject template\n----------------\n\n### <DESCRIPTIVE TITLE\\>\n\n#### Description\n\n_Explain what, why._\n\n#### Expected outcomes\n\n_Deliverables and KPI / benefits_\n\n#### Project information\n\n*   repository:\n*   Slack channels:\n*   Potential mentors:\n*   Project duration: ( ~90 hour, ~175 hours or ~350 hours)\n*   Skills required:\n*   Difficulty rating:\n"}