{"name":"Processing Foundation","description":"To empower all people to learn to program","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/processing-foundation","ideas_url":"https://github.com/processing/Processing-Foundation-GSoC/wiki/Project-Ideas-List-(GSoC-2025)","logo":"https://summerofcode.withgoogle.com/media/org/processing-foundation/xr2sncljbvtlop1n-360.png","technologies":["javascript","java","typescript","webgl","GitHub Actions"],"topics":["education","web","graphics","creative coding","design"],"projects":[{"project_name":"Friendly Sketch Embedder for p5.js","summary":"Develop a user-friendly tool to help p5.js users showcase their work on their websites by generating easily customizable embed codes for different purposes.","difficulty":"Easy/Medium"},{"project_name":"User-Friendly Features in the p5.js Editor","summary":"Enhance the autocomplete feature and potentially create a custom context menu in the p5.js Editor to improve user experience for over 200,000 frequent users.","difficulty":"Medium"},{"project_name":"Approachable Accessibility for p5.js Editor Contributors","summary":"Improve accessibility testing for the p5.js Editor by developing tools that facilitate manual testing and understanding UX for screen reader users to help future contributors.","difficulty":"Easy/Medium"},{"project_name":"Bring Visual Tests to Processing","summary":"Implement a visual snapshot testing system for Processing to catch visual regressions and improve test coverage, enhancing contributors’ confidence during code changes.","difficulty":"Medium"},{"project_name":"Code Translation between Processing Sound and p5.sound.js","summary":"Create an automated tool for converting sketches between Processing Sound and p5.sound.js, facilitating easier sharing and collaboration across both platforms.","difficulty":"Medium/Hard"},{"project_name":"Friendly p5.js Reference Translation Tasks","summary":"Introduce GitHub automations to improve the translation of p5.js reference documentation, enhancing accessibility and encouraging global contributions.","difficulty":"Medium/Hard"}],"jina_response":"Title: Project Ideas List (GSoC 2025)\n\nURL Source: https://github.com/processing/Processing-Foundation-GSoC/wiki/Project-Ideas-List-(GSoC-2025)\n\nMarkdown Content:\nAbout the Processing Foundation\n-------------------------------\n\n[](https://github.com/processing/Processing-Foundation-GSoC/wiki/Project-Ideas-List-(GSoC-2025)#about-the-processing-foundation)\n\nOur mission at the Processing Foundation is to promote software learning within the arts, artistic learning within technology-related fields, and to celebrate the diverse communities that make these fields vibrant, liberatory, and innovative. Our goal is to support people of all backgrounds in learning how to program and make creative work with code, especially those who might not otherwise have access to tools and resources. We also believe that some of the most radical futures and innovative technologies are being built by communities that have been pushed to the margins by dominant tech.\n\nTo learn more about the Processing Foundation, see our official website at [processingfoundation.org](https://processingfoundation.org/).\n\nWhat makes a good proposal?\n---------------------------\n\n[](https://github.com/processing/Processing-Foundation-GSoC/wiki/Project-Ideas-List-(GSoC-2025)#what-makes-a-good-proposal)\n\nFor all of our projects, it's incredibly important that things are kept as simple and user-friendly as possible. We aim to make our work accessible to everyone, especially those new to coding. Therefore, we focus on making everyday tasks easier for as many people as possible more than on adding features for experts. Keep these values in mind when writing your proposal and you'll greatly increase your chances to get selected by the Processing Foundation for the GSoC program.\n\nFor more information about GSoC and instructions on how to apply, please see our 📄[README](https://github.com/processing/Processing-Foundation-GSoC/).\n\n🌸 Have questions about the organization or the projects? Check out the [GSoC 2025 Discourse thread](https://discourse.processing.org/t/suggestions-for-new-contributors-gsoc-2025/45641)! 🌸\n\nProject ideas\n-------------\n\n[](https://github.com/processing/Processing-Foundation-GSoC/wiki/Project-Ideas-List-(GSoC-2025)#project-ideas)\n\nThis section contains a list of ideas and how you can help contribute to the Processing Foundation's work on [Processing](https://processing.org/), [p5.js](http://p5js.org/), and [p5.js Editor](https://editor.p5js.org/). Each project has both a potential technical outcome, and a significant possible community impact - we are excited to hear your creative approaches to any of these timely technical challenges!\n\n*   [Good First Issues in p5.js](https://github.com/processing/p5.js/issues?q=is%3Aissue%20state%3Aopen%20label%3A%22Good%20First%20Issue%22)\n*   [Good First Issues in p5.js Editor](https://github.com/processing/p5.js-web-editor/issues?q=is%3Aissue%20state%3Aopen%20label%3A%22Good%20First%20Issue%22)\n*   [Help Wanted Issues in Processing4](https://github.com/processing/processing4/issues?q=is%3Aissue%20state%3Aopen%20label%3A%22help%20wanted%22)\n*   [p5.sound.js Issues](https://github.com/processing/p5.sound.js/issues)\n\nFriendly Sketch Embedder for p5.js\n----------------------------------\n\n[](https://github.com/processing/Processing-Foundation-GSoC/wiki/Project-Ideas-List-(GSoC-2025)#friendly-sketch-embedder-for-p5js)\n\n**Create a user-friendly tool that guides a [p5.js](https://github.com/processing/p5.js) user of any level to help showcase their work in their own websites.** Anyone can make a sketch with p5.js - as interactive art, as teaching material, as data visualization, as game, as diary, and as anything else they can imagine! A p5.js sketch is a canvas element that can be included in any website, and existing tutorials help to do this. How can embedding a sketch be streamlined, and support all the different kinds of use-cases and customizations? For example, a teacher may want to include code snippets; an artist may want to arrange multiple sketches next to one another.\n\n*   _Expected outcomes:_ A possible **technical outcome** could be a standalone interactive webpage with user-friendly settings that helps visitors to generate sketch embed code depending on their needs. The **community impact** can be very wide, making it easier for users to take their work beyond a classroom or a tutorial and into their own interactive online space.\n*   _Skills:_ Some familiarity of JavaScript is needed, but this could be a good project to sharpen your skills!\n*   _Possible mentor:_ [Dora Do](https://doradocodes.com/)\n*   _Size and Rating:_ 90H, Easy/Medium\n\nUser-Friendly Features in the p5.js Editor\n------------------------------------------\n\n[](https://github.com/processing/Processing-Foundation-GSoC/wiki/Project-Ideas-List-(GSoC-2025)#user-friendly-features-in-the-p5js-editor)\n\nThe [p5.js Editor](https://github.com/processing/p5.js-web-editor) has thousands of users, and 15% of them use the current autocomplete feature - [try it out](https://editor.p5js.org/) by turning it on in the settings! **How can this feature be improved or expanded to make writing code in the p5.js Editor even friendlier?** For a longer/larger project, you can propose a custom context menu for the p5.js Editor: when a user right-clicks, what would be helpful for them to able to see and do? Alternatively, we welcome proposals that focus on improving the accessibility of the autocomplete hinter, such as for screenreader users.\n\n*   _Expected outcomes:_ A possible **technical outcome** could be a pull request or a release in the p5.js-web-editor project that updates the autocomplete widget, or adds a custom context menu widget. The **community impact** will be among those who use the p5.js Editor, which gets around 200,000 views weekly!\n*   _Skills:_ Some experience with JavaScript required. Familiarity with digital accessibility (a11y); TypeScript; and/or documentation.js/JSDoc can be a plus.\n*   _Possible mentor:_ [Diya Solanki](https://github.com/diyaayay)\n*   _Size and Rating:_ 90H-175H, Medium\n\nApproachable Accessibility for p5.js Editor Contributors\n--------------------------------------------------------\n\n[](https://github.com/processing/Processing-Foundation-GSoC/wiki/Project-Ideas-List-(GSoC-2025)#approachable-accessibility-for-p5js-editor-contributors)\n\nAccessibility is very important for the [p5.js Editor](https://github.com/processing/p5.js-web-editor), but contributors sometimes face challenges testing and implementing accessibility feature. This project starts with [ARIA-roles](https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA/Roles) to the File Manager, Project List View, or User Account Settings. Based on the challenges encountered by the contributor, they can explore ways to **make accessibility testing more approachable for future contributors** by creating a proof-of-concept tool in the following areas: seamless integration of manual testing, increasing understanding of UX for screen reader users, or strategies for ARIA internationalization. We have found that automated accessibility testing tools alone are not thorough enough, but accessibility testing (both manual and automated) is needed for every feature addition.\n\n*   _Expected outcomes:_ A possible **technical outcome** could be pull request(s) in the p5.js-web-editor repository that implements editor accessibility improvements. This project idea focuses on improving developer tooling, so the **community impact** extends to both users of the p5.js Editor, and to its contributors.\n*   _Skills:_ Some familiarity of JavaScript is needed, but this could be a good project to sharpen your skills!\n*   _Possible Mentor:_ Tristan Espinoza\n*   _Size and Rating:_ 90H, Easy/Medium\n\nBring Visual Tests to Processing\n--------------------------------\n\n[](https://github.com/processing/Processing-Foundation-GSoC/wiki/Project-Ideas-List-(GSoC-2025)#bring-visual-tests-to-processing)\n\nThis project aims to **implement a visual snapshot testing system for [Processing](https://processing.org/)**, inspired by the one used in p5.js (read about it [in the p5.js documentation](https://p5js.org/contribute/unit_testing/) or in [a recent contributor blogpost](https://www.davepagurek.com/blog/p5-2.0-philosophy/)). Snapshot tests help catch visual regressions by automatically comparing generated images before and after code changes. The project will focus on building the testing framework, automating comparisons using pixel matching, and integrating the system into GitHub workflows for optional testing on pull requests. This project also involves porting existing p5.js snapshot tests and developing new ones for Processing’s Java environment. This will improve test coverage, help catch regressions, and make it easier for contributors to propose changes with confidence.\n\n*   _Expected Outcomes:_ The **technical outcome** would be an automated snapshot testing system for Processing with pixel comparisons, GitHub integration, baseline snapshots, and documentation. This project idea focuses on improving developer tooling, so the **community impact** extends to both users of Processing, and to its current and future contributors!\n*   _Possible Mentors:_ [Claudine Chen](https://mingness.github.io/)\n*   _Skills required/preferred:_ Java, JavaScript, GitHub Actions/Workflows\n*   _Size and Rating:_ 175H, Medium\n\nCode Translation between Processing Sound and p5.sound.js\n---------------------------------------------------------\n\n[](https://github.com/processing/Processing-Foundation-GSoC/wiki/Project-Ideas-List-(GSoC-2025)#code-translation-between-processing-sound-and-p5soundjs)\n\nBoth p5.js and Processing support sound synthesis, playback, and analysis, but only p5.js does it directly in the web browser with [p5.sound.js](https://github.com/processing/p5.sound.js). An automated tool converting [Processing Sound](https://processing.org/reference/libraries/sound/index.html) to p5.sound.js and vice versa would benefit both communities: Processing Sound users could more easily share work on the web, and p5.sound.js users could more easily adapt their sketches to a wide variety of devices. A code translation tool could also serve as a proof of concept for broader Processing–p5.js translation, which would improve sharing and collaboration across platforms beyond sound.\n\n*   _Expected Outcomes:_ A possible **technical outcome** could be a standalone interactive webpage with user-friendly settings that helps convert Processing Sound sketches into p5.sound.js sketches, and vice versa. This project idea focuses on improving developer tooling, so the **community impact** extends to both users of Processing Sound and p5.sound.js, and to current and future contributors!\n*   _Possible Mentors:_ Kevin Stadler\n*   _Skills:_ experience with both Java and JavaScript essential; optionally: some familiarity with p5.sound.js, Processing Sound, or Web Audio technologies can be a plus\n*   _Size and Rating:_ 175H, Medium/Hard\n\nFriendly p5.js Reference Translation Tasks\n------------------------------------------\n\n[](https://github.com/processing/Processing-Foundation-GSoC/wiki/Project-Ideas-List-(GSoC-2025)#friendly-p5js-reference-translation-tasks)\n\nThe p5.js website provides the most up-to-date [reference](https://p5js.org/reference/) for p5.js and p5.sound.js in five languages. The reference is automatically generated from inline documentation in the code, and translations are provided by contributors. **How can friendlier developer tools - such as GitHub automations - could help contributors work on translating documentation?** The p5.js reference strives to be user-friendly, welcoming, and accurate, so it is important that translation itself is not automated. Making it easier to contribute a translation helps invite more users of p5.js around the world to get involved in contributing to p5.js!\n\n*   _Expected Outcomes:_ The **technical outcome** would be GitHub Action(s) in [the p5.js reference website repository](https://github.com/processing/p5.js-website). This project idea focuses on improving developer tooling, so the **community impact** extends to p5.js contributors and users worldwide!\n*   _Skills/tech:_ JavaScript, Astro, Github Actions/Workflows; optional: JSDoc, documentation.js\n*   _Possible mentor:_ [Stalgia Grigg](https://stalgiagrigg.name/)\n*   _Size and Rating:_ 175H, Medium/Hard\n"}