{"name":"RTEMS Project","description":"A real-time operating system for Earth & Space","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/rtems-project","ideas_url":"https://projects.rtems.org/gsoc/","logo":"https://summerofcode.withgoogle.com/media/org/rtems-project/mo975scxu6bi0bfj-360.png","technologies":["python","c/c++","assembly","posix"],"topics":["kernel","embedded","real-time","multicore","rtos"],"projects":[{"project_name":"RTEMS GSoC Participation","summary":"RTEMS is applying to be a part of Google Summer of Code 2025, encouraging participation from potential contributors.","difficulty":"Medium"},{"project_name":"Communication Channels","summary":"Contributors are advised to engage with the community via Discord and mailing lists for support and discussions.","difficulty":"Easy"},{"project_name":"Application Requirements","summary":"Potential contributors must complete a Google application and adhere to guidelines for project selection and mentorship.","difficulty":"Medium"},{"project_name":"Building RTEMS","summary":"Contributors are required to build the RTEMS environment and run a simple 'hello world' application as part of the onboarding process.","difficulty":"Medium"},{"project_name":"Project Ideas and Scoping","summary":"Participants should choose projects from a list and work with mentors to appropriately define the scope based on personal capabilities and time constraints.","difficulty":"High"},{"project_name":"Proposal Writing","summary":"Contributors must draft their project proposals using a specified template to ensure clarity and structure.","difficulty":"Medium"},{"project_name":"Summer Coding Experience","summary":"The overall goal is for contributors to code effectively over the summer and engage actively with the community.","difficulty":"Easy"}],"jina_response":"Title: The RTEMS GSoC Projects Website\n\nURL Source: https://projects.rtems.org/gsoc/\n\nMarkdown Content:\nRTEMS is proud to have been in multiple editions of the Google Summer of Code and we are applying to be a participating organization in [Google Summer of Code 2025](https://summerofcode.withgoogle.com/).\n\nThis page is a jumping off point for participating with RTEMS. The best thing you can do for yourself is to join our [Discord](https://www.rtems.org/discord) and ask questions. We want you to be a part of the RTEMS community!\n\n**APPLYING GSOC CONTRIBUTORS MUST FILL OUT A [Google APPLICATION](https://summerofcode.withgoogle.com/)**\n\n**Potential Contributors**:\n\n*   Read through all the material on this page.\n*   Talk to us on [Discord](https://www.rtems.org/discord) or the [RTEMS mailing lists](https://lists.rtems.org/). The best place to get your questions answered is the #gsoc channel in the Discord! The devel mailing list is also good but sometimes takes longer to get a reply.\n*   Contributors applying to the RTEMS Project will need to fill out an application at [Google Summer of Code](https://summerofcode.withgoogle.com/).\n*   We require you build RTEMS and run hello world. The details are explained in our [GSoC Getting Started Guide](https://docs.rtems.org/docs/main/user/start/gsoc.html). Ask on Discord in the #gsoc channel for help.\n*   Pick a project from the list below. This is by no means an all-inclusive list and we are open to suggestions. Submissions of ports to new architectures, new BSPs, new device drivers, and test improvements are always welcomed. Mentors can be reached by Discord or the devel mailing list.\n*   The order of projects in the list does not reflect their importance, difficulty, or feasibility. Our project list is not exclusive: if you have an idea, solicit feedback from the project’s [Discord](https://www.rtems.org/discord). Many developers sit in Discord and check it (and their email) infrequently throughout the day, so be patient!\n*   Work with potential mentors to appropriately scope projects for the time available through the program. The project descriptions often require additional knowledge to flesh out a project proposal. Scoping a project is especially challenging as each contributor brings their own experience and capabilities to bear. Since some projects have multiple steps, contributors should work with prospective mentors to define the scope of work in their proposal. Similarly, some projects might be a starting point for a class project or graduate thesis. We generally underspecify our project descriptions for students and new contributors on purpose. The scope that can be accomplished in the timeframe varies depending on individual contributor’s experience and skills. So, we like to let new contributors explore the projects and discuss with potential mentors in order to shape the proposal in a way that suits the contributor’s and mentors’ interests with a scope that is appropriate.\n*   Write your proposal using our [proposal template](https://docs.google.com/document/d/1F5XCodvX8AYNqWX5ssu7dfjkmFT__83uf8ABKbB_Pkg/edit).\n*   Code your heart out and have a great summer!\n\n  \n\n| Project name | Created | Updated | Language |\n| --- | --- | --- | --- |\n| Loading... |\n\n| Project name | Created | Updated | Language |\n| --- | --- | --- | --- |\n| Loading... |\n\n| Project name | Created | Updated | Language |\n| --- | --- | --- | --- |\n| Loading... |\n"}