{"name":"The Linux Foundation","description":"Non-profit consortium fostering growth of Linux","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/the-linux-foundation","ideas_url":"https://wiki.linuxfoundation.org/gsoc/google-summer-code-2025","logo":"https://summerofcode.withgoogle.com/media/org/the-linux-foundation/ydeu9rliawhe6of9-360.png","technologies":["c","linux","cups","ai","fuzz-testing"],"topics":["kernel","automotive","printing","iio","zephyr"],"projects":[{"project_name":"Google Summer of Code 2025","summary":"An overview of projects and guidelines for participating in the 2025 Google Summer of Code under The Linux Foundation.","difficulty":"Moderate"}],"jina_response":"Title: gsoc:google-summer-code-2025 [Wiki]\n\nURL Source: https://wiki.linuxfoundation.org/gsoc/google-summer-code-2025\n\nMarkdown Content:\ngsoc:google-summer-code-2025\n\n### Table of Contents\n\nThis is our list of project ideas for the [Google Summer of Code](https://summerofcode.withgoogle.com/ \"https://summerofcode.withgoogle.com/\") program in [2025](https://opensource.googleblog.com/2025/01/google-summer-of-code-2025-is-here.html \"https://opensource.googleblog.com/2025/01/google-summer-of-code-2025-is-here.html\").\n\n**Dear contributors**, if you want to apply for doing a Google Summer of Code project with us you can choose a project from our workgroup's lists but you can also present your own idea fitting to any of the workgroups below. Please note that you have to choose “The Linux Foundation” as your mentoring organization, independent of the workgroup where you want to do your project.\n\nThe organizers of the GSoC are especially welcoming projects about **security** and about **Artificial Intelligence/Machine Learning (AI/ML)**. They will give special support to these. We will also mark appropriate project ideas in the project idea lists. Also consider this if you come up with your own idea or if you are a mentor adding project ideas to our lists.\n\n**Note:** If you want to participate as contributor, you DO NOT need to be member of the GSOC group on the Linux Foundation web site, this group was formerly used for writing these pages and now it is not used any more.\n\nDates\n-----\n\n*   _February 27, 2025_ \\- The Linux Foundation got accepted as mentoring organization!\n    \n*   _March 24, 2025_ \\- Applications open for contributors\n    \n*   _April 8, 2025_ \\- Deadline for contributors to apply\n    \n\nFull [timeline](https://developers.google.com/open-source/gsoc/timeline \"https://developers.google.com/open-source/gsoc/timeline\")\n\nNotes to take for contributors\n------------------------------\n\n**Note:** Many of the links come from Google Summer of Code programs of the past. Therefore if you read the word “student”, consider this as “contributor”. No proof of enrollment at college or university is required (at least for those who enter as free-software newcomer).\n\n*   On your application be sure to mention which of the listed Linux Foundation workgroups and, if applicable which of their listed project ideas you are applying for. If you are suggesting your own idea be sure to clarify that.\n    \n\n*   On the front page click the field to apply as a contributor and then choose “The Linux Foundation” as your mentoring organization from the long list. To find it, use the filter field under “Name” or use the drop-down menu at the bottom to display the full list (there are more than 150 organizations).\n    \n\nBefore applying, please have a look at the page(s) of the desired workgroup(s) linked below and do not hesitate to ask questions using the contact info (e-mail, IRC) of the workgroup in which you want to do your project. Often they want to get involved with you before you apply, starting to integrate you into their community, so introduce yourself to them as soon as possible. For general questions about participating as GSoC contributor in projects of the Linux Foundation, please contact the organization administrotors (see below).\n\n**Mastodon/Fediverse: [#LinuxFoundation](https://ubuntu.social/tags/linuxfoundation \"https://ubuntu.social/tags/linuxfoundation\")**\n\nLinux Foundation GSoC Project groups\n------------------------------------\n\nThe Linux Foundation sponsors development in different areas. Each area has a set number of GSoC projects available for 2025 as suggested projects which you can apply for and they are also open for your project suggestion.\n\nOur source code repositories\n----------------------------\n\nOrganization Administrators\n---------------------------\n\nThe participation of the Linux Foundation in the Google Summer of Code is organized by Till Kamppeter (till at linux dot com) and Aveek Basu (basu dot aveek at gmail dot com).\n\ngsoc/google-summer-code-2025.txt· Last modified: 2025/02/27 20:43 by\n\ntill\n"}