{"name":"The Palisadoes Foundation","description":"Social media and member management for non-profits","gsoc_url":"https://summerofcode.withgoogle.com/programs/2025/organizations/the-palisadoes-foundation","ideas_url":"https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas","logo":"https://summerofcode.withgoogle.com/media/org/the-palisadoes-foundation/d9zsxo0idjsl7kug-360.png","technologies":["python","postgresql","flutter","graphql","typescript"],"topics":["web","api","networking","ai","mobile"],"projects":[{"project_name":"Talawa Admin Plugins","summary":"Enhance the Talawa plugin system for better extensibility and integration with payment systems, while refactoring for ease of use and flexibility similar to popular existing systems.","difficulty":"Medium"},{"project_name":"Improved Usability & Hardening - Talawa Mobile","summary":"Refactor the Talawa Mobile code base to improve security, performance, and accessibility features, specifically in notifications and event management.","difficulty":"Medium"},{"project_name":"Notification Improvements - Talawa Admin","summary":"Refactor the Talawa Admin system to implement a robust notification system, alongside enhancements for event guest invitations and chat features.","difficulty":"Medium"},{"project_name":"Talawa Accessibility for Blind Users (Mobile)","summary":"Enhance accessibility features in Talawa for blind users, including voice message transcription, text-to-speech functionalities, and voice command capabilities.","difficulty":"Medium"},{"project_name":"Talawa Enhanced Testing","summary":"Improve the overall testing strategy across all Talawa repositories, addressing key areas of memory management and introducing automated unit tests with AI tools.","difficulty":"Medium"},{"project_name":"Enhanced SwitchMap-NG Web Features","summary":"Revamp the web UI/UX of SwitchMap-NG to modernize it, utilizing new features from updated web technologies and enhancing community engagement.","difficulty":"Medium"},{"project_name":"Enhanced SwitchMap-NG Scalability","summary":"Expand the functionalities of SwitchMap-NG to support distributed multi-site deployment with improved polling mechanisms and historical data storage.","difficulty":"Medium"},{"project_name":"Hybrid Ideas","summary":"Propose innovative enhancements that build on existing repositories and features while ensuring user appeal and feasibility for non-profit organizations.","difficulty":"Medium"}],"jina_response":"Title: GSoC Ideas | Palisadoes Foundation\n\nURL Source: https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas\n\nMarkdown Content:\n**NOTE:** These ideas are subject to change at any time prior to us submitting our GSoC 2025 Organization application. Ideas may be added, removed or updated up to this time.\n\n1.  If we are accepted, there may be additions and minor modifications.\n2.  Mentor assignments may be adjusted throughout the evaluation period\n\nWelcome to our GSoC ideas page! Get familiar with our general philosophy by reading this section. The ideas follow afterwards.\n\n### General Considerations[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#general-considerations \"Direct link to General Considerations\")\n\nThis is not an exhaustive list of ideas, but they broadly classify the types of features on which we'd like to focus our attentions.\n\nYou are open to propose your own solutions.\n\n1.  We encourage candidates to think laterally.\n2.  Take the initiative and consider something hybrid taking thoughts from various ideas posted here or something totally new.\n\nWe want ideas that will have a material impact on the project\n\nRemember, the ideas list is just a guide for what we feel could be achieved, and not a strict list of requirements. Think of the overall goal of making a better product. Picking a subset of suggestions and expanding them beyond our expectations shows your initiative.\n\n**NOTE:** If you feel the project ideas will take too much time as stated, then:\n\n1.  Add that to your proposal\n2.  Include what you think a reasonable scope should be.\n\nWe need your ideas to be completed on time with 100% test cases with each PR.\n\n1.  Brittle code that breaks easily does not help the project\n2.  Incomplete functionality is not acceptable unless specifically stated.\n\nIf there are any dependencies on other project ideas, then state it. Also include additional or alternative things that you would do if the dependencies are not completed in your desired time frame\n\nThe project is so much in its infancy that we'll accept any good idea that users will want or will facilitate that they could want. They must significantly advance our goal of having an MVP within the year.\n\nWe also welcome any other ideas that we could use. Please review the \"Desired Features\" section of this website for **even more ideas** and further necessary information.\n\n### Internship Participants[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#internship-participants \"Direct link to Internship Participants\")\n\nMany of you reading this page are interested in participating in our various internship programs (eg. Google Summer of Code, GitHub Externship, Google Summer of Docs, Outreachy, etc.).\n\n1.  Make sure to read the relevant `Introduction` and `Application Guide`/ `Contribution Process` pages first.\n    1.  GSoC:\n        1.  [GSoC Introduction](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-introduction).\n        2.  [GSoC Application Guide](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-application-process).\n2.  Review the [Selection Criteria](https://developer.palisadoes.org/docs/internships/introduction/internship-selection-criteria) to ensure you meet all the requirements for a good proposal.\n3.  Use the [Application Template](https://developer.palisadoes.org/docs/internships/introduction/internship-application-template) as a guide to formatting your application. The tips on this page are very important.\n\nGood luck!\n\n### Documentation[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#documentation \"Direct link to Documentation\")\n\nWe need to reduce the learning curve of contributors and sysadmins alike. Project work needs to be well documented in our code so that tools can eventually automatically add it to our documentation websites.\n\n### Testing[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#testing \"Direct link to Testing\")\n\nAll code submitted must be tested. We are working towards getting to 100% test code coverage on all repositories. This will mean that you will have to write tests for new code you write or modify.\n\nThe test percent code coverage requirement will incrementally rise with each pull request. In some cases you may have to write a few extra tests for code you may not have updated. We hope this will be rare.\n\nWrite code that will work in the long term. Eliminate brittle code that will easily break.\n\n### Repository Languages and Skills[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#repository-languages-and-skills \"Direct link to Repository Languages and Skills\")\n\nHere is a list of basic skills that will be required for each repository.\n\n1.  **Talawa:** Flutter / Dart, GraphQL\n    1.  Work will be applied to the `develop-postgres` GitHub branch\n2.  **Talawa-API:** Typescript, GraphQL, PostgreSQL with the Drizzle ORM\n    1.  Work will be applied to the `develop-postgres` GitHub branch\n3.  **Talawa-Admin Portal:** TypeScript\n    1.  Work will be applied to the `develop-postgres` GitHub branch\n4.  **SwitchMap-NG:** Python\n    1.  Work will be applied to the `develop` GitHub branch\n\nThere are others, but these are the primary ones that will guide your contributions.\n\n### Impact Definition[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#impact-definition \"Direct link to Impact Definition\")\n\nWe have categorized the various ideas according to the degree of impact they will have to the project. Use these definitions to understand how each idea will affect our overall project goals.\n\n1.  **Low-hanging fruit:** These projects require minimal familiarity with the codebase and basic technical knowledge. They are relatively short, with clear goals.\n2.  **Risky/Exploratory:** These projects push the scope boundaries of our development efforts. They might require expertise in an area not covered by our current development team. They might take advantage of a new technology. There is a reasonable chance that the project might be less successful, but the potential rewards make it worth the attempt.\n3.  **Fun/Peripheral:** These projects might not be related to the current core development focus, but create new innovations and new perspective for our project.\n4.  **Core development:** These projects derive from the ongoing work from the core of our development team. The list of features and bugs is never-ending, and help is always welcome.\n5.  **Infrastructure/Automation:** These projects are the code that our organization uses to get our development work done; for example, projects that improve the automation of releases, regression tests and automated builds. This is a category in which a contributor can be really helpful, doing work that the development team has been putting off while they focus on core development.\n\n### Difficulty[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#difficulty \"Direct link to Difficulty\")\n\nMost of our project ideas require knowledge of two or more programming languages. Meaningful PRs that prove your understanding of the repos will always be beneficial. We have created testing issues specifically for this purpose.\n\n1.  **Hard:** Requires dominion of the language used by the repo most affected by the project. A good working knowledge of the languages used by other affected repositories will be needed.\n2.  **Medium:** A good working knowledge of the languages used by affected repositories will be needed.\n3.  **Easy:** A beginner's level knowledge of the languages is sufficient.\n\nTalawa is a suite of applications that is aimed at managing the memberships of community based organizations. This concept may be new to you, and we suggest you research non-profit organization and open source software project management software as a starting point. Talawa needs to have a broader reach and your additions to our ideas will make the difference. We have included links to YouTube videos on this page that will be useful in improving your understanding.\n\nYour solution should ideally consider the:\n\n1.  ability of typical small community organizations with limited resources to:\n    1.  get tech support to maintain the application\n    2.  have tech-savvy users\n    3.  afford long term costs\n    4.  need all membership information completely under their control\n    5.  manage services outside the applications\n2.  impact of using third party services\n3.  performance / usability trade-offs\n4.  potential data residency law requirements\n\nWe will not support administrative functions in any of our mobile apps.\n\n**Note**: During the GSoC evaluation period we will be focusing on:\n\n1.  Fixing bugs in the develop code that affect our [demo site](https://demo.talawa.io/)\n2.  Finishing the migration to a PostgreSQL API back end\n3.  Reducing the XSS risks of the Talawa apps and enhancing the encrypting their communication.\n\n* * *\n\n### Talawa Admin Plugins[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#talawa-admin-plugins \"Direct link to Talawa Admin Plugins\")\n\n1.  **Description:**  \n    Fix and enhance the Talawa plugin system for improved extensibility, usability, and support for additional functionalities such as payment system integration. The current plugin system does not allow for the upload of source code into a predefined directory structure, limiting external contributions. This needs to be refactored to operate similarly to systems like WordPress plugins, VS Code extensions, and Chrome browser extensions.\n2.  **Expected Outcomes:**\n    1.  **Plugin System:**\n        1.  Replace the existing plugin system with a more robust architecture allowing contributors to upload source code into a predefined directory structure.\n        2.  Support multiple external contributors to the Talawa code base.\n        3.  Operate similarly to WordPress plugins, enabling flexible and modular integrations.\n    2.  **(Plugin) Payment System Integration:**\n        1.  Refactor the plugin system to allow selective uploads of code for integrating payment systems, on a per-provider basis.\n        2.  Examples:\n            1.  PayPal integration as one plugin.\n            2.  Razorpay integration as another plugin.\n        3.  Use the WordPress plugin methodology as a guide.\n        4.  Maintain separate repositories (e.g., `Talawa-plugin-*`) for different plugins to support this functionality.\n        5.  This plugin would be used to accept single, recurring or fundraising campaign donations. Think of other feature areas where payments could be applicable.\n    3.  **(Plugin) AI for Usability:**\n        1.  **Primary Features:**\n            1.  Implement AI-driven SPAM filtering.\n            2.  Use AI for fact-checking comments.\n        2.  **Secondary Features:**\n            1.  Suggest improvements to event attendance.\n            2.  Propose volunteers for events.\n            3.  Generate announcements that yield better response rates.\n        3.  Integrate AI functionality into a separate repository for scalability.\n    4.  **Refactoring:**\n        1.  Reduce technical debt in the Talawa Mobile and Talawa Admin code bases.\n        2.  Improve security to meet modern standards.\n3.  **References:**\n    *   [https://docs-admin.talawa.io/docs/docs/plugins/plugin-architecture](https://docs-admin.talawa.io/docs/docs/plugins/plugin-architecture)\n4.  **Repos to update:**\n    1.  Talawa\n    2.  Talawa-API\n    3.  Talawa-Admin\n5.  **Depends on Project:** N/A\n6.  **Project Size:** 350 hours (Large)\n7.  **Possible Mentors:**\n    1.  Tasneem Koushar (Primary)\n    2.  Meetul Rathore (Secondary)\n8.  **Difficulty:** Medium\n9.  **Impact Definition:** Core development\n\n* * *\n\n### Improved Usability & Hardening - Talawa Mobile[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#improved-usability--hardening---talawa-mobile \"Direct link to Improved Usability & Hardening - Talawa Mobile\")\n\n1.  **Description:**  \n    Refactor the Talawa Mobile code base to reduce technical debt, enhance performance, improve security, and optimize usability. Address specific issues related to notifications, event management, and UX improvements.\n2.  **Expected Outcomes:** We require the following:\n    1.  **Security Enhancements:**\n        1.  Strengthen security, especially for file uploads, and implement measures to combat malicious content.\n        2.  This is external to the XSS and encryption improvement projects that are currently underway.\n    2.  **Notifications:**\n        1.  Build a robust notification system for Talawa Mobile.\n    3.  **Event Guest Invitations:**\n        1.  Introduce functionality to invite guests to events through the app.\n    4.  **Semiotics for UX Improvement:**\n        1.  Augment text with symbols to improve accessibility and usability for users with limited literacy.\n    5.  **General:**\n        1.  Refactor the Talawa Mobile code base to reduce technical debt, enhance performance, improve security, and optimize usability in these features and any others you propose.\n        2.  Maximize the use of reusable code.\n        3.  Optimize GraphQL queries to minimize the volume and type of unnecessary results\n    6.  **Related Improvements:**\n        1.  Consider any other improvements related to the overall goal\n3.  **Repos to update:**\n    1.  Talawa\n    2.  Talawa-Mobile\n4.  **Depends on Project:** N/A\n5.  **Project Size:** 350 hours (Large)\n6.  **Possible Mentors:**\n    1.  Parag Gupta (Primary / TBD)\n    2.  Md. Noman Khan (Secondary)\n7.  **Difficulty:** Medium\n8.  **Impact Definition:** Core development\n\n* * *\n\n### Notification Improvements - Talawa Admin[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#notification-improvements---talawa-admin \"Direct link to Notification Improvements - Talawa Admin\")\n\n1.  **Description:**  \n    Refactor the Talawa Admin code base to reduce technical debt, enhance security, and introduce new features related to notifications. Focus on improving the features and related UI/UX while ensuring the code meets modern best practices.\n2.  **Expected Outcomes:** These are the expected outcomes:\n    1.  **Notifications**: We need to implement a notification system to make the applications more usable.\n        1.  **Notification Template:**\n            1.  Admin created, stored in the DB\n            2.  Blueprint for creating notifications.\n            3.  Defines the content, type, title, and channel (e.g., email, SMS, or in-app notification).\n            4.  The possibility of dynamic variables being injected into the template for personalization.\n        2.  **Notification Log:**\n            1.  Maintains a structured DB log of all notifications sent to users or organizations.\n            2.  Includes details about the sender, recipient, status, and any dynamic data (variables)\n            3.  The ability to be queried for delivery statistics, status tracking, usage patterns.\n        3.  **Delivery:**\n            1.  Notifications routed to the appropriate channel (email, in-app, or SMS) based on the template.\n            2.  Additional features for possible frontend deep linking.\n        4.  **Engines & Services:**\n            1.  Sound scalable methodologies must be found to implement the feature.\n        5.  **Example:**\n            1.  A new event is created.\n            2.  An administrator creates a template: \"Hello `{{userName}}`, a new event `{{eventName}}` is live!\"\n            3.  The backend triggers notifications:\n                1.  Template: Event Update.\n                2.  Variables: `{ userName: \"Alice\", eventName: \"Hackathon\"}`.\n            4.  The Notification Engine sends personalized messages to all users.\n    2.  **Other:** Other non notification features include\n        1.  **Event Guest Invitations:**\n            1.  Add functionality to invite guests to events from the admin panel.\n        2.  **Chat Feature:**\n            1.  Refactor the chat system for better performance and integration with other features.\n        3.  **Code Quality**\n            1.  Maximize the use of reusable code\n            2.  Optimize GraphQL queries to minimize the volume and type of unnecessary results\n        4.  **Related Improvements:**\n            1.  Consider any other improvements related to the overall goal\n3.  **Repos to update:**\n    1.  Talawa\n    2.  Talawa-Admin\n4.  **Depends on Project:** N/A\n5.  **Project Size:** 350 hours (Large)\n6.  **Possible Mentors:**\n    1.  Disha Talreja (Primary)\n    2.  Rishav Jha (Secondary)\n7.  **Difficulty:** Medium\n8.  **Impact Definition:** Core development\n\n* * *\n\n### Talawa Accessibility for Blind Users (Mobile)[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#talawa-accessibility-for-blind-users-mobile \"Direct link to Talawa Accessibility for Blind Users (Mobile)\")\n\n1.  **Description:**  \n    Enhance Talawa’s accessibility features to support blind and visually impaired users. This includes transcription for voice messages, text-to-speech functionality, screen reader integration, and voice-activated commands.\n2.  **Expected Outcomes:**\n    1.  **Transcription for Voice Messages:**\n        1.  Convert voice messages to text using the Google Speech-to-Text API.\n        2.  Display transcriptions below voice messages.\n        3.  Implement optional language detection for user-preferred language transcription.\n    2.  **Text-to-Speech for Transcription:**\n        1.  Provide TTS functionality using the Flutter TTS plugin to read transcribed text aloud.\n    3.  **Screen Reader Integration:**\n        1.  Ensure all voice messages and transcriptions are properly read by screen readers (e.g., TalkBack for Android, VoiceOver for iOS).\n        2.  Ensure navigation compatibility with assistive technologies for seamless interactions.\n    4.  **Voice-Activated Commands:**\n        1.  Add support for voice commands to play recent messages, start recording, or access transcriptions without touch gestures.\n    5.  **Media Playback:**\n        1.  Implement a media player for seamless voice message playback with accessibility features.\n3.  **Repos to update:**\n    *   Talawa\n    *   Talawa-Mobile\n4.  **Depends on Project:** N/A\n5.  **Project Size:** 350 hours (Large)\n6.  **Possible Mentors:**\n    1.  Md. Noman Khan (Primary)\n    2.  Shekhar Patel (Secondary / TBD)\n7.  **Difficulty:** Medium\n8.  **Impact Definition:** Inclusive development\n\n* * *\n\n### Talawa Enhanced Testing[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#talawa-enhanced-testing \"Direct link to Talawa Enhanced Testing\")\n\n1.  **Description:**  \n    Improve the testing strategy across all Talawa codebases to ensure high-quality, secure, and maintainable code. Address issues like memory leaks, poor business logic, and lack of comprehensive test coverage. Integrate AI-driven tools for testing automation and efficiency.\n2.  **Expected Outcomes:**\n    1.  **Unit Testing with AI:**\n        1.  Use AI tools like CodeRabbit.ai to create unit tests for all modules in the Talawa application.\n    2.  **Memory Management Improvements:**\n        1.  Utilize tools like Keploy or Tramline to optimize memory usage and reduce application bloat.\n    3.  **End-to-End Testing:**\n        1.  Perform E2E tests for the Talawa Admin and Mobile codebases using tools like Puppeteer and Jest.\n        2.  Reference: [Talawa Admin Pull Request #580](https://github.com/PalisadoesFoundation/talawa-admin/pull/580#issuecomment-1463387821).\n    4.  **Prevent Bad Practices:**\n        1.  Implement mechanisms to catch and prevent poor coding practices, improving the codebase’s robustness and maintainability.\n3.  **Repos to update:**\n    *   Talawa\n    *   Talawa-Admin\n    *   Talawa-Mobile\n4.  **Depends on Project:** N/A\n5.  **Project Size:** 350 hours (Large)\n6.  **Possible Mentors:**\n    1.  Kevonia Tomlinson (Primary)\n    2.  Tasneem Koushar (Secondary)\n    3.  Md. Noman Khan (Secondary)\n7.  **Difficulty:** Medium\n8.  **Impact Definition:** Core development\n\n* * *\n\nSwitchMap-NG is a suite of applications that map the topology of information technology networks.\n\nOur v1.0 SwitchMap-NG code is used by a few organizations. There were requests to:\n\n1.  include historical data which led to the current version that has a database backend.\n2.  have pollers in diverse locations with a centralized web UI\n\nThis created additional complexity in the configuration and management of the application. It also creates opportunities for improved functionality.\n\n**NOTE:** You must use the latest packages wherever possible, there is good reason for this.\n\n1.  The `FlaskTable` package is incompatible with newer python versions.\n2.  `SQLAlchemy` package has had a major release upgrade\n\n* * *\n\n### Enhanced SwitchMap-NG Web Features[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#enhanced-switchmap-ng-web-features \"Direct link to Enhanced SwitchMap-NG Web Features\")\n\n1.  **Description:** The current web UI/UX needs to be improved to increase the usage of SwitchMap-NG by the wider community.\n2.  **Expected Outcomes:**\n    1.  Web UI/UX (Priority)\n        1.  The code uses deprecated python packages that prevent upgrading the rest to current versions. The flask-table package is the most notable one\n        2.  The UI looks dated because it uses the flask-table package for HTML tables. A more modern alternative is needed. This may or may not be written in Python.\n        3.  The latest version offers many new features. We are eager to add new web based capabilities based on these additions that will increase the usage of SwitchMap-NG by the wider community. For example:\n            1.  Using LLDP data to create network topology charts\n            2.  Showing the historical movement of devices across the network\n            3.  Bandwidth charting\n    2.  Repository Strategy\n        1.  We want to migrate from a monorepo to a polyrepo strategy. We feel this will:\n            1.  Allow optimization of each subsystem's code using the appropriate best practices.\n            2.  Reduce the learning curve to contribute.\n        2.  Your plan must include approaches to do this\n    3.  Installation (Priority)\n        1.  Use the containerized solution in the switchmap-ng repo as a guide to containerizing your work\n        2.  Interaction between the equivalent replacements for the daemons must only communicate via existing GraphQL API calls for data.\n        3.  We need an easy to use installation and configuration script for the web UI.\n            1.  The structure of the configuration files could be improved.\n    4.  Documentation (Priority)\n        1.  Create autogenerated markdown documentation for developers from the code base based on code comments.\n            1.  This is already done in our Talawa\\* repositories.\n            2.  GitHub actions must be created to ensure that the auto-generated documentation is formatted according to our standards.\n        2.  The site must be autoupdated whenever the markdown mentioned in this section is changed.\n    5.  Testing (Priority)\n        1.  We want to achieve 100% test code coverage for the repository using GitHub actions\n        2.  We also want GitHub actions to fail if codecov.io code coverage criteria are not met and coderabbit.io does not approve the PR.\n3.  **Repos to Update:** SwitchMap-NG\n4.  **Skills Required:** Proficiency in the code stacks related to the repository. Refer to the introduction section for more details.\n5.  **Depends on Project:** `Enhanced SwitchMap-NG Scalability`\n6.  **Project Size:** 350 hours (Large)\n7.  **Possible Mentors:**\n    1.  Aashima Wadhwa (Primary)\n    2.  TBD (Secondary)\n8.  **Difficulty:** Medium\n9.  **Impact Definition:** Risky/Exploratory\n\n* * *\n\n### Enhanced SwitchMap-NG Scalability[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#enhanced-switchmap-ng-scalability \"Direct link to Enhanced SwitchMap-NG Scalability\")\n\nFor the purposes of this section, the term `polling` should be interpreted as periodic data gathering.\n\n1.  **Description:** SwitchMap-NG has multi-site capabilities, but we need more functionality for it to scale from a few to thousands of pollers.\n2.  **Expected Outcomes:**\n    1.  Operation (Priority)\n        1.  The app isn’t suitable for a distributed deployment with groups of pollers that may not have access to the central API server. There needs to be an intuitive way for:\n            1.  pollers to reliably store and forward data to an aggregator in their region.\n            2.  each regional aggregator to send data to the central API server\n            3.  configuring this.\n        2.  The solution must tolerate poor connectivity between the pollers, aggregators and the API though a store and forward mechanism without the loss of data for a configurable amount of time.\n        3.  For the sake of simplicity, the pollers must get their configurations from the API either directly or through intermediate aggregators.\n    2.  Asynchronous Polling (Priority)\n        1.  The current python EasySNMP package is very resource intensive and must be replaced.\n        2.  Consider replacing multiprocessing / threaded polling with a faster asynchronous polling mechanism using Python’s asyncio or aiohttp for better scalability. This would allow polling of larger networks without blocking and improve the overall speed and resource usage. This would facilitate faster data collection, more efficient resource utilization, and the ability to scale to large networks.\n        3.  Another option would be to use a purpose built high performance SNMP application like MRTG/RRDTool to poll and/or evaluate the available SNMP parameters on the target devices.\n    3.  Realtime data updates by zone\n        1.  The current approach stores posted data to disk with periodic database updates.\n        2.  The speed of processing the data may have optimization potential.\n        3.  Different data types may require different polling intervals, for example device performance data versus device status data.\n            1.  This may require optimized, separate, purpose specific data gathering approaches.\n    4.  Historical Data Storage\n        1.  Use the current state database to more effectively store and analyze historical network data, such as port utilization, interface bandwidth rates, device status, and ARP data over time. This would allow users to analyze trends and detect issues that may have developed gradually.\n    5.  Additional Data Collection\n        1.  Extend SNMP support by parsing additional OIDs (MIB translations can be slower) for more detailed device information, such as CPU usage, memory stats, or interface statistics. This would make the inventory system more comprehensive.\n    6.  Repository Strategy\n        1.  We want to migrate from a monorepo to a polyrepo strategy. We feel this will:\n            1.  Allow optimization of each subsystem's code using the appropriate best practices.\n            2.  Reduce the learning curve to contribute.\n        2.  Your plan must include approaches to do this\n    7.  Installation (Priority)\n        1.  Use the containerized solution in the switchmap-ng repo as a guide to containerizing your work\n        2.  Interaction between the equivalent replacements for the daemons must only communicate via existing API calls. The RESTful posting of data to the DB API server’s file system should remain to reduce the potential overload unless a suitable alternative can be found.\n        3.  We need an easy to use installation and configuration script for the web UI.\n            1.  The structure of the configuration files could be improved.\n    8.  Documentation (Priority)\n        1.  Create autogenerated markdown documentation for developers from the code base based on code comments.\n            1.  This is already done in our Talawa\\* repositories.\n            2.  GitHub actions must be created to ensure that the auto-generated documentation is formatted according to our standards.\n        2.  The site must be autoupdated whenever the markdown mentioned in this section is changed.\n    9.  Testing (Priority)\n        1.  We want to achieve 100% test code coverage for the repository using GitHub actions\n        2.  We also want GitHub actions to fail if codecov.io code coverage criteria are not met and coderabbit.io does not approve the PR.\n3.  **Repos to Update:** SwitchMap-NG\n4.  **Skills Required:** Proficiency in the code stacks related to the repository. Refer to the introduction section for more details.\n5.  **Depends on Project:** `Enhanced SwitchMap-NG Web Features`\n6.  **Project Size:** 350 hours (Large)\n7.  **Possible Mentors:**\n    1.  Dominic Mills (Primary)\n    2.  TBD (Secondary)\n8.  **Difficulty:** Medium\n9.  **Impact Definition:** Risky/Exploratory\n\n* * *\n\nHybrid ideas add to the existing repos in ways we would not have foreseen. They must:\n\n1.  Use existing Palisadoes Foundation repositories\n2.  Add complementary features to one or more existing Palisadoes Foundation repositories\n\nHybrid ideas are not for new Palisadoes Foundation repositories.\n\n**Note:** It's important that you append a brief 3-4 word description to the name of your Hybrid idea. This will make it uniquely identifiable. It could assist us in selecting one or more hybrid ideas. For example if your hybrid idea is to `improve the deployment of foo`, you could name your project `Hybrid - Foo Deployment`. The title must have the word `Hybrid` in it.\n\n### Hybrid[​](https://developer.palisadoes.org/docs/internships/gsoc/gsoc-ideas#hybrid \"Direct link to Hybrid\")\n\n**Note:** It's important that you append a brief 3-4 word description to the name of your Hybrid idea. This will make it uniquely identifiable. It could assist us in selecting one or more hybrid ideas. For example if your hybrid idea is to `improve the deployment of foo`, you could name your project `Hybrid - Foo Deployment`. The title must have the word `Hybrid` in it.\n\n1.  **Description:** Do the ideas need something more? What completely new thoughts could be applied to the existing ideas? If you have answers to these questions then this section is for you.\n2.  **Expected Outcomes:** Your proposal must meet the guidelines below. It must:\n    1.  Not depend on other participants. There should be minimal impact by other participants disappearing or doing a very bad or very good job.\n    2.  Add completely new features not previously stated in ideas.\n    3.  Create features that users will want or facilitate new features that will be the groundwork for features that they would want.\n    4.  Be suitable for use by most non-profit organization.\n        1.  We are not interested in membership subscriptions and any related financial management at this time.\n    5.  Justify 350 hours of work.\n3.  **Repos to update:** Talawa, Talawa-API, Talawa-Admin\n4.  **Skills Required:** Code stacks related to repos above. See introduction section.\n5.  **Depends on Project:** N/A\n6.  **Project Size:** 350 hours (Large)\n7.  **Possible Mentors:**\n    1.  Shannika Jackson (Primary)\n    2.  Tyrone Taylor\n8.  **Difficulty:** Medium\n9.  **Impact Definition:** Risky/Exploratory\n"}